ws.org
#+options: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline author:t
#+options: broken-links:nil c:nil creator:nil d:(not "LOGBOOK") date:t e:t email:nil
#+options: f:t inline:t num:nil p:nil pri:nil prop:nil stat:t tags:t tasks:t tex:t
#+OPTIONS: timestamp:t title:t toc:1 todo:t |:t
#+OPTIONS: html-style:nil :html-head-include-scripts nil
#+title: Literal XMonad
#+date: <2020-12-24 Thu>
#+PROPERTY: header-args  :mkdirp yes
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="res/org.css"/>
#+EXPORT_FILE_NAME: index.html

**Note:** The source of this document does not always look nice, but otherwise my haskell sources wouldn't line up correctly

Use Emacs to export this configuration, but be carefull as it might also overwrite other settings!

* Build Xmonad

  Install dependencies:

  #+begin_example shell
  sudo pacman -S stack
  #+end_example

  - stack init  :  Create stack project config from cabal or hpack package specifications
  - stack build :  Build the package(s) in this directory/configuration
  - stack install: Shortcut for 'build --copy-bins'

  #+CAPTION: Xmonad build script
  #+begin_src sh :tangle-mode (identity #o555) :tangle "~/.config/xmonad/build" :mkdirp yes
    #!/bin/sh
    #
    # As of 0.13, xmonad --recompile will look for a custom build script.
    # Keep & after notify-send, if dunst is not running the process will hang
    #set -e

    EXEC_PATH="$1"
    ICON="~/Pictures/Icons/Xmonad-logo.svg.png"
    echo "DB: EXEC_PATH: $EXEC_PATH"

    die() {
        notify-send "Xmonad build FAILED!" "$1" -i "$ICON" &
        echo "Xmonad build FAILED! $1"
        exit 1
        }

    cd ~/.config/xmonad
    notify-send "Xmonad" "Build started ($1)" -i "$ICON" &
    #stack build || stack init
    stack install || die "Build error ($@)"
    ln -sf ~/.local/bin/xmonad $EXEC_PATH #!!
    xmonad --restart && notify-send "Xmonad build SUCCES!" "Restarted at $(date)" -i "$ICON" &
  #+end_src

  *Note:* Fitspec is needed for the cheatsheet.

  #+begin_src yaml1 :tangle "~/.config/xmonad/package.yaml" :noweb tangle
    name: myXmonad
    version: 0.0.7

    dependencies:
        - base
        - xmonad
        - xmonad-contrib
        - split
        - fitspec

    library:
        source-dirs: src

    executables:
        xmonad:
            source-dirs:  app
            main:         Main.hs
            dependencies: myXmonad
            ghc-options:
                - -threaded
                - -rtsopts
                - -with-rtsopts=-N
                - -Wall
  #+end_src

* app/Main.hs
  :PROPERTIES:
  :header-args:  :tangle "~/.config/xmonad/app/Main.hs"
  :END:

** Header

   #+begin_src haskell
     ---------------------------------------------------------------------------
     --                                                                       --
     --     _|      _|  _|      _|                                      _|    --
     --       _|  _|    _|_|  _|_|    _|_|    _|_|_|      _|_|_|    _|_|_|    --
     --         _|      _|  _|  _|  _|    _|  _|    _|  _|    _|  _|    _|    --
     --       _|  _|    _|      _|  _|    _|  _|    _|  _|    _|  _|    _|    --
     --     _|      _|  _|      _|    _|_|    _|    _|    _|_|_|    _|_|_|    --
     --                                                                       --
     ---------------------------------------------------------------------------
     -- Alex <qwxlea@gmail.com>                                               --
     -- https://github.com/qwxlea                                             --
     ---------------------------------------------------------------------------
     -- current as of XMonad 0.15
     ---------------------------------------------------------------------------
     module Main where
   #+end_src

