docs/ws.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-12-26 Sat 14:02 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Literal XMonad</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Alex Qwxlea" />
<link rel="stylesheet" type="text/css" href="res/org.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Literal XMonad</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org4cb1de7">Build Xmonad</a></li>
<li><a href="#org94e89ef">app/Main.hs</a></li>
<li><a href="#orgc5cef1f">src/Options.hs</a></li>
<li><a href="#orga8fb447">src/MyKeys.hs</a></li>
<li><a href="#org1fd0dc7">src/MyBar.hs</a></li>
<li><a href="#org1cd0d64">src/MyLayoutHook.hs</a></li>
<li><a href="#org32d87a9">src/MyManageHook.hs</a></li>
<li><a href="#orgb861bc1">src/MyCheatsheet</a></li>
<li><a href="#orgee4ef16">src/MyScratchpads</a></li>
<li><a href="#org0047c41">src/MyWorkspaces</a></li>
<li><a href="#orgdf0ba2c">External scripts</a></li>
<li><a href="#org45976d0">Xmobar</a></li>
<li><a href="#org86846b7">Thanks</a></li>
</ul>
</div>
</div>
<p>
<b><b>Note:</b></b> The source of this document does not always look nice, but otherwise my haskell sources wouldn't line up correctly
</p>

<p>
Use Emacs to export this configuration, but be carefull as it might also overwrite other settings!
</p>

<div id="outline-container-org4cb1de7" class="outline-2">
<h2 id="org4cb1de7">Build Xmonad</h2>
<div class="outline-text-2" id="text-org4cb1de7">
<p>
Install dependencies:
</p>

<pre class="example" id="org4fa293e">
  sudo pacman -S stack
</pre>

<ul class="org-ul">
<li>stack init  :  Create stack project config from cabal or hpack package specifications</li>
<li>stack build :  Build the package(s) in this directory/configuration</li>
<li>stack install: Shortcut for 'build &#x2013;copy-bins'</li>
</ul>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span>Xmonad build script</label><pre class="src src-sh">    <span class="org-comment-delimiter">#</span><span class="org-comment">!/bin/sh</span>
    <span class="org-comment-delimiter">#</span>
    <span class="org-comment-delimiter"># </span><span class="org-comment">As of 0.13, xmonad --recompile will look for a custom build script.</span>
    <span class="org-comment-delimiter"># </span><span class="org-comment">Keep &amp; after notify-send, if dunst is not running the process will hang</span>
    <span class="org-comment-delimiter">#</span><span class="org-comment">set -e</span>

    <span class="org-variable-name">EXEC_PATH</span>=<span class="org-string">"$1"</span>
    <span class="org-variable-name">ICON</span>=<span class="org-string">"~/Pictures/Icons/Xmonad-logo.svg.png"</span>
    <span class="org-builtin">echo</span> <span class="org-string">"DB: EXEC_PATH: $EXEC_PATH"</span>

    die() {
        notify-send <span class="org-string">"Xmonad build FAILED!"</span> <span class="org-string">"$1"</span> -i <span class="org-string">"$ICON"</span> &amp;
        <span class="org-builtin">echo</span> <span class="org-string">"Xmonad build FAILED! $1"</span>
        <span class="org-keyword">exit</span> 1
        }

    <span class="org-builtin">cd</span> ~/.config/xmonad
    notify-send <span class="org-string">"Xmonad"</span> <span class="org-string">"Build started ($1)"</span> -i <span class="org-string">"$ICON"</span> &amp;
    <span class="org-comment-delimiter">#</span><span class="org-comment">stack build || stack init</span>
    stack install || die <span class="org-string">"Build error ($@)"</span>
    ln -sf ~/.local/bin/xmonad $<span class="org-variable-name">EXEC_PATH</span> <span class="org-comment-delimiter">#</span><span class="org-comment">!!</span>
    xmonad --restart &amp;&amp; notify-send <span class="org-string">"Xmonad build SUCCES!"</span> <span class="org-string">"Restarted at $(date)"</span> -i <span class="org-string">"$ICON"</span> &amp;
</pre>
</div>

<p>
<b>Note:</b> Fitspec is needed for the cheatsheet.
</p>

<div class="org-src-container">
<pre class="src src-yaml1">    name: myXmonad
    version: 0.0.7

    dependencies:
        - base
        - xmonad
        - xmonad-contrib
        - split
        - fitspec

    library:
        source-dirs: src

    executables:
        xmonad:
            source-dirs:  app
            main:         Main.hs
            dependencies: myXmonad
            ghc-options:
                - -threaded
                - -rtsopts
                - -with-rtsopts=-N
                - -Wall
</pre>
</div>
</div>
</div>

<div id="outline-container-org94e89ef" class="outline-2">
<h2 id="org94e89ef">app/Main.hs</h2>
<div class="outline-text-2" id="text-org94e89ef">
</div>

<div id="outline-container-org11aa9a5" class="outline-3">
<h3 id="org11aa9a5">Header</h3>
<div class="outline-text-3" id="text-org11aa9a5">
<div class="org-src-container">
<pre class="src src-haskell">     <span class="org-comment-delimiter">--</span><span class="org-comment">-------------------------------------------------------------------------</span>
     <span class="org-comment-delimiter">--                                                                       </span><span class="org-comment">--</span>
     <span class="org-comment-delimiter">--     </span><span class="org-comment">_|      _|  _|      _|                                      _|    --</span>
     <span class="org-comment-delimiter">--       </span><span class="org-comment">_|  _|    _|_|  _|_|    _|_|    _|_|_|      _|_|_|    _|_|_|    --</span>
     <span class="org-comment-delimiter">--         </span><span class="org-comment">_|      _|  _|  _|  _|    _|  _|    _|  _|    _|  _|    _|    --</span>
     <span class="org-comment-delimiter">--       </span><span class="org-comment">_|  _|    _|      _|  _|    _|  _|    _|  _|    _|  _|    _|    --</span>
     <span class="org-comment-delimiter">--     </span><span class="org-comment">_|      _|  _|      _|    _|_|    _|    _|    _|_|_|    _|_|_|    --</span>
     <span class="org-comment-delimiter">--                                                                       </span><span class="org-comment">--</span>
     <span class="org-comment-delimiter">--</span><span class="org-comment">-------------------------------------------------------------------------</span>
     <span class="org-comment-delimiter">-- </span><span class="org-comment">Alex <a href="mailto:qwxlea%40gmail.com">&lt;qwxlea@gmail.com&gt;</a>                                               --</span>
     <span class="org-comment-delimiter">-- </span><span class="org-comment">https://github.com/qwxlea                                             --</span>
     <span class="org-comment-delimiter">--</span><span class="org-comment">-------------------------------------------------------------------------</span>
     <span class="org-comment-delimiter">-- </span><span class="org-comment">current as of XMonad 0.15</span>
     <span class="org-comment-delimiter">--</span><span class="org-comment">-------------------------------------------------------------------------</span>
     <span class="org-haskell-keyword">module</span> <span class="org-haskell-constructor">Main</span> <span class="org-haskell-keyword">where</span>
</pre>
</div>
</div>
</div>
