ws.org
** Body

  *Modules needed:*

   #+begin_src haskell -n
     import XMonad                                   -- standard xmonad library
     import XMonad.Config.Desktop                    -- default desktopConfig
     import XMonad.Hooks.EwmhDesktops                -- Fixes the automatic fullscreening & wmctrl
     import XMonad.Util.NamedActions (addDescrKeys') -- Don't use default key bindings
     import XMonad.Util.SpawnOnce (spawnOnce)        -- For running autostart only once (on login)

     import XMonad.Actions.DynamicProjects           -- For WS.projects
     import XMonad.Util.Run(spawnPipe)               -- For xmobar src/MyBar

     import Options                                  -- All stored under /src/
     import MyKeys
     import MyCheatsheet
     import MyBar
     import MyLayoutHook
     import MyManageHook
     import MyWorkspaces as WS

   #+end_src

   main function, high ho, silver!:

   #+begin_src haskell +n
     main :: IO ()
     main = do
         xmproc <- spawnPipe "xmobar ~/.config/xmobar/xmobarrc.hs"
         -- xmproc <- spawnPipe "xmobar ~/.config/xmobar/xmobarDebug.hs"

         xmonad                                                        -- applied over defaults
             $ dynamicProjects WS.projects                             -- See MyWorkspaces
             $ addDescrKeys' (myCheatsheetKey, myCheatsheet) myKeys    -- See myCheatsheet
             $ ewmh desktopConfig                                      -- xdotool and wmtrl are great!
               { modMask            = myModMask
               , terminal           = myTerminal
               , borderWidth        = myBorderWidth
               , normalBorderColor  = myNormalBorderColor
               , focusedBorderColor = myFocusedBorderColor
               , manageHook         = myManageHook
               , layoutHook         = myLayoutHook
               , logHook            = myLogHook xmproc
               , workspaces         = WS.names
               , startupHook        = spawnOnce myAutostart
               }

   #+end_src

