docs/ws.html

<div id="outline-container-org8ed7cf3" class="outline-3">
<h3 id="org8ed7cf3">Body</h3>
<div class="outline-text-3" id="text-org8ed7cf3">
<p>
<b>Modules needed:</b>
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span class="linenr"> 1: </span>     <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">XMonad</span>                                   <span class="org-comment-delimiter">-- </span><span class="org-comment">standard xmonad library</span>
<span class="linenr"> 2: </span>     <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">XMonad.Config.Desktop</span>                    <span class="org-comment-delimiter">-- </span><span class="org-comment">default desktopConfig</span>
<span class="linenr"> 3: </span>     <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">XMonad.Hooks.EwmhDesktops</span>                <span class="org-comment-delimiter">-- </span><span class="org-comment">Fixes the automatic fullscreening &amp; wmctrl</span>
<span class="linenr"> 4: </span>     <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">XMonad.Util.NamedActions</span> (addDescrKeys') <span class="org-comment-delimiter">-- </span><span class="org-comment">Don't use default key bindings</span>
<span class="linenr"> 5: </span>     <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">XMonad.Util.SpawnOnce</span> (spawnOnce)        <span class="org-comment-delimiter">-- </span><span class="org-comment">For running autostart only once (on login)</span>
<span class="linenr"> 6: </span>
<span class="linenr"> 7: </span>     <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">XMonad.Actions.DynamicProjects</span>           <span class="org-comment-delimiter">-- </span><span class="org-comment">For WS.projects</span>
<span class="linenr"> 8: </span>     <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">XMonad.Util.Run</span>(spawnPipe)               <span class="org-comment-delimiter">-- </span><span class="org-comment">For xmobar src/MyBar</span>
<span class="linenr"> 9: </span>
<span class="linenr">10: </span>     <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Options</span>                                  <span class="org-comment-delimiter">-- </span><span class="org-comment">All stored under /src/</span>
<span class="linenr">11: </span>     <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">MyKeys</span>
<span class="linenr">12: </span>     <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">MyCheatsheet</span>
<span class="linenr">13: </span>     <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">MyBar</span>
<span class="linenr">14: </span>     <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">MyLayoutHook</span>
<span class="linenr">15: </span>     <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">MyManageHook</span>
<span class="linenr">16: </span>     <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">MyWorkspaces</span> <span class="org-haskell-keyword">as</span> <span class="org-haskell-constructor">WS</span>
<span class="linenr">17: </span>
</pre>
</div>

<p>
main function, high ho, silver!:
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span class="linenr">18: </span>     main <span class="org-haskell-operator">::</span> <span class="org-haskell-type">IO</span> <span class="org-haskell-constructor">()</span>
<span class="linenr">19: </span>     main <span class="org-haskell-operator">=</span> <span class="org-haskell-keyword">do</span>
<span class="linenr">20: </span>         xmproc <span class="org-haskell-operator">&lt;-</span> spawnPipe <span class="org-string">"xmobar ~/.config/xmobar/xmobarrc.hs"</span>
<span class="linenr">21: </span>         <span class="org-comment-delimiter">-- </span><span class="org-comment">xmproc &lt;- spawnPipe "xmobar ~/.config/xmobar/xmobarDebug.hs"</span>
<span class="linenr">22: </span>
<span class="linenr">23: </span>         xmonad                                                        <span class="org-comment-delimiter">-- </span><span class="org-comment">applied over defaults</span>
<span class="linenr">24: </span>             <span class="org-haskell-operator">$</span> dynamicProjects WS.projects                             <span class="org-comment-delimiter">-- </span><span class="org-comment">See MyWorkspaces</span>
<span class="linenr">25: </span>             <span class="org-haskell-operator">$</span> addDescrKeys' (myCheatsheetKey, myCheatsheet) myKeys    <span class="org-comment-delimiter">-- </span><span class="org-comment">See myCheatsheet</span>
<span class="linenr">26: </span>             <span class="org-haskell-operator">$</span> ewmh desktopConfig                                      <span class="org-comment-delimiter">-- </span><span class="org-comment">xdotool and wmtrl are great!</span>
<span class="linenr">27: </span>               { modMask            <span class="org-haskell-operator">=</span> myModMask
<span class="linenr">28: </span>               , terminal           <span class="org-haskell-operator">=</span> myTerminal
<span class="linenr">29: </span>               , borderWidth        <span class="org-haskell-operator">=</span> myBorderWidth
<span class="linenr">30: </span>               , normalBorderColor  <span class="org-haskell-operator">=</span> myNormalBorderColor
<span class="linenr">31: </span>               , focusedBorderColor <span class="org-haskell-operator">=</span> myFocusedBorderColor
<span class="linenr">32: </span>               , manageHook         <span class="org-haskell-operator">=</span> myManageHook
<span class="linenr">33: </span>               , layoutHook         <span class="org-haskell-operator">=</span> myLayoutHook
<span class="linenr">34: </span>               , logHook            <span class="org-haskell-operator">=</span> myLogHook xmproc
<span class="linenr">35: </span>               , workspaces         <span class="org-haskell-operator">=</span> WS.names
<span class="linenr">36: </span>               , startupHook        <span class="org-haskell-operator">=</span> spawnOnce myAutostart
<span class="linenr">37: </span>               }
<span class="linenr">38: </span>
</pre>
</div>
</div>
</div>
</div>
