ws.org
* src/Options.hs
  :PROPERTIES:
  :header-args: :tangle "~/.config/xmonad/src/Options.hs"
  :END:

  The idea is to set up all the defaults here, instead all over the place. So far my success has been limited.

  *Modules needed:*

  #+begin_src haskell
    module Options where

    import XMonad
    import qualified XMonad.Actions.Search as S

    -- The modifier key to be used for most keybindings
    -- I have it set to super (the Windows key)
    myModMask :: KeyMask
    myModMask  = mod4Mask
  #+end_src

  Default applications, scripts end with a capital /S/, like =screenshotS=.

  #+begin_src haskell -n
    ---------------------------------------------------------------------------
    -- Applications                                                         ---
    ---------------------------------------------------------------------------

    myTerminal       = "alacritty"
    myEditor         = "emacsclient -c"
    myBrowser        = "qutebrowser"
    myFileManager    = myTerminal ++ " -e ranger "
    myGuiFileManager = "pcmanfm"
    myPdfReader      = "zathura"
    myPrintScreen    = "screenshotS"
    myAudiocontrol   = "pavucontrol"

    data Bar = Taffybar | XMobar | Tint2 deriving (Eq)
    myBar :: Bar
    myBar = XMobar

    myMenu :: String
    myMenu = "rofi -dmenu -i -p"  -- For scripts that require user input

    myAppM :: String
    myAppM = "rofi -show drun"    -- Start software

  #+end_src

  Default file paths.

  #+begin_src haskell -n
    ---------------------------------------------------------------------------
    -- File Paths                                                           ---
    ---------------------------------------------------------------------------

    myConfigDir       = "~/.config/xmonad/src/"       -- XMonad-related config
    myBuildScript     = "~/.config/xmonad/build"      -- Script to recompile and restart xmonad
    myAutostart       = "~/.config/xmonad/src/autostartS" -- Script to run on login
    myXMobarConf      = "~/.config/xmobar/xmobarrc.hs"
    myStalonetrayConf = "~/.config/stalonetray/stalonetrayrc"
    myTint2Conf       = "~/.config/tint2/xmonad.tint2rc"

  #+end_src

  Theme; colors, fonts etc

  #+begin_src haskell
    ---------------------------------------------------------------------------
    -- Theme                                                               ---
    ---------------------------------------------------------------------------

    rofiTheme theme = "~/.config/rofi/themes/" ++ theme ++ ".rasi" -- Rofi theme directory

    myBorderWidth :: Dimension
    myBorderWidth = 2

    -- Tab colours copied from DistroTube's config (at gitlab/dwt1)
    myTabActiveColor      = "#46D9FF"
    myTabInactiveColor       = "#313846"
    myTabActiveBorderColor   = "#46D9FF"
    myTabInactiveBorderColor = "#282C34"
    myTabActiveTextColor     = "#282C34"
    myTabInactiveTextColor   = "#D0D0D0"

    myFocusFollowsMouse  = False
    myClickJustFocuses   = True

    base03  = "#002b36"
    base02  = "#073642"
    base01  = "#586e75"
    base00  = "#657b83"
    base0   = "#839496"
    base1   = "#93a1a1"
    base2   = "#eee8d5"
    base3   = "#fdf6e3"
    yellow  = "#b58900"
    orange  = "#cb4b16"
    red     = "#dc322f"
    magenta = "#d33682"
    violet  = "#6c71c4"
    blue    = "#268bd2"
    cyan    = "#2aa198"
    green   = "#859900"

    -- sizes
    gap         = 10
    topbar      = 10
    myBorder    =  2
    prompt :: Dimension
    prompt      = 30
    status      = 20

    myNormalBorderColor, myFocusedBorderColor :: String
    myNormalBorderColor     = "#000000"
    myFocusedBorderColor    = active

    active       = blue
    activeWarn   = red
    inactive     = violet
    focusColor   = blue
    unfocusColor = base02

    myFont       = "xft:NotoSansMono Nerd Font:style=Regular:size=12:antialias=true:hinting=true"
    myMediumFont = "xft:NotoSansMono Nerd Font:style=Regular:size=32:antialias=true:hinting=true"
    myLargeFont  = "xft:NotoSansMono Nerd Font:style=Bold:size=60:antialias=true:hinting=true"


  #+end_src

  Search engines, several from [[https://hackage.haskell.org/package/xmonad-contrib-0.16/docs/XMonad-Actions-Search.html][XMonad.Actions.Search]] + custom ones I regularly use:

  #+begin_src haskell -n
    archwiki, news, reddit, urban :: S.SearchEngine

    archwiki = S.searchEngine "archwiki" "https://wiki.archlinux.org/index.php?search="
    news     = S.searchEngine "news" "https://news.google.com/search?q="
    reddit   = S.searchEngine "reddit" "https://www.reddit.com/search/?q="
    urban    = S.searchEngine "urban" "https://www.urbandictionary.com/define.php?term="

    searchList :: [(String, S.SearchEngine)]
    searchList = [ ("g", S.google)
                 , ("h", S.hoogle)
                 , ("w", S.wikipedia)
                 , ("i", S.imdb)
                 , ("a", archwiki)
                 , ("n", news)
                 , ("r", reddit)
                 , ("u", urban)
                 , ("c", S.hackage)
                 ]
  #+end_src

