docs/ws.html

<div id="outline-container-orgc5cef1f" class="outline-2">
<h2 id="orgc5cef1f">src/Options.hs</h2>
<div class="outline-text-2" id="text-orgc5cef1f">
<p>
The idea is to set up all the defaults here, instead all over the place. So far my success has been limited.
</p>

<p>
<b>Modules needed:</b>
</p>

<div class="org-src-container">
<pre class="src src-haskell">    <span class="org-haskell-keyword">module</span> <span class="org-haskell-constructor">Options</span> <span class="org-haskell-keyword">where</span>

    <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">XMonad</span>
    <span class="org-haskell-keyword">import</span> <span class="org-haskell-keyword">qualified</span> <span class="org-haskell-constructor">XMonad.Actions.Search</span> <span class="org-haskell-keyword">as</span> <span class="org-haskell-constructor">S</span>

    <span class="org-comment-delimiter">-- </span><span class="org-comment">The modifier key to be used for most keybindings</span>
    <span class="org-comment-delimiter">-- </span><span class="org-comment">I have it set to super (the Windows key)</span>
    myModMask <span class="org-haskell-operator">::</span> <span class="org-haskell-type">KeyMask</span>
    myModMask  <span class="org-haskell-operator">=</span> mod4Mask
</pre>
</div>

<p>
Default applications, scripts end with a capital <i>S</i>, like <code>screenshotS</code>.
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span class="linenr"> 1: </span>    <span class="org-comment-delimiter">--</span><span class="org-comment">-------------------------------------------------------------------------</span>
<span class="linenr"> 2: </span>    <span class="org-comment-delimiter">-- </span><span class="org-comment">Applications                                                         ---</span>
<span class="linenr"> 3: </span>    <span class="org-comment-delimiter">--</span><span class="org-comment">-------------------------------------------------------------------------</span>
<span class="linenr"> 4: </span>
<span class="linenr"> 5: </span>    myTerminal       <span class="org-haskell-operator">=</span> <span class="org-string">"alacritty"</span>
<span class="linenr"> 6: </span>    myEditor         <span class="org-haskell-operator">=</span> <span class="org-string">"emacsclient -c"</span>
<span class="linenr"> 7: </span>    myBrowser        <span class="org-haskell-operator">=</span> <span class="org-string">"qutebrowser"</span>
<span class="linenr"> 8: </span>    myFileManager    <span class="org-haskell-operator">=</span> myTerminal <span class="org-haskell-operator">++</span> <span class="org-string">" -e ranger "</span>
<span class="linenr"> 9: </span>    myGuiFileManager <span class="org-haskell-operator">=</span> <span class="org-string">"pcmanfm"</span>
<span class="linenr">10: </span>    myPdfReader      <span class="org-haskell-operator">=</span> <span class="org-string">"zathura"</span>
<span class="linenr">11: </span>    myPrintScreen    <span class="org-haskell-operator">=</span> <span class="org-string">"screenshotS"</span>
<span class="linenr">12: </span>    myAudiocontrol   <span class="org-haskell-operator">=</span> <span class="org-string">"pavucontrol"</span>
<span class="linenr">13: </span>
<span class="linenr">14: </span>    <span class="org-haskell-keyword">data</span> <span class="org-haskell-type">Bar</span> <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Taffybar</span> <span class="org-haskell-operator">|</span> <span class="org-haskell-constructor">XMobar</span> <span class="org-haskell-operator">|</span> <span class="org-haskell-constructor">Tint2</span> <span class="org-haskell-keyword">deriving</span> (<span class="org-haskell-constructor">Eq</span>)
<span class="linenr">15: </span>    myBar <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Bar</span>
<span class="linenr">16: </span>    myBar <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">XMobar</span>
<span class="linenr">17: </span>
<span class="linenr">18: </span>    myMenu <span class="org-haskell-operator">::</span> <span class="org-haskell-type">String</span>
<span class="linenr">19: </span>    myMenu <span class="org-haskell-operator">=</span> <span class="org-string">"rofi -dmenu -i -p"</span>  <span class="org-comment-delimiter">-- </span><span class="org-comment">For scripts that require user input</span>
<span class="linenr">20: </span>
<span class="linenr">21: </span>    myAppM <span class="org-haskell-operator">::</span> <span class="org-haskell-type">String</span>
<span class="linenr">22: </span>    myAppM <span class="org-haskell-operator">=</span> <span class="org-string">"rofi -show drun"</span>    <span class="org-comment-delimiter">-- </span><span class="org-comment">Start software</span>
<span class="linenr">23: </span>
</pre>
</div>

<p>
Default file paths.
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span class="linenr"> 1: </span>    <span class="org-comment-delimiter">--</span><span class="org-comment">-------------------------------------------------------------------------</span>
<span class="linenr"> 2: </span>    <span class="org-comment-delimiter">-- </span><span class="org-comment">File Paths                                                           ---</span>
<span class="linenr"> 3: </span>    <span class="org-comment-delimiter">--</span><span class="org-comment">-------------------------------------------------------------------------</span>
<span class="linenr"> 4: </span>
<span class="linenr"> 5: </span>    myConfigDir       <span class="org-haskell-operator">=</span> <span class="org-string">"~/.config/xmonad/src/"</span>       <span class="org-comment-delimiter">-- </span><span class="org-comment">XMonad-related config</span>
<span class="linenr"> 6: </span>    myBuildScript     <span class="org-haskell-operator">=</span> <span class="org-string">"~/.config/xmonad/build"</span>      <span class="org-comment-delimiter">-- </span><span class="org-comment">Script to recompile and restart xmonad</span>
<span class="linenr"> 7: </span>    myAutostart       <span class="org-haskell-operator">=</span> <span class="org-string">"~/.config/xmonad/src/autostartS"</span> <span class="org-comment-delimiter">-- </span><span class="org-comment">Script to run on login</span>
<span class="linenr"> 8: </span>    myXMobarConf      <span class="org-haskell-operator">=</span> <span class="org-string">"~/.config/xmobar/xmobarrc.hs"</span>
<span class="linenr"> 9: </span>    myStalonetrayConf <span class="org-haskell-operator">=</span> <span class="org-string">"~/.config/stalonetray/stalonetrayrc"</span>
<span class="linenr">10: </span>    myTint2Conf       <span class="org-haskell-operator">=</span> <span class="org-string">"~/.config/tint2/xmonad.tint2rc"</span>
<span class="linenr">11: </span>
</pre>
</div>

<p>
Theme; colors, fonts etc
</p>

<div class="org-src-container">
<pre class="src src-haskell">    <span class="org-comment-delimiter">--</span><span class="org-comment">-------------------------------------------------------------------------</span>
    <span class="org-comment-delimiter">-- </span><span class="org-comment">Theme                                                               ---</span>
    <span class="org-comment-delimiter">--</span><span class="org-comment">-------------------------------------------------------------------------</span>

    rofiTheme theme <span class="org-haskell-operator">=</span> <span class="org-string">"~/.config/rofi/themes/"</span> <span class="org-haskell-operator">++</span> theme <span class="org-haskell-operator">++</span> <span class="org-string">".rasi"</span> <span class="org-comment-delimiter">-- </span><span class="org-comment">Rofi theme directory</span>

    myBorderWidth <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Dimension</span>
    myBorderWidth <span class="org-haskell-operator">=</span> 2

    <span class="org-comment-delimiter">-- </span><span class="org-comment">Tab colours copied from DistroTube's config (at gitlab/dwt1)</span>
    myTabActiveColor      <span class="org-haskell-operator">=</span> <span class="org-string">"#46D9FF"</span>
    myTabInactiveColor       <span class="org-haskell-operator">=</span> <span class="org-string">"#313846"</span>
    myTabActiveBorderColor   <span class="org-haskell-operator">=</span> <span class="org-string">"#46D9FF"</span>
    myTabInactiveBorderColor <span class="org-haskell-operator">=</span> <span class="org-string">"#282C34"</span>
    myTabActiveTextColor     <span class="org-haskell-operator">=</span> <span class="org-string">"#282C34"</span>
    myTabInactiveTextColor   <span class="org-haskell-operator">=</span> <span class="org-string">"#D0D0D0"</span>

    myFocusFollowsMouse  <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">False</span>
    myClickJustFocuses   <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">True</span>

    base03  <span class="org-haskell-operator">=</span> <span class="org-string">"#002b36"</span>
    base02  <span class="org-haskell-operator">=</span> <span class="org-string">"#073642"</span>
    base01  <span class="org-haskell-operator">=</span> <span class="org-string">"#586e75"</span>
    base00  <span class="org-haskell-operator">=</span> <span class="org-string">"#657b83"</span>
    base0   <span class="org-haskell-operator">=</span> <span class="org-string">"#839496"</span>
    base1   <span class="org-haskell-operator">=</span> <span class="org-string">"#93a1a1"</span>
    base2   <span class="org-haskell-operator">=</span> <span class="org-string">"#eee8d5"</span>
    base3   <span class="org-haskell-operator">=</span> <span class="org-string">"#fdf6e3"</span>
    yellow  <span class="org-haskell-operator">=</span> <span class="org-string">"#b58900"</span>
    orange  <span class="org-haskell-operator">=</span> <span class="org-string">"#cb4b16"</span>
    red     <span class="org-haskell-operator">=</span> <span class="org-string">"#dc322f"</span>
    magenta <span class="org-haskell-operator">=</span> <span class="org-string">"#d33682"</span>
    violet  <span class="org-haskell-operator">=</span> <span class="org-string">"#6c71c4"</span>
    blue    <span class="org-haskell-operator">=</span> <span class="org-string">"#268bd2"</span>
    cyan    <span class="org-haskell-operator">=</span> <span class="org-string">"#2aa198"</span>
    green   <span class="org-haskell-operator">=</span> <span class="org-string">"#859900"</span>

    <span class="org-comment-delimiter">-- </span><span class="org-comment">sizes</span>
    gap         <span class="org-haskell-operator">=</span> 10
    topbar      <span class="org-haskell-operator">=</span> 10
    myBorder    <span class="org-haskell-operator">=</span>  2
    prompt <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Dimension</span>
    prompt      <span class="org-haskell-operator">=</span> 30
    status      <span class="org-haskell-operator">=</span> 20

    myNormalBorderColor, myFocusedBorderColor <span class="org-haskell-operator">::</span> <span class="org-haskell-type">String</span>
    myNormalBorderColor     <span class="org-haskell-operator">=</span> <span class="org-string">"#000000"</span>
    myFocusedBorderColor    <span class="org-haskell-operator">=</span> active

    active       <span class="org-haskell-operator">=</span> blue
    activeWarn   <span class="org-haskell-operator">=</span> red
    inactive     <span class="org-haskell-operator">=</span> violet
    focusColor   <span class="org-haskell-operator">=</span> blue
    unfocusColor <span class="org-haskell-operator">=</span> base02

    myFont       <span class="org-haskell-operator">=</span> <span class="org-string">"xft:NotoSansMono Nerd Font:style=Regular:size=12:antialias=true:hinting=true"</span>
    myMediumFont <span class="org-haskell-operator">=</span> <span class="org-string">"xft:NotoSansMono Nerd Font:style=Regular:size=32:antialias=true:hinting=true"</span>
    myLargeFont  <span class="org-haskell-operator">=</span> <span class="org-string">"xft:NotoSansMono Nerd Font:style=Bold:size=60:antialias=true:hinting=true"</span>


</pre>
</div>

<p>
Search engines, several from <a href="https://hackage.haskell.org/package/xmonad-contrib-0.16/docs/XMonad-Actions-Search.html">XMonad.Actions.Search</a> + custom ones I regularly use:
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span class="linenr"> 1: </span>    archwiki, news, reddit, urban <span class="org-haskell-operator">::</span> <span class="org-haskell-type">S.SearchEngine</span>
<span class="linenr"> 2: </span>
<span class="linenr"> 3: </span>    archwiki <span class="org-haskell-operator">=</span> S.searchEngine <span class="org-string">"archwiki"</span> <span class="org-string">"https://wiki.archlinux.org/index.php?search="</span>
<span class="linenr"> 4: </span>    news     <span class="org-haskell-operator">=</span> S.searchEngine <span class="org-string">"news"</span> <span class="org-string">"https://news.google.com/search?q="</span>
<span class="linenr"> 5: </span>    reddit   <span class="org-haskell-operator">=</span> S.searchEngine <span class="org-string">"reddit"</span> <span class="org-string">"https://www.reddit.com/search/?q="</span>
<span class="linenr"> 6: </span>    urban    <span class="org-haskell-operator">=</span> S.searchEngine <span class="org-string">"urban"</span> <span class="org-string">"https://www.urbandictionary.com/define.php?term="</span>
<span class="linenr"> 7: </span>
<span class="linenr"> 8: </span>    searchList <span class="org-haskell-operator">::</span> [(<span class="org-haskell-type">String</span>, <span class="org-haskell-type">S.SearchEngine</span>)]
<span class="linenr"> 9: </span>    searchList <span class="org-haskell-operator">=</span> [ (<span class="org-string">"g"</span>, S.google)
<span class="linenr">10: </span>                 , (<span class="org-string">"h"</span>, S.hoogle)
<span class="linenr">11: </span>                 , (<span class="org-string">"w"</span>, S.wikipedia)
<span class="linenr">12: </span>                 , (<span class="org-string">"i"</span>, S.imdb)
<span class="linenr">13: </span>                 , (<span class="org-string">"a"</span>, archwiki)
<span class="linenr">14: </span>                 , (<span class="org-string">"n"</span>, news)
<span class="linenr">15: </span>                 , (<span class="org-string">"r"</span>, reddit)
<span class="linenr">16: </span>                 , (<span class="org-string">"u"</span>, urban)
<span class="linenr">17: </span>                 , (<span class="org-string">"c"</span>, S.hackage)
<span class="linenr">18: </span>                 ]
</pre>
</div>
</div>
</div>
