ws.org
* src/MyKeys.hs
  :PROPERTIES:
  :header-args: :tangle "~/.config/xmonad/src/MyKeys.hs"
  :END:

  Interesting part:

  - [[https://hackage.haskell.org/package/xmonad-contrib-0.16/docs/XMonad-Util-NamedActions.html][XMonad.Util.NamedActions]] -- Which is used by the [[*src/MyCheatsheet][cheatsheet]].

  *Modules needed:*

  #+CAPTION: MyKeys definition
  #+begin_src haskell -n
    module MyKeys
    (myKeys,myCheatsheetKey)
    where

    import Data.Char (isSpace, toUpper) --isSpace?
    import System.Exit -- (exitSuccess)
    import XMonad

    import XMonad.Layout.MultiToggle
    import XMonad.Layout.MultiToggle.Instances
    import XMonad.Layout.ResizableTile
    import qualified XMonad.StackSet as W
    import XMonad.Actions.CycleWS

    import XMonad.Util.EZConfig
    import XMonad.Util.NamedActions
    import XMonad.Actions.ShowText              -- (ref:showTextM)
    import XMonad.Util.NamedScratchpad

    import XMonad.Prompt
    import XMonad.Prompt.ConfirmPrompt          -- don't just hard quit
    import XMonad.Prompt.FuzzyMatch             -- (ref:fuzzyM) TODO
    import XMonad.Prompt.Man
    import qualified XMonad.Actions.Search as S

    import XMonad.Actions.DynamicProjects       -- to switch to projects

    import XMonad.Actions.SinkAll               -- make all windows unfloat

    import Options                              -- defaults
    import MyScratchpads

  #+end_src

  #+CAPTION: Help functions
  #+begin_src haskell -n
    -- Convert multiword strings to arguments (concatenate with delimiters)
    -- This makes sure my shell scripts correctly interpret their arguments
    args :: String -> [String] -> String
    args command arguments = command ++ " " ++ unwords (map show arguments)

    quitXmonad :: X ()
    quitXmonad = confirmPrompt hotPromptTheme "exit"
      $ io (exitWith ExitSuccess)

    rebuildXmonad :: X ()
    rebuildXmonad = do
      -- spawn "xmonad --recompile && xmonad --restart"
      spawn myBuildScript

    restartXmonad :: X ()
    restartXmonad = do
      spawn "xmonad --restart"

  #+end_src

  Modifiers:

  - M = M1 is Super, which I have also set to space when held down TODO
  - H is Hyper, which I have set to the menu key
  - C-Esc is Super tapped on its own

  =myKeys= contains all the key bindings, also, we pre-define longer commands:

  #+CAPTION: myKeys configuration
  #+begin_src haskell -n
    myKeys :: XConfig l -> [((KeyMask, KeySym), NamedAction)]
    myKeys conf = let

        subKeys name list = subtitle name : mkNamedKeymap conf list

        -- Abbreviations for certain actions
        menuEditScript         = spawn $ args "menuEditConfigsS" [myMenu,myEditor]
        menuEditConfig         = spawn $ args "menuEditConfigsS" [myMenu,myEditor]

        viewScreen s          = screenWorkspace s >>= flip whenJust (windows . W.view)
        shiftScreen s         = screenWorkspace s >>= flip whenJust (windows . W.shift)
        unFloat               = withFocused $ windows . W.sink

        volumeAdjust "toggle" = spawn "adjustVolumeS toggle"
        volumeAdjust value    = spawn $ args "adjustVolumeS" $ words value

        in

  #+end_src

  #+CAPTION: Core Xmonad bindings
  #+begin_src haskell -n
        subKeys "Core"
        [ ("M-S-q",                   addName "Quit XMonad (logout)"   $ quitXmonad)
        , ("M-q",                     addName "Recompile & restart"    $ rebuildXmonad)
        , ("M-M1-q",                  addName "Restart"                $ restartXmonad)
        , ("C-<Escape>",              addName "Application launcher"   $ spawn myAppM)
        , ("M-S-c",                   addName "Close window"           $ kill)
        ] ^++^

  #+end_src

  Window manager bindings, for these I use =Super=:

  - Screens
  - Workspaces ([[https://hackage.haskell.org/package/xmonad-contrib-0.16/docs/XMonad-Actions-CycleWS.html][XMonad.Actions.CycleWS]])
  - Layouts
  - Windows

  #+CAPTION: Layouts and Windows
  #+begin_src haskell -n
        subKeys "Layouts"
        [ ("M-h",                     addName "Shrink master"          $ sendMessage Shrink)
        , ("M-l",                     addName "Expand master"          $ sendMessage Expand)
        , ("M-i",                     addName "Shrink slave"           $ sendMessage MirrorExpand)
        , ("M-u",                     addName "Expand slave"           $ sendMessage MirrorShrink)
        , ("M-,",                     addName "Inc master windows"     $ sendMessage $ IncMasterN 1)
        , ("M-.",                     addName "Dec master windows"     $ sendMessage $ IncMasterN (-1))
        , ("M-<Space>",               addName "Next layout"            $ sendMessage NextLayout)
        , ("M-f",                     addName "Toggle fullscreen"      $ sendMessage $ Toggle NBFULL)
        ] ^++^

        subKeys "Windows"
        [ ("M-<Tab>",                 addName "Focus next"             $ windows W.focusDown)
        , ("M-S-<Tab>",               addName "Focus previous"         $ windows W.focusUp)
        , ("M-j",                     addName "Focus next"             $ windows W.focusDown)
        , ("M-k",                     addName "Focus previous"         $ windows W.focusUp)
        , ("M-m",                     addName "Focus master"           $ windows W.focusMaster)
        , ("M-S-j",                   addName "Swap next"              $ windows W.swapDown)
        , ("M-S-k",                   addName "Swap previous"          $ windows W.swapUp)
        , ("M-<Return>",              addName "Swap master"            $ windows W.swapMaster)
        , ("M-t",                     addName "Unfloat"                $ unFloat)
        , ("M-S-t",                   addName "Unfloat All"            $ sinkAll)
        ] ^++^

  #+end_src

  #+CAPTION: Projects
  #+NAME: Project keys
  #+begin_src haskell -n
        subKeys "Projects"
        [ ("M-w"   , addName "switch Project Prompt"   $ switchProjectPrompt warmPromptTheme)
        , ("M-S-w" , addName "shift To Project Prompt" $ shiftToProjectPrompt warmPromptTheme)
        ] ^++^

  #+end_src

  Application bindings, these are (mostly) using the =Hyper key= (menu):

  Note: =M-S-<Return>= is a fallback, I broke my /menu/ binding a couple of times.

  #+begin_src haskell -n
        subKeys "Applications"
        [ ("M-S-<Return>",            addName "Terminal emulator"      $ spawn myTerminal)
        , ("M3-<Return>",             addName "Terminal emulator"      $ spawn myTerminal)
        , ("M3-d",                    addName "Start apps (I3 dmenu)"  $ spawn myAppM)
        , ("M3-e",                    addName "Text editor"            $ spawn myEditor)
        , ("M3-w",                    addName "Web browser (minimal)"  $ spawn myBrowser)
        , ("M3-S-w",                  addName "Chromium"               $ spawn "chromium")
        , ("M3-C-w",                  addName "Chromium anonymous"     $ spawn "chromium --name=ignognito --incognito")
        , ("M3-f",                    addName "Terminal file manager"  $ spawn myFileManager)
        , ("M3-S-f",                  addName "Graphical file manager" $ spawn myGuiFileManager)
        , ("M3-z",                    addName "Zoom"                   $ spawn "zoom")
        ] ^++^

        subKeys "My (rofi) Scripts"
        [ ("M3-p M3-p",                 addName "Edit scripts"        $ menuEditScript)
        , ("M3-p M3-e",                 addName "Edit configs"        $ menuEditConfig)
        ] ^++^

        subKeys "Multimedia Keys"
        [ ("<XF86AudioMute>",         addName "Toggle mute"           $ volumeAdjust "togmute")
        , ("<XF86AudioLowerVolume>",  addName "Decrease volume"       $ volumeAdjust "down")
        , ("<XF86AudioRaiseVolume>",  addName "Increase volume"       $ volumeAdjust "up")
        , ("<XF86MonBrightnessDown>", addName "Decrease brightness"   $ spawn "backlightS -dec 10")
        , ("<XF86MonBrightnessUp>",   addName "Increase brightness"   $ spawn "backlightS -inc 10")
        , ("<XF86TouchpadToggle>",    addName "Toggle Touchpad"       $ spawn "toggleTouchpadS")
        , ("<Print>",                 addName "Take screenshot"       $ spawn (myPrintScreen ++ " -n"))
        , ("S-<Print>",               addName "Take screenshot menu"  $ spawn myPrintScreen)
        , ("M-u p",                   addName "Play music"            $ spawn "mpc play")
        , ("M-u ,",                   addName "Play next"             $ spawn "mpc next")
        , ("M-u .",                   addName "Play previous"         $ spawn "mpc prev")
        , ("M-u <Space>",             addName "Toggle play"           $ spawn "mpc toggle")
        , ("M-u n",                   addName "Fetch TV url"          $ spawn "newseries -p")
        , ("M-u /",                   addName "Music player"          $ namedScratchpadAction myScratchPads "myMusic")
        ] ^++^

        subKeys "Scratchpads"
        [ ("M-C-<Return>", addName "Scratchpads"    $ namedScratchpadAction myScratchPads "scratchpad")
        , ("M-`"         , addName "Scratchpad"     $ namedScratchpadAction myScratchPads "scratchpad")
        , ("M-z a"       , addName "Volume control" $ namedScratchpadAction myScratchPads "myPavu")
        , ("M-<F2>"      , addName "Volume control" $ namedScratchpadAction myScratchPads "myPavu")
        , ("M-z m"       , addName "Music player"   $ namedScratchpadAction myScratchPads "myMusic")
        , ("M-z w"       , addName "Whatsapp"       $ namedScratchpadAction myScratchPads "myWhatsApp")
        , ("M-z p"       , addName "Proton mail"    $ namedScratchpadAction myScratchPads "myProtonmail")
        ] ^++^

  #+end_src

  Prompts (=H-m=, man-page) and Search-engines(=H-s= +):

  - =g= S.google
  - =h= S.hoogle
  - =w= S.wikipedia
  - =a= archwiki
  - =n= news
  - =r= reddit
  - =u= urban
  - =c= S.hackage

  (Defined [[*src/Options.hs][here]])

  #+begin_src haskell -n
        subKeys "Prompts"
        [ ("M3-m", addName "Man-page Prompt" $ manPrompt myPromptTheme)] ^++^

        subKeys "Searchengines"
        [ ("M3-s " ++ k, addName "Search Engines"  $ S.promptSearch myPromptTheme f) | (k,f) <- searchList]

  #+end_src

  Keybinding to display the keybinding cheatsheet

  #+begin_src haskell -n
    myCheatsheetKey :: (KeyMask, KeySym)
    myCheatsheetKey = (myModMask .|. shiftMask, xK_slash)

  #+end_src

  Theme prompts:

  - Regular, for normal propmpts.
  - Warm, for projects
  - Hot, for Quitting and Killing

  #+begin_src haskell -n
    myPromptTheme :: XPConfig
    myPromptTheme = def
        { font                  = myFont
        , bgColor               = base03
        , fgColor               = active
        , fgHLight              = base03
        , bgHLight              = active
        , borderColor           = base03
        , promptBorderWidth     = 0
        , height                = prompt
        , promptKeymap          = emacsLikeXPKeymap
        , position              = Top
        -- , position            = CenteredAt { xpCenterY = 0.3, xpWidth = 0.3 }
        , historySize           = 256
        , historyFilter         = id
        , defaultText           = []
        -- , autoComplete        = Just 100000  -- set Just 100000 for .1 sec
        , showCompletionOnTab   = False
        -- , complCaseSensitivity  = ComplCaseSensitive False -- newer version :-(!
        , searchPredicate       = fuzzyMatch   --
        , sorter                = fuzzySort
        , defaultPrompter       = id $ map toUpper  -- change prompt to UPPER
        , alwaysHighlight       = True
        , maxComplRows          = Just 15 -- Nothing -- Nothing is unlimited
        }

    warmPromptTheme = myPromptTheme
        { bgColor               = yellow
        , fgColor               = base03
        , position              = Top
        }

    hotPromptTheme = myPromptTheme
        { bgColor               = red
        , fgColor               = base3
        , position              = Top
        }

  #+end_src

