docs/ws.html

<div id="outline-container-orga8fb447" class="outline-2">
<h2 id="orga8fb447">src/MyKeys.hs</h2>
<div class="outline-text-2" id="text-orga8fb447">
<p>
Interesting part:
</p>

<ul class="org-ul">
<li><a href="https://hackage.haskell.org/package/xmonad-contrib-0.16/docs/XMonad-Util-NamedActions.html">XMonad.Util.NamedActions</a> &#x2013; Which is used by the <a href="#orgb861bc1">cheatsheet</a>.</li>
</ul>

<p>
<b>Modules needed:</b>
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 2: </span>MyKeys definition</label><pre class="src src-haskell"><span class="linenr"> 1: </span>    <span class="org-haskell-keyword">module</span> <span class="org-haskell-constructor">MyKeys</span>
<span class="linenr"> 2: </span>    (myKeys,myCheatsheetKey)
<span class="linenr"> 3: </span>    <span class="org-haskell-keyword">where</span>
<span class="linenr"> 4: </span>
<span class="linenr"> 5: </span>    <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Data.Char</span> (isSpace, toUpper) <span class="org-comment-delimiter">--</span><span class="org-comment">isSpace?</span>
<span class="linenr"> 6: </span>    <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">System.Exit</span> <span class="org-comment-delimiter">-- </span><span class="org-comment">(exitSuccess)</span>
<span class="linenr"> 7: </span>    <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">XMonad</span>
<span class="linenr"> 8: </span>
<span class="linenr"> 9: </span>    <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">XMonad.Layout.MultiToggle</span>
<span class="linenr">10: </span>    <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">XMonad.Layout.MultiToggle.Instances</span>
<span class="linenr">11: </span>    <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">XMonad.Layout.ResizableTile</span>
<span class="linenr">12: </span>    <span class="org-haskell-keyword">import</span> <span class="org-haskell-keyword">qualified</span> <span class="org-haskell-constructor">XMonad.StackSet</span> <span class="org-haskell-keyword">as</span> <span class="org-haskell-constructor">W</span>
<span class="linenr">13: </span>    <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">XMonad.Actions.CycleWS</span>
<span class="linenr">14: </span>
<span class="linenr">15: </span>    <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">XMonad.Util.EZConfig</span>
<span class="linenr">16: </span>    <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">XMonad.Util.NamedActions</span>
<span id="coderef-showTextM" class="coderef-off"><span class="linenr">17: </span>    <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">XMonad.Actions.ShowText</span>              <span class="org-comment-delimiter">--</span> (showTextM)</span>
<span class="linenr">18: </span>    <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">XMonad.Util.NamedScratchpad</span>
<span class="linenr">19: </span>
<span class="linenr">20: </span>    <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">XMonad.Prompt</span>
<span class="linenr">21: </span>    <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">XMonad.Prompt.ConfirmPrompt</span>          <span class="org-comment-delimiter">-- </span><span class="org-comment">don't just hard quit</span>
<span class="linenr">22: </span>    <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">XMonad.Prompt.FuzzyMatch</span>             <span class="org-comment-delimiter">-- </span><span class="org-comment">(ref:fuzzyM) TODO</span>
<span class="linenr">23: </span>    <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">XMonad.Prompt.Man</span>
<span class="linenr">24: </span>    <span class="org-haskell-keyword">import</span> <span class="org-haskell-keyword">qualified</span> <span class="org-haskell-constructor">XMonad.Actions.Search</span> <span class="org-haskell-keyword">as</span> <span class="org-haskell-constructor">S</span>
<span class="linenr">25: </span>
<span class="linenr">26: </span>    <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">XMonad.Actions.DynamicProjects</span>       <span class="org-comment-delimiter">-- </span><span class="org-comment">to switch to projects</span>
<span class="linenr">27: </span>
<span class="linenr">28: </span>    <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">XMonad.Actions.SinkAll</span>               <span class="org-comment-delimiter">-- </span><span class="org-comment">make all windows unfloat</span>
<span class="linenr">29: </span>
<span class="linenr">30: </span>    <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Options</span>                              <span class="org-comment-delimiter">-- </span><span class="org-comment">defaults</span>
<span class="linenr">31: </span>    <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">MyScratchpads</span>
<span class="linenr">32: </span>
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 3: </span>Help functions</label><pre class="src src-haskell"><span class="linenr"> 1: </span>    <span class="org-comment-delimiter">-- </span><span class="org-comment">Convert multiword strings to arguments (concatenate with delimiters)</span>
<span class="linenr"> 2: </span>    <span class="org-comment-delimiter">-- </span><span class="org-comment">This makes sure my shell scripts correctly interpret their arguments</span>
<span class="linenr"> 3: </span>    args <span class="org-haskell-operator">::</span> <span class="org-haskell-type">String</span> <span class="org-haskell-operator">-&gt;</span> [<span class="org-haskell-type">String</span>] <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">String</span>
<span class="linenr"> 4: </span>    args command arguments <span class="org-haskell-operator">=</span> command <span class="org-haskell-operator">++</span> <span class="org-string">" "</span> <span class="org-haskell-operator">++</span> unwords (map show arguments)
<span class="linenr"> 5: </span>
<span class="linenr"> 6: </span>    quitXmonad <span class="org-haskell-operator">::</span> <span class="org-haskell-type">X</span> <span class="org-haskell-constructor">()</span>
<span class="linenr"> 7: </span>    quitXmonad <span class="org-haskell-operator">=</span> confirmPrompt hotPromptTheme <span class="org-string">"exit"</span>
<span class="linenr"> 8: </span>      <span class="org-haskell-operator">$</span> io (exitWith <span class="org-haskell-constructor">ExitSuccess</span>)
<span class="linenr"> 9: </span>
<span class="linenr">10: </span>    rebuildXmonad <span class="org-haskell-operator">::</span> <span class="org-haskell-type">X</span> <span class="org-haskell-constructor">()</span>
<span class="linenr">11: </span>    rebuildXmonad <span class="org-haskell-operator">=</span> <span class="org-haskell-keyword">do</span>
<span class="linenr">12: </span>      <span class="org-comment-delimiter">-- </span><span class="org-comment">spawn "xmonad --recompile &amp;&amp; xmonad --restart"</span>
<span class="linenr">13: </span>      spawn myBuildScript
<span class="linenr">14: </span>
<span class="linenr">15: </span>    restartXmonad <span class="org-haskell-operator">::</span> <span class="org-haskell-type">X</span> <span class="org-haskell-constructor">()</span>
<span class="linenr">16: </span>    restartXmonad <span class="org-haskell-operator">=</span> <span class="org-haskell-keyword">do</span>
<span class="linenr">17: </span>      spawn <span class="org-string">"xmonad --restart"</span>
<span class="linenr">18: </span>
</pre>
</div>

<p>
Modifiers:
</p>

<ul class="org-ul">
<li>M = M1 is Super, which I have also set to space when held down TODO</li>
<li>H is Hyper, which I have set to the menu key</li>
<li>C-Esc is Super tapped on its own</li>
</ul>

<p>
<code>myKeys</code> contains all the key bindings, also, we pre-define longer commands:
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 4: </span>myKeys configuration</label><pre class="src src-haskell"><span class="linenr"> 1: </span>    myKeys <span class="org-haskell-operator">::</span> <span class="org-haskell-type">XConfig</span> l <span class="org-haskell-operator">-&gt;</span> [((<span class="org-haskell-type">KeyMask</span>, <span class="org-haskell-type">KeySym</span>), <span class="org-haskell-type">NamedAction</span>)]
<span class="linenr"> 2: </span>    myKeys conf <span class="org-haskell-operator">=</span> <span class="org-haskell-keyword">let</span>
<span class="linenr"> 3: </span>
<span class="linenr"> 4: </span>        subKeys name list <span class="org-haskell-operator">=</span> subtitle name <span class="org-haskell-constructor">:</span> mkNamedKeymap conf list
<span class="linenr"> 5: </span>
<span class="linenr"> 6: </span>        <span class="org-comment-delimiter">-- </span><span class="org-comment">Abbreviations for certain actions</span>
<span class="linenr"> 7: </span>        menuEditScript         <span class="org-haskell-operator">=</span> spawn <span class="org-haskell-operator">$</span> args <span class="org-string">"menuEditConfigsS"</span> [myMenu,myEditor]
<span class="linenr"> 8: </span>        menuEditConfig         <span class="org-haskell-operator">=</span> spawn <span class="org-haskell-operator">$</span> args <span class="org-string">"menuEditConfigsS"</span> [myMenu,myEditor]
<span class="linenr"> 9: </span>
<span class="linenr">10: </span>        viewScreen s          <span class="org-haskell-operator">=</span> screenWorkspace s <span class="org-haskell-operator">&gt;&gt;=</span> flip whenJust (windows <span class="org-haskell-operator">.</span> W.view)
<span class="linenr">11: </span>        shiftScreen s         <span class="org-haskell-operator">=</span> screenWorkspace s <span class="org-haskell-operator">&gt;&gt;=</span> flip whenJust (windows <span class="org-haskell-operator">.</span> W.shift)
<span class="linenr">12: </span>        unFloat               <span class="org-haskell-operator">=</span> withFocused <span class="org-haskell-operator">$</span> windows <span class="org-haskell-operator">.</span> W.sink
<span class="linenr">13: </span>
<span class="linenr">14: </span>        volumeAdjust <span class="org-string">"toggle"</span> <span class="org-haskell-operator">=</span> spawn <span class="org-string">"adjustVolumeS toggle"</span>
<span class="linenr">15: </span>        volumeAdjust value    <span class="org-haskell-operator">=</span> spawn <span class="org-haskell-operator">$</span> args <span class="org-string">"adjustVolumeS"</span> <span class="org-haskell-operator">$</span> words value
<span class="linenr">16: </span>
<span class="linenr">17: </span>        <span class="org-haskell-keyword">in</span>
<span class="linenr">18: </span>
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 5: </span>Core Xmonad bindings</label><pre class="src src-haskell"><span class="linenr">1: </span>        subKeys <span class="org-string">"Core"</span>
<span class="linenr">2: </span>        [ (<span class="org-string">"M-S-q"</span>,                   addName <span class="org-string">"Quit XMonad (logout)"</span>   <span class="org-haskell-operator">$</span> quitXmonad)
<span class="linenr">3: </span>        , (<span class="org-string">"M-q"</span>,                     addName <span class="org-string">"Recompile &amp; restart"</span>    <span class="org-haskell-operator">$</span> rebuildXmonad)
<span class="linenr">4: </span>        , (<span class="org-string">"M-M1-q"</span>,                  addName <span class="org-string">"Restart"</span>                <span class="org-haskell-operator">$</span> restartXmonad)
<span class="linenr">5: </span>        , (<span class="org-string">"C-&lt;Escape&gt;"</span>,              addName <span class="org-string">"Application launcher"</span>   <span class="org-haskell-operator">$</span> spawn myAppM)
<span class="linenr">6: </span>        , (<span class="org-string">"M-S-c"</span>,                   addName <span class="org-string">"Close window"</span>           <span class="org-haskell-operator">$</span> kill)
<span class="linenr">7: </span>        ] <span class="org-haskell-operator">^++^</span>
<span class="linenr">8: </span>
</pre>
</div>

<p>
Window manager bindings, for these I use <code>Super</code>:
</p>

<ul class="org-ul">
<li>Screens</li>
<li>Workspaces (<a href="https://hackage.haskell.org/package/xmonad-contrib-0.16/docs/XMonad-Actions-CycleWS.html">XMonad.Actions.CycleWS</a>)</li>
<li>Layouts</li>
<li>Windows</li>
</ul>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 6: </span>Layouts and Windows</label><pre class="src src-haskell"><span class="linenr"> 1: </span>        subKeys <span class="org-string">"Layouts"</span>
<span class="linenr"> 2: </span>        [ (<span class="org-string">"M-h"</span>,                     addName <span class="org-string">"Shrink master"</span>          <span class="org-haskell-operator">$</span> sendMessage <span class="org-haskell-constructor">Shrink</span>)
<span class="linenr"> 3: </span>        , (<span class="org-string">"M-l"</span>,                     addName <span class="org-string">"Expand master"</span>          <span class="org-haskell-operator">$</span> sendMessage <span class="org-haskell-constructor">Expand</span>)
<span class="linenr"> 4: </span>        , (<span class="org-string">"M-i"</span>,                     addName <span class="org-string">"Shrink slave"</span>           <span class="org-haskell-operator">$</span> sendMessage <span class="org-haskell-constructor">MirrorExpand</span>)
<span class="linenr"> 5: </span>        , (<span class="org-string">"M-u"</span>,                     addName <span class="org-string">"Expand slave"</span>           <span class="org-haskell-operator">$</span> sendMessage <span class="org-haskell-constructor">MirrorShrink</span>)
<span class="linenr"> 6: </span>        , (<span class="org-string">"M-,"</span>,                     addName <span class="org-string">"Inc master windows"</span>     <span class="org-haskell-operator">$</span> sendMessage <span class="org-haskell-operator">$</span> <span class="org-haskell-constructor">IncMasterN</span> 1)
<span class="linenr"> 7: </span>        , (<span class="org-string">"M-."</span>,                     addName <span class="org-string">"Dec master windows"</span>     <span class="org-haskell-operator">$</span> sendMessage <span class="org-haskell-operator">$</span> <span class="org-haskell-constructor">IncMasterN</span> (<span class="org-haskell-operator">-</span>1))
<span class="linenr"> 8: </span>        , (<span class="org-string">"M-&lt;Space&gt;"</span>,               addName <span class="org-string">"Next layout"</span>            <span class="org-haskell-operator">$</span> sendMessage <span class="org-haskell-constructor">NextLayout</span>)
<span class="linenr"> 9: </span>        , (<span class="org-string">"M-f"</span>,                     addName <span class="org-string">"Toggle fullscreen"</span>      <span class="org-haskell-operator">$</span> sendMessage <span class="org-haskell-operator">$</span> <span class="org-haskell-constructor">Toggle</span> <span class="org-haskell-constructor">NBFULL</span>)
<span class="linenr">10: </span>        ] <span class="org-haskell-operator">^++^</span>
<span class="linenr">11: </span>
<span class="linenr">12: </span>        subKeys <span class="org-string">"Windows"</span>
<span class="linenr">13: </span>        [ (<span class="org-string">"M-&lt;Tab&gt;"</span>,                 addName <span class="org-string">"Focus next"</span>             <span class="org-haskell-operator">$</span> windows W.focusDown)
<span class="linenr">14: </span>        , (<span class="org-string">"M-S-&lt;Tab&gt;"</span>,               addName <span class="org-string">"Focus previous"</span>         <span class="org-haskell-operator">$</span> windows W.focusUp)
<span class="linenr">15: </span>        , (<span class="org-string">"M-j"</span>,                     addName <span class="org-string">"Focus next"</span>             <span class="org-haskell-operator">$</span> windows W.focusDown)
<span class="linenr">16: </span>        , (<span class="org-string">"M-k"</span>,                     addName <span class="org-string">"Focus previous"</span>         <span class="org-haskell-operator">$</span> windows W.focusUp)
<span class="linenr">17: </span>        , (<span class="org-string">"M-m"</span>,                     addName <span class="org-string">"Focus master"</span>           <span class="org-haskell-operator">$</span> windows W.focusMaster)
<span class="linenr">18: </span>        , (<span class="org-string">"M-S-j"</span>,                   addName <span class="org-string">"Swap next"</span>              <span class="org-haskell-operator">$</span> windows W.swapDown)
<span class="linenr">19: </span>        , (<span class="org-string">"M-S-k"</span>,                   addName <span class="org-string">"Swap previous"</span>          <span class="org-haskell-operator">$</span> windows W.swapUp)
<span class="linenr">20: </span>        , (<span class="org-string">"M-&lt;Return&gt;"</span>,              addName <span class="org-string">"Swap master"</span>            <span class="org-haskell-operator">$</span> windows W.swapMaster)
<span class="linenr">21: </span>        , (<span class="org-string">"M-t"</span>,                     addName <span class="org-string">"Unfloat"</span>                <span class="org-haskell-operator">$</span> unFloat)
<span class="linenr">22: </span>        , (<span class="org-string">"M-S-t"</span>,                   addName <span class="org-string">"Unfloat All"</span>            <span class="org-haskell-operator">$</span> sinkAll)
<span class="linenr">23: </span>        ] <span class="org-haskell-operator">^++^</span>
<span class="linenr">24: </span>
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 7: </span>Projects</label><pre class="src src-haskell" id="org254530f"><span class="linenr">1: </span>        subKeys <span class="org-string">"Projects"</span>
<span class="linenr">2: </span>        [ (<span class="org-string">"M-w"</span>   , addName <span class="org-string">"switch Project Prompt"</span>   <span class="org-haskell-operator">$</span> switchProjectPrompt warmPromptTheme)
<span class="linenr">3: </span>        , (<span class="org-string">"M-S-w"</span> , addName <span class="org-string">"shift To Project Prompt"</span> <span class="org-haskell-operator">$</span> shiftToProjectPrompt warmPromptTheme)
<span class="linenr">4: </span>        ] <span class="org-haskell-operator">^++^</span>
<span class="linenr">5: </span>
</pre>
</div>

<p>
Application bindings, these are (mostly) using the <code>Hyper key</code> (menu):
</p>

<p>
Note: <code>M-S-&lt;Return&gt;</code> is a fallback, I broke my <i>menu</i> binding a couple of times.
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span class="linenr"> 1: </span>        subKeys <span class="org-string">"Applications"</span>
<span class="linenr"> 2: </span>        [ (<span class="org-string">"M-S-&lt;Return&gt;"</span>,            addName <span class="org-string">"Terminal emulator"</span>      <span class="org-haskell-operator">$</span> spawn myTerminal)
<span class="linenr"> 3: </span>        , (<span class="org-string">"M3-&lt;Return&gt;"</span>,             addName <span class="org-string">"Terminal emulator"</span>      <span class="org-haskell-operator">$</span> spawn myTerminal)
<span class="linenr"> 4: </span>        , (<span class="org-string">"M3-d"</span>,                    addName <span class="org-string">"Start apps (I3 dmenu)"</span>  <span class="org-haskell-operator">$</span> spawn myAppM)
<span class="linenr"> 5: </span>        , (<span class="org-string">"M3-e"</span>,                    addName <span class="org-string">"Text editor"</span>            <span class="org-haskell-operator">$</span> spawn myEditor)
<span class="linenr"> 6: </span>        , (<span class="org-string">"M3-w"</span>,                    addName <span class="org-string">"Web browser (minimal)"</span>  <span class="org-haskell-operator">$</span> spawn myBrowser)
<span class="linenr"> 7: </span>        , (<span class="org-string">"M3-S-w"</span>,                  addName <span class="org-string">"Chromium"</span>               <span class="org-haskell-operator">$</span> spawn <span class="org-string">"chromium"</span>)
<span class="linenr"> 8: </span>        , (<span class="org-string">"M3-C-w"</span>,                  addName <span class="org-string">"Chromium anonymous"</span>     <span class="org-haskell-operator">$</span> spawn <span class="org-string">"chromium --name=ignognito --incognito"</span>)
<span class="linenr"> 9: </span>        , (<span class="org-string">"M3-f"</span>,                    addName <span class="org-string">"Terminal file manager"</span>  <span class="org-haskell-operator">$</span> spawn myFileManager)
<span class="linenr">10: </span>        , (<span class="org-string">"M3-S-f"</span>,                  addName <span class="org-string">"Graphical file manager"</span> <span class="org-haskell-operator">$</span> spawn myGuiFileManager)
<span class="linenr">11: </span>        , (<span class="org-string">"M3-z"</span>,                    addName <span class="org-string">"Zoom"</span>                   <span class="org-haskell-operator">$</span> spawn <span class="org-string">"zoom"</span>)
<span class="linenr">12: </span>        ] <span class="org-haskell-operator">^++^</span>
<span class="linenr">13: </span>
<span class="linenr">14: </span>        subKeys <span class="org-string">"My (rofi) Scripts"</span>
<span class="linenr">15: </span>        [ (<span class="org-string">"M3-p M3-p"</span>,                 addName <span class="org-string">"Edit scripts"</span>        <span class="org-haskell-operator">$</span> menuEditScript)
<span class="linenr">16: </span>        , (<span class="org-string">"M3-p M3-e"</span>,                 addName <span class="org-string">"Edit configs"</span>        <span class="org-haskell-operator">$</span> menuEditConfig)
<span class="linenr">17: </span>        ] <span class="org-haskell-operator">^++^</span>
<span class="linenr">18: </span>
<span class="linenr">19: </span>        subKeys <span class="org-string">"Multimedia Keys"</span>
<span class="linenr">20: </span>        [ (<span class="org-string">"&lt;XF86AudioMute&gt;"</span>,         addName <span class="org-string">"Toggle mute"</span>           <span class="org-haskell-operator">$</span> volumeAdjust <span class="org-string">"togmute"</span>)
<span class="linenr">21: </span>        , (<span class="org-string">"&lt;XF86AudioLowerVolume&gt;"</span>,  addName <span class="org-string">"Decrease volume"</span>       <span class="org-haskell-operator">$</span> volumeAdjust <span class="org-string">"down"</span>)
<span class="linenr">22: </span>        , (<span class="org-string">"&lt;XF86AudioRaiseVolume&gt;"</span>,  addName <span class="org-string">"Increase volume"</span>       <span class="org-haskell-operator">$</span> volumeAdjust <span class="org-string">"up"</span>)
<span class="linenr">23: </span>        , (<span class="org-string">"&lt;XF86MonBrightnessDown&gt;"</span>, addName <span class="org-string">"Decrease brightness"</span>   <span class="org-haskell-operator">$</span> spawn <span class="org-string">"backlightS -dec 10"</span>)
<span class="linenr">24: </span>        , (<span class="org-string">"&lt;XF86MonBrightnessUp&gt;"</span>,   addName <span class="org-string">"Increase brightness"</span>   <span class="org-haskell-operator">$</span> spawn <span class="org-string">"backlightS -inc 10"</span>)
<span class="linenr">25: </span>        , (<span class="org-string">"&lt;XF86TouchpadToggle&gt;"</span>,    addName <span class="org-string">"Toggle Touchpad"</span>       <span class="org-haskell-operator">$</span> spawn <span class="org-string">"toggleTouchpadS"</span>)
<span class="linenr">26: </span>        , (<span class="org-string">"&lt;Print&gt;"</span>,                 addName <span class="org-string">"Take screenshot"</span>       <span class="org-haskell-operator">$</span> spawn (myPrintScreen <span class="org-haskell-operator">++</span> <span class="org-string">" -n"</span>))
<span class="linenr">27: </span>        , (<span class="org-string">"S-&lt;Print&gt;"</span>,               addName <span class="org-string">"Take screenshot menu"</span>  <span class="org-haskell-operator">$</span> spawn myPrintScreen)
<span class="linenr">28: </span>        , (<span class="org-string">"M-u p"</span>,                   addName <span class="org-string">"Play music"</span>            <span class="org-haskell-operator">$</span> spawn <span class="org-string">"mpc play"</span>)
<span class="linenr">29: </span>        , (<span class="org-string">"M-u ,"</span>,                   addName <span class="org-string">"Play next"</span>             <span class="org-haskell-operator">$</span> spawn <span class="org-string">"mpc next"</span>)
<span class="linenr">30: </span>        , (<span class="org-string">"M-u ."</span>,                   addName <span class="org-string">"Play previous"</span>         <span class="org-haskell-operator">$</span> spawn <span class="org-string">"mpc prev"</span>)
<span class="linenr">31: </span>        , (<span class="org-string">"M-u &lt;Space&gt;"</span>,             addName <span class="org-string">"Toggle play"</span>           <span class="org-haskell-operator">$</span> spawn <span class="org-string">"mpc toggle"</span>)
<span class="linenr">32: </span>        , (<span class="org-string">"M-u n"</span>,                   addName <span class="org-string">"Fetch TV url"</span>          <span class="org-haskell-operator">$</span> spawn <span class="org-string">"newseries -p"</span>)
<span class="linenr">33: </span>        , (<span class="org-string">"M-u /"</span>,                   addName <span class="org-string">"Music player"</span>          <span class="org-haskell-operator">$</span> namedScratchpadAction myScratchPads <span class="org-string">"myMusic"</span>)
<span class="linenr">34: </span>        ] <span class="org-haskell-operator">^++^</span>
<span class="linenr">35: </span>
<span class="linenr">36: </span>        subKeys <span class="org-string">"Scratchpads"</span>
<span class="linenr">37: </span>        [ (<span class="org-string">"M-C-&lt;Return&gt;"</span>, addName <span class="org-string">"Scratchpads"</span>    <span class="org-haskell-operator">$</span> namedScratchpadAction myScratchPads <span class="org-string">"scratchpad"</span>)
<span class="linenr">38: </span>        , (<span class="org-string">"M-`"</span>         , addName <span class="org-string">"Scratchpad"</span>     <span class="org-haskell-operator">$</span> namedScratchpadAction myScratchPads <span class="org-string">"scratchpad"</span>)
<span class="linenr">39: </span>        , (<span class="org-string">"M-z a"</span>       , addName <span class="org-string">"Volume control"</span> <span class="org-haskell-operator">$</span> namedScratchpadAction myScratchPads <span class="org-string">"myPavu"</span>)
<span class="linenr">40: </span>        , (<span class="org-string">"M-&lt;F2&gt;"</span>      , addName <span class="org-string">"Volume control"</span> <span class="org-haskell-operator">$</span> namedScratchpadAction myScratchPads <span class="org-string">"myPavu"</span>)
<span class="linenr">41: </span>        , (<span class="org-string">"M-z m"</span>       , addName <span class="org-string">"Music player"</span>   <span class="org-haskell-operator">$</span> namedScratchpadAction myScratchPads <span class="org-string">"myMusic"</span>)
<span class="linenr">42: </span>        , (<span class="org-string">"M-z w"</span>       , addName <span class="org-string">"Whatsapp"</span>       <span class="org-haskell-operator">$</span> namedScratchpadAction myScratchPads <span class="org-string">"myWhatsApp"</span>)
<span class="linenr">43: </span>        , (<span class="org-string">"M-z p"</span>       , addName <span class="org-string">"Proton mail"</span>    <span class="org-haskell-operator">$</span> namedScratchpadAction myScratchPads <span class="org-string">"myProtonmail"</span>)
<span class="linenr">44: </span>        ] <span class="org-haskell-operator">^++^</span>
<span class="linenr">45: </span>
</pre>
</div>

<p>
Prompts (<code>H-m</code>, man-page) and Search-engines(<code>H-s</code> +):
</p>

<ul class="org-ul">
<li><code>g</code> S.google</li>
<li><code>h</code> S.hoogle</li>
<li><code>w</code> S.wikipedia</li>
<li><code>a</code> archwiki</li>
<li><code>n</code> news</li>
<li><code>r</code> reddit</li>
<li><code>u</code> urban</li>
<li><code>c</code> S.hackage</li>
</ul>

<p>
(Defined <a href="#orgc5cef1f">here</a>)
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span class="linenr">1: </span>        subKeys <span class="org-string">"Prompts"</span>
<span class="linenr">2: </span>        [ (<span class="org-string">"M3-m"</span>, addName <span class="org-string">"Man-page Prompt"</span> <span class="org-haskell-operator">$</span> manPrompt myPromptTheme)] <span class="org-haskell-operator">^++^</span>
<span class="linenr">3: </span>
<span class="linenr">4: </span>        subKeys <span class="org-string">"Searchengines"</span>
<span class="linenr">5: </span>        [ (<span class="org-string">"M3-s "</span> <span class="org-haskell-operator">++</span> k, addName <span class="org-string">"Search Engines"</span>  <span class="org-haskell-operator">$</span> S.promptSearch myPromptTheme f) <span class="org-haskell-operator">|</span> (k,f) <span class="org-haskell-operator">&lt;-</span> searchList]
<span class="linenr">6: </span>
</pre>
</div>

<p>
Keybinding to display the keybinding cheatsheet
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span class="linenr">1: </span>    myCheatsheetKey <span class="org-haskell-operator">::</span> (<span class="org-haskell-type">KeyMask</span>, <span class="org-haskell-type">KeySym</span>)
<span class="linenr">2: </span>    myCheatsheetKey <span class="org-haskell-operator">=</span> (myModMask <span class="org-haskell-operator">.|.</span> shiftMask, xK_slash)
<span class="linenr">3: </span>
</pre>
</div>

<p>
Theme prompts:
</p>

<ul class="org-ul">
<li>Regular, for normal propmpts.</li>
<li>Warm, for projects</li>
<li>Hot, for Quitting and Killing</li>
</ul>

<div class="org-src-container">
<pre class="src src-haskell"><span class="linenr"> 1: </span>    myPromptTheme <span class="org-haskell-operator">::</span> <span class="org-haskell-type">XPConfig</span>
<span class="linenr"> 2: </span>    myPromptTheme <span class="org-haskell-operator">=</span> def
<span class="linenr"> 3: </span>        { font                  <span class="org-haskell-operator">=</span> myFont
<span class="linenr"> 4: </span>        , bgColor               <span class="org-haskell-operator">=</span> base03
<span class="linenr"> 5: </span>        , fgColor               <span class="org-haskell-operator">=</span> active
<span class="linenr"> 6: </span>        , fgHLight              <span class="org-haskell-operator">=</span> base03
<span class="linenr"> 7: </span>        , bgHLight              <span class="org-haskell-operator">=</span> active
<span class="linenr"> 8: </span>        , borderColor           <span class="org-haskell-operator">=</span> base03
<span class="linenr"> 9: </span>        , promptBorderWidth     <span class="org-haskell-operator">=</span> 0
<span class="linenr">10: </span>        , height                <span class="org-haskell-operator">=</span> prompt
<span class="linenr">11: </span>        , promptKeymap          <span class="org-haskell-operator">=</span> emacsLikeXPKeymap
<span class="linenr">12: </span>        , position              <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Top</span>
<span class="linenr">13: </span>        <span class="org-comment-delimiter">-- </span><span class="org-comment">, position            = CenteredAt { xpCenterY = 0.3, xpWidth = 0.3 }</span>
<span class="linenr">14: </span>        , historySize           <span class="org-haskell-operator">=</span> 256
<span class="linenr">15: </span>        , historyFilter         <span class="org-haskell-operator">=</span> id
<span class="linenr">16: </span>        , defaultText           <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">[]</span>
<span class="linenr">17: </span>        <span class="org-comment-delimiter">-- </span><span class="org-comment">, autoComplete        = Just 100000  -- set Just 100000 for .1 sec</span>
<span class="linenr">18: </span>        , showCompletionOnTab   <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">False</span>
<span class="linenr">19: </span>        <span class="org-comment-delimiter">-- </span><span class="org-comment">, complCaseSensitivity  = ComplCaseSensitive False -- newer version :-(!</span>
<span class="linenr">20: </span>        , searchPredicate       <span class="org-haskell-operator">=</span> fuzzyMatch   <span class="org-comment-delimiter">--</span>
<span class="linenr">21: </span>        , sorter                <span class="org-haskell-operator">=</span> fuzzySort
<span class="linenr">22: </span>        , defaultPrompter       <span class="org-haskell-operator">=</span> id <span class="org-haskell-operator">$</span> map toUpper  <span class="org-comment-delimiter">-- </span><span class="org-comment">change prompt to UPPER</span>
<span class="linenr">23: </span>        , alwaysHighlight       <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">True</span>
<span class="linenr">24: </span>        , maxComplRows          <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Just</span> 15 <span class="org-comment-delimiter">-- </span><span class="org-comment">Nothing -- Nothing is unlimited</span>
<span class="linenr">25: </span>        }
<span class="linenr">26: </span>
<span class="linenr">27: </span>    warmPromptTheme <span class="org-haskell-operator">=</span> myPromptTheme
<span class="linenr">28: </span>        { bgColor               <span class="org-haskell-operator">=</span> yellow
<span class="linenr">29: </span>        , fgColor               <span class="org-haskell-operator">=</span> base03
<span class="linenr">30: </span>        , position              <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Top</span>
<span class="linenr">31: </span>        }
<span class="linenr">32: </span>
<span class="linenr">33: </span>    hotPromptTheme <span class="org-haskell-operator">=</span> myPromptTheme
<span class="linenr">34: </span>        { bgColor               <span class="org-haskell-operator">=</span> red
<span class="linenr">35: </span>        , fgColor               <span class="org-haskell-operator">=</span> base3
<span class="linenr">36: </span>        , position              <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Top</span>
<span class="linenr">37: </span>        }
<span class="linenr">38: </span>
</pre>
</div>
</div>
</div>
