ws.org
* src/MyManageHook.hs
  :PROPERTIES:
  :header-args: :tangle "~/.config/xmonad/src/MyManageHook.hs"
  :END:

  *Modules needed:*

  #+begin_src haskell -n
module MyManageHook
(myManageHook)
where

import Data.List (isInfixOf)
import Data.Ratio
import XMonad
import XMonad.Hooks.ManageDocks
import XMonad.Hooks.ManageHelpers
import qualified XMonad.StackSet as W

import MyScratchpads (myScratchPads)
import XMonad.Util.NamedScratchpad

  #+end_src

  Help functions:

  #+begin_src haskell -n
titleContains :: String -> Query Bool
titleContains string = fmap (isInfixOf string) title

isZoomNotification :: Query Bool
isZoomNotification = className =? "zoom" <&&> title =? "zoom"

  #+end_src

   **Window rules: Manage Hook**

   Execute arbitrary actions and WindowSet manipulations when managing
   a new window. You can use this to, for example, always float a
   particular program, or have a client always appear on a particular
   workspace.

   To find the property name associated with a program, use

   #+begin_example
   xprop | grep WM_CLASS
   #+end_example

   and click on the client you're interested in.

   *Update:* use [[*Xprop wrapper - xmonpropS][Xprop wrapper - xmonpropS]]

   To match on the WM_NAME, you can use 'title' in the same way that
   'className' and 'resource' are used below.

   The class name of an application corresponds to the first
   value of WM_CLASS (“Pidgin”).
   The resource corresponds to the second value of WM_CLASS (also “Pidgin”).
   The title corresponds to WM_NAME (“Buddy List”).

  #+begin_src haskell -n
manageSpecific :: ManageHook
manageSpecific = composeAll . concat $
    [ [ resource   =? c                     --> largeFloat | c <- floatApps ]

    , [ resource   =? "gsimplecal"          --> doFloatAt' (1554/1920) (30/1040) ]
    -- , [ className  =? c                     --> doShift ( myWorkspaces !! 0 )| c <- myBrowsers ] TODO IRC

    , [ role       =? "gimp-file-open"      --> doRectFloat (W.RationalRect 0.3 0.3 0.9 0.9) ]
    , [ className  =? "Gimp"                --> doCenterFloat]

    , [ className  =? "zoom" <&&> titleContains z --> doFloat | z <- myZoomFloats ]
    , [ isZoomNotification                        --> doFloat ]

    , [ className  =? "Chromium" <&&> role =? "GtkFileChooserDialog" --> largeFloat]
    , [ (title     =? "emacs-capture" )     --> smallFloat ]

    , [ (className =? "obs" <&&> title =? "Scripts" ) --> largeFloat ]
    , [ (className =? "obs" <&&> isDialog ) --> largeFloat ]
    ]
    where
        floatApps  = ["pavucontrol", "myMusic", "xmessage", "myFloat"]
        obsFloats  = [ "Scripts"]
        myZoomFloats   = ["Chat", "Participants", "Rooms"] -- Currently untested for breakout rooms
        role = stringProperty "WM_WINDOW_ROLE"
        doMaster = doF W.shiftMaster --append this to all floats so new windows always go on top, regardless of the current focus
        doFloatAt' x y = doFloatAt x y <+> doMaster

myManageHook :: ManageHook
myManageHook = manageSpecific <+> manageDocks  <+> namedScratchpadManageHook myScratchPads

  #+end_src

  #+begin_src haskell -n
largeFloat :: ManageHook
largeFloat = doFloatDep move
  where
    move :: W.RationalRect -> W.RationalRect
    move _ = W.RationalRect x y w h
    w, h, x, y :: Rational
    w = 3/4
    h = 3/4
    x = (1-w)/2
    y = (1-h)/2


smallFloat :: ManageHook
smallFloat = doFloatDep move
  where
    move :: W.RationalRect -> W.RationalRect
    move _ = W.RationalRect x y w h
    w, h, x, y :: Rational
    w = 2/3
    h = 1/4
    x = (1-w)/2
    y = (1-h)/2

zoomFloat :: ManageHook
zoomFloat = doFloatDep move
  where
    move :: W.RationalRect -> W.RationalRect
    move _ = W.RationalRect x y w h
    w, h, x, y :: Rational
    w = 1/4
    h = 1/4
    x = (1-w)/2
    y = (1-h)/2

  #+end_src

