docs/ws.html

<div id="outline-container-org32d87a9" class="outline-2">
<h2 id="org32d87a9">src/MyManageHook.hs</h2>
<div class="outline-text-2" id="text-org32d87a9">
<p>
<b>Modules needed:</b>
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span class="linenr"> 1: </span><span class="org-haskell-keyword">module</span> <span class="org-haskell-constructor">MyManageHook</span>
<span class="linenr"> 2: </span>(myManageHook)
<span class="linenr"> 3: </span><span class="org-haskell-keyword">where</span>
<span class="linenr"> 4: </span>
<span class="linenr"> 5: </span><span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Data.List</span> (isInfixOf)
<span class="linenr"> 6: </span><span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Data.Ratio</span>
<span class="linenr"> 7: </span><span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">XMonad</span>
<span class="linenr"> 8: </span><span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">XMonad.Hooks.ManageDocks</span>
<span class="linenr"> 9: </span><span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">XMonad.Hooks.ManageHelpers</span>
<span class="linenr">10: </span><span class="org-haskell-keyword">import</span> <span class="org-haskell-keyword">qualified</span> <span class="org-haskell-constructor">XMonad.StackSet</span> <span class="org-haskell-keyword">as</span> <span class="org-haskell-constructor">W</span>
<span class="linenr">11: </span>
<span class="linenr">12: </span><span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">MyScratchpads</span> (myScratchPads)
<span class="linenr">13: </span><span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">XMonad.Util.NamedScratchpad</span>
<span class="linenr">14: </span>
</pre>
</div>

<p>
Help functions:
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span class="linenr">1: </span><span class="org-haskell-definition">titleContains</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">String</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Query</span> <span class="org-haskell-type">Bool</span>
<span class="linenr">2: </span><span class="org-haskell-definition">titleContains</span> string <span class="org-haskell-operator">=</span> fmap (isInfixOf string) title
<span class="linenr">3: </span>
<span class="linenr">4: </span><span class="org-haskell-definition">isZoomNotification</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Query</span> <span class="org-haskell-type">Bool</span>
<span class="linenr">5: </span><span class="org-haskell-definition">isZoomNotification</span> <span class="org-haskell-operator">=</span> className <span class="org-haskell-operator">=?</span> <span class="org-string">"zoom"</span> <span class="org-haskell-operator">&lt;&amp;&amp;&gt;</span> title <span class="org-haskell-operator">=?</span> <span class="org-string">"zoom"</span>
<span class="linenr">6: </span>
</pre>
</div>

<p>
<b><b>Window rules: Manage Hook</b></b>
</p>

<p>
Execute arbitrary actions and WindowSet manipulations when managing
a new window. You can use this to, for example, always float a
particular program, or have a client always appear on a particular
workspace.
</p>

<p>
To find the property name associated with a program, use
</p>

<pre class="example" id="orgbc90618">
   xprop | grep WM_CLASS
</pre>

<p>
and click on the client you're interested in.
</p>

<p>
<b>Update:</b> use <a href="#orgc7ae9e0">Xprop wrapper - xmonpropS</a>
</p>

<p>
To match on the WM<sub>NAME</sub>, you can use 'title' in the same way that
'className' and 'resource' are used below.
</p>

<p>
The class name of an application corresponds to the first
value of WM<sub>CLASS</sub> (Pidgin).
The resource corresponds to the second value of WM<sub>CLASS</sub> (also Pidgin).
The title corresponds to WM<sub>NAME</sub> (Buddy List).
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span class="linenr"> 1: </span><span class="org-haskell-definition">manageSpecific</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">ManageHook</span>
<span class="linenr"> 2: </span><span class="org-haskell-definition">manageSpecific</span> <span class="org-haskell-operator">=</span> composeAll <span class="org-haskell-operator">.</span> concat <span class="org-haskell-operator">$</span>
<span class="linenr"> 3: </span>    [ [ resource   <span class="org-haskell-operator">=?</span> c                     <span class="org-haskell-operator">--&gt;</span> largeFloat <span class="org-haskell-operator">|</span> c <span class="org-haskell-operator">&lt;-</span> floatApps ]
<span class="linenr"> 4: </span>
<span class="linenr"> 5: </span>    , [ resource   <span class="org-haskell-operator">=?</span> <span class="org-string">"gsimplecal"</span>          <span class="org-haskell-operator">--&gt;</span> doFloatAt' (1554<span class="org-haskell-operator">/</span>1920) (30<span class="org-haskell-operator">/</span>1040) ]
<span class="linenr"> 6: </span>    <span class="org-comment-delimiter">-- </span><span class="org-comment">, [ className  =? c                     --&gt; doShift ( myWorkspaces !! 0 )| c &lt;- myBrowsers ] TODO IRC</span>
<span class="linenr"> 7: </span>
<span class="linenr"> 8: </span>    , [ role       <span class="org-haskell-operator">=?</span> <span class="org-string">"gimp-file-open"</span>      <span class="org-haskell-operator">--&gt;</span> doRectFloat (<span class="org-haskell-constructor">W.RationalRect</span> 0.3 0.3 0.9 0.9) ]
<span class="linenr"> 9: </span>    , [ className  <span class="org-haskell-operator">=?</span> <span class="org-string">"Gimp"</span>                <span class="org-haskell-operator">--&gt;</span> doCenterFloat]
<span class="linenr">10: </span>
<span class="linenr">11: </span>    , [ className  <span class="org-haskell-operator">=?</span> <span class="org-string">"zoom"</span> <span class="org-haskell-operator">&lt;&amp;&amp;&gt;</span> titleContains z <span class="org-haskell-operator">--&gt;</span> doFloat <span class="org-haskell-operator">|</span> z <span class="org-haskell-operator">&lt;-</span> myZoomFloats ]
<span class="linenr">12: </span>    , [ isZoomNotification                        <span class="org-haskell-operator">--&gt;</span> doFloat ]
<span class="linenr">13: </span>
<span class="linenr">14: </span>    , [ className  <span class="org-haskell-operator">=?</span> <span class="org-string">"Chromium"</span> <span class="org-haskell-operator">&lt;&amp;&amp;&gt;</span> role <span class="org-haskell-operator">=?</span> <span class="org-string">"GtkFileChooserDialog"</span> <span class="org-haskell-operator">--&gt;</span> largeFloat]
<span class="linenr">15: </span>    , [ (title     <span class="org-haskell-operator">=?</span> <span class="org-string">"emacs-capture"</span> )     <span class="org-haskell-operator">--&gt;</span> smallFloat ]
<span class="linenr">16: </span>
<span class="linenr">17: </span>    , [ (className <span class="org-haskell-operator">=?</span> <span class="org-string">"obs"</span> <span class="org-haskell-operator">&lt;&amp;&amp;&gt;</span> title <span class="org-haskell-operator">=?</span> <span class="org-string">"Scripts"</span> ) <span class="org-haskell-operator">--&gt;</span> largeFloat ]
<span class="linenr">18: </span>    , [ (className <span class="org-haskell-operator">=?</span> <span class="org-string">"obs"</span> <span class="org-haskell-operator">&lt;&amp;&amp;&gt;</span> isDialog ) <span class="org-haskell-operator">--&gt;</span> largeFloat ]
<span class="linenr">19: </span>    ]
<span class="linenr">20: </span>    <span class="org-haskell-keyword">where</span>
<span class="linenr">21: </span>        floatApps  <span class="org-haskell-operator">=</span> [<span class="org-string">"pavucontrol"</span>, <span class="org-string">"myMusic"</span>, <span class="org-string">"xmessage"</span>, <span class="org-string">"myFloat"</span>]
<span class="linenr">22: </span>        obsFloats  <span class="org-haskell-operator">=</span> [ <span class="org-string">"Scripts"</span>]
<span class="linenr">23: </span>        myZoomFloats   <span class="org-haskell-operator">=</span> [<span class="org-string">"Chat"</span>, <span class="org-string">"Participants"</span>, <span class="org-string">"Rooms"</span>] <span class="org-comment-delimiter">-- </span><span class="org-comment">Currently untested for breakout rooms</span>
<span class="linenr">24: </span>        role <span class="org-haskell-operator">=</span> stringProperty <span class="org-string">"WM_WINDOW_ROLE"</span>
<span class="linenr">25: </span>        doMaster <span class="org-haskell-operator">=</span> doF W.shiftMaster <span class="org-comment-delimiter">--</span><span class="org-comment">append this to all floats so new windows always go on top, regardless of the current focus</span>
<span class="linenr">26: </span>        doFloatAt' x y <span class="org-haskell-operator">=</span> doFloatAt x y <span class="org-haskell-operator">&lt;+&gt;</span> doMaster
<span class="linenr">27: </span>
<span class="linenr">28: </span><span class="org-haskell-definition">myManageHook</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">ManageHook</span>
<span class="linenr">29: </span><span class="org-haskell-definition">myManageHook</span> <span class="org-haskell-operator">=</span> manageSpecific <span class="org-haskell-operator">&lt;+&gt;</span> manageDocks  <span class="org-haskell-operator">&lt;+&gt;</span> namedScratchpadManageHook myScratchPads
<span class="linenr">30: </span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-haskell"><span class="linenr"> 1: </span><span class="org-haskell-definition">largeFloat</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">ManageHook</span>
<span class="linenr"> 2: </span><span class="org-haskell-definition">largeFloat</span> <span class="org-haskell-operator">=</span> doFloatDep move
<span class="linenr"> 3: </span>  <span class="org-haskell-keyword">where</span>
<span class="linenr"> 4: </span>    move <span class="org-haskell-operator">::</span> <span class="org-haskell-type">W.RationalRect</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">W.RationalRect</span>
<span class="linenr"> 5: </span>    move <span class="org-haskell-keyword">_</span> <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">W.RationalRect</span> x y w h
<span class="linenr"> 6: </span>    w, h, x, y <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Rational</span>
<span class="linenr"> 7: </span>    w <span class="org-haskell-operator">=</span> 3<span class="org-haskell-operator">/</span>4
<span class="linenr"> 8: </span>    h <span class="org-haskell-operator">=</span> 3<span class="org-haskell-operator">/</span>4
<span class="linenr"> 9: </span>    x <span class="org-haskell-operator">=</span> (1<span class="org-haskell-operator">-</span>w)<span class="org-haskell-operator">/</span>2
<span class="linenr">10: </span>    y <span class="org-haskell-operator">=</span> (1<span class="org-haskell-operator">-</span>h)<span class="org-haskell-operator">/</span>2
<span class="linenr">11: </span>
<span class="linenr">12: </span>
<span class="linenr">13: </span><span class="org-haskell-definition">smallFloat</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">ManageHook</span>
<span class="linenr">14: </span><span class="org-haskell-definition">smallFloat</span> <span class="org-haskell-operator">=</span> doFloatDep move
<span class="linenr">15: </span>  <span class="org-haskell-keyword">where</span>
<span class="linenr">16: </span>    move <span class="org-haskell-operator">::</span> <span class="org-haskell-type">W.RationalRect</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">W.RationalRect</span>
<span class="linenr">17: </span>    move <span class="org-haskell-keyword">_</span> <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">W.RationalRect</span> x y w h
<span class="linenr">18: </span>    w, h, x, y <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Rational</span>
<span class="linenr">19: </span>    w <span class="org-haskell-operator">=</span> 2<span class="org-haskell-operator">/</span>3
<span class="linenr">20: </span>    h <span class="org-haskell-operator">=</span> 1<span class="org-haskell-operator">/</span>4
<span class="linenr">21: </span>    x <span class="org-haskell-operator">=</span> (1<span class="org-haskell-operator">-</span>w)<span class="org-haskell-operator">/</span>2
<span class="linenr">22: </span>    y <span class="org-haskell-operator">=</span> (1<span class="org-haskell-operator">-</span>h)<span class="org-haskell-operator">/</span>2
<span class="linenr">23: </span>
<span class="linenr">24: </span><span class="org-haskell-definition">zoomFloat</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">ManageHook</span>
<span class="linenr">25: </span><span class="org-haskell-definition">zoomFloat</span> <span class="org-haskell-operator">=</span> doFloatDep move
<span class="linenr">26: </span>  <span class="org-haskell-keyword">where</span>
<span class="linenr">27: </span>    move <span class="org-haskell-operator">::</span> <span class="org-haskell-type">W.RationalRect</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">W.RationalRect</span>
<span class="linenr">28: </span>    move <span class="org-haskell-keyword">_</span> <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">W.RationalRect</span> x y w h
<span class="linenr">29: </span>    w, h, x, y <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Rational</span>
<span class="linenr">30: </span>    w <span class="org-haskell-operator">=</span> 1<span class="org-haskell-operator">/</span>4
<span class="linenr">31: </span>    h <span class="org-haskell-operator">=</span> 1<span class="org-haskell-operator">/</span>4
<span class="linenr">32: </span>    x <span class="org-haskell-operator">=</span> (1<span class="org-haskell-operator">-</span>w)<span class="org-haskell-operator">/</span>2
<span class="linenr">33: </span>    y <span class="org-haskell-operator">=</span> (1<span class="org-haskell-operator">-</span>h)<span class="org-haskell-operator">/</span>2
<span class="linenr">34: </span>
</pre>
</div>
</div>
</div>
