ws.org
* src/MyCheatsheet
  :PROPERTIES:
  :header-args:  :tangle "~/.config/xmonad/src/MyCheatsheet.hs"
  :END:

  - Source: [[https://github.com/quarkQuark/dotfiles/tree/49ab839c7c8ad33c728a1238a2af9ce860abe5dc/.config/xmonad][github.com/quarkQuark/dotfiles]]

  *Modules needed:*

  #+begin_src haskell -n
    module MyCheatsheet
    (myCheatsheet)
    where

    import Data.List.Split (chunksOf)
    import System.IO
    import Test.FitSpec.PrettyPrint (columns) -- Requires the 'fitspec' package
    import XMonad
    import XMonad.Util.NamedActions
    import XMonad.Util.Run

  #+end_src

  Pipe key bindings to dzen2:

  #+begin_src haskell -n
    -- Number of colomns with with which to display the cheatsheet
    myCheatsheetCols :: Int
    myCheatsheetCols = 3

    -- Format the keybindings so they can be sent to the display
    formatList :: [String] -> String
    formatList list = columns "SeparatorPlaceholder" -- Normalise column widths -> Table
                    $ map unlines -- Connect the sublists with line breaks -> [column1,column2,...]
                    $ chunksOf (myCheatsheetRows (list))
                    $ list -- The list to be formatted

            where rowsFromColumns list nCol = 1 + length list `div` nCol
                  myCheatsheetRows list = rowsFromColumns list myCheatsheetCols

    -- How to display the cheatsheet (adapted from Ethan Schoonover's config)
    myCheatsheet :: [((KeyMask, KeySym), NamedAction)] -> NamedAction
    myCheatsheet myKeyList = addName "Show Keybindings" $ io $ do
        handle <- spawnPipe "dzen2-display-cheatsheetS"
        hPutStrLn handle "TitlePlaceholder\n" -- Replaced in the script
        hPutStrLn handle $ formatList (showKm myKeyList)
        hClose handle
        return ()

  #+end_src

  Script: =dzen2-display-cheatsheetS=

  #+begin_src shell :tangle-mode (identity #o555) :tangle "~/.local/bin/dzen2-display-cheatsheetS"
    #!/usr/bin/sh

    font="Mono-10"

    # Colours
    background='#000000'
    titleColour='^fg(#00AAAA)'
    asideColour='^fg(#666666)'
    headingColour='^fg(#FFFFFF)'
    keyColourSuper='^fg(#AAAA00)'
    keyColourHyper='^fg(#AA88FF)'
    keyColourMedia='^fg(#FF8888)'
    descColour='^fg(#AAAAAA)'

    # Patterns to replace
    keyLinesSuper='\(M4-\|Super\)[^ ]*'
    keyLinesHyper='M3-[^ ]*'
    keyLinesMedia='\(Print\|XF86\|C-\)[^ ]*'
    headings='>>'

    # Replacement Variables
    super="${keyColourSuper}Super(Windows\/Space)${titleColour}"
    hyper="${keyColourHyper}Hyper(Caps Lock)${titleColour}"
    title="${titleColour}XMonad Keybindings (with the $super or $hyper key)"\
    "${asideColour}        -    Click to close"

    # Screen dimensions, for positioning calculations
    screenXY=`xdpyinfo | awk '/dimensions:/ { print $2 }'`
    screenX=${screenXY%x*}
    screenY=${screenXY#*x}

    # Dimensions
    lineHeight=24
    lines=42
    replaceSeparator="s/SeparatorPlaceholder/    /g"
    width=1800
    height=`expr ${lineHeight} \* \( ${lines} + 1 \)`

    # Position
    xPos=`expr \( ${screenX} - ${width} \) / 2`
    yPos=`expr \( ${screenY} - ${height} \) / 2`

    # Dzen behaviour
    eventActions='onstart=uncollapse'\
    ';button1=exit;button3=exit;key_Escape=exit'\
    ';button4=scrollup;button5=scrolldown'

    # Replace placeholders
    replaceTitle="s/TitlePlaceholder/${title}/g"
    replaceSuperTap="s/C-Escape/Super   /g"
    replaceShift="s/Shift-\([^ ]*\)/S-\1    /g"
    replaceSlash="s/slash/\/    /g"
    replacePlaceholders="${replaceTitle};${replaceM4};${replaceSuperTap}
    ;${replaceShift};${replaceSlash};${replaceSeparator}"

    # Format colour
    colourKeyLinesSuper="s/${keyLinesSuper}/${keyColourSuper}&${descColour}/g"
    colourKeyLinesHyper="s/${keyLinesHyper}/${keyColourHyper}&${descColour}/g"
    colourKeyLinesMedia="s/${keyLinesMedia}/${keyColourMedia}&${descColour}/g"
    colourHeadings="s/${headings}/${headingColour}&/g"
    formatColour="${colourKeyLinesSuper};${colourKeyLinesHyper};${colourKeyLinesMedia};${colourHeadings}"

    # Remove redundancies
    removeM4="s/M4-\([^ ]*\)/\1   /g"
    removeM3="s/M3-\([^ ]*\)/\1   /g"
    screen="s/ S \(.\)/ \1  /g"
    removeRedundancies="${removeM4};${removeM3};${screen}"

    addMargin="/[^<${title}>]/s/^/  /g"

    sed "${replacePlaceholders};${formatColour};${addMargin};${removeRedundancies}" \
        | dzen2 -p \
                -bg $background \
                -h "$lineHeight" -w "$width" -l "$lines" \
                -x "$xPos" -y "$yPos" \
                -fn $font \
                -e $eventActions

  #+end_src
