docs/ws.html

<div id="outline-container-orgb861bc1" class="outline-2">
<h2 id="orgb861bc1">src/MyCheatsheet</h2>
<div class="outline-text-2" id="text-orgb861bc1">
<ul class="org-ul">
<li>Source: <a href="https://github.com/quarkQuark/dotfiles/tree/49ab839c7c8ad33c728a1238a2af9ce860abe5dc/.config/xmonad">github.com/quarkQuark/dotfiles</a></li>
</ul>

<p>
<b>Modules needed:</b>
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span class="linenr"> 1: </span>    <span class="org-haskell-keyword">module</span> <span class="org-haskell-constructor">MyCheatsheet</span>
<span class="linenr"> 2: </span>    (myCheatsheet)
<span class="linenr"> 3: </span>    <span class="org-haskell-keyword">where</span>
<span class="linenr"> 4: </span>
<span class="linenr"> 5: </span>    <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Data.List.Split</span> (chunksOf)
<span class="linenr"> 6: </span>    <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">System.IO</span>
<span class="linenr"> 7: </span>    <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Test.FitSpec.PrettyPrint</span> (columns) <span class="org-comment-delimiter">-- </span><span class="org-comment">Requires the 'fitspec' package</span>
<span class="linenr"> 8: </span>    <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">XMonad</span>
<span class="linenr"> 9: </span>    <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">XMonad.Util.NamedActions</span>
<span class="linenr">10: </span>    <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">XMonad.Util.Run</span>
<span class="linenr">11: </span>
</pre>
</div>

<p>
Pipe key bindings to dzen2:
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span class="linenr"> 1: </span>    <span class="org-comment-delimiter">-- </span><span class="org-comment">Number of colomns with with which to display the cheatsheet</span>
<span class="linenr"> 2: </span>    myCheatsheetCols <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Int</span>
<span class="linenr"> 3: </span>    myCheatsheetCols <span class="org-haskell-operator">=</span> 3
<span class="linenr"> 4: </span>
<span class="linenr"> 5: </span>    <span class="org-comment-delimiter">-- </span><span class="org-comment">Format the keybindings so they can be sent to the display</span>
<span class="linenr"> 6: </span>    formatList <span class="org-haskell-operator">::</span> [<span class="org-haskell-type">String</span>] <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">String</span>
<span class="linenr"> 7: </span>    formatList list <span class="org-haskell-operator">=</span> columns <span class="org-string">"SeparatorPlaceholder"</span> <span class="org-comment-delimiter">-- </span><span class="org-comment">Normalise column widths -&gt; Table</span>
<span class="linenr"> 8: </span>                    <span class="org-haskell-operator">$</span> map unlines <span class="org-comment-delimiter">-- </span><span class="org-comment">Connect the sublists with line breaks -&gt; [column1,column2,...]</span>
<span class="linenr"> 9: </span>                    <span class="org-haskell-operator">$</span> chunksOf (myCheatsheetRows (list))
<span class="linenr">10: </span>                    <span class="org-haskell-operator">$</span> list <span class="org-comment-delimiter">-- </span><span class="org-comment">The list to be formatted</span>
<span class="linenr">11: </span>
<span class="linenr">12: </span>            <span class="org-haskell-keyword">where</span> rowsFromColumns list nCol <span class="org-haskell-operator">=</span> 1 <span class="org-haskell-operator">+</span> length list <span class="org-haskell-operator">`div`</span> nCol
<span class="linenr">13: </span>                  myCheatsheetRows list <span class="org-haskell-operator">=</span> rowsFromColumns list myCheatsheetCols
<span class="linenr">14: </span>
<span class="linenr">15: </span>    <span class="org-comment-delimiter">-- </span><span class="org-comment">How to display the cheatsheet (adapted from Ethan Schoonover's config)</span>
<span class="linenr">16: </span>    myCheatsheet <span class="org-haskell-operator">::</span> [((<span class="org-haskell-type">KeyMask</span>, <span class="org-haskell-type">KeySym</span>), <span class="org-haskell-type">NamedAction</span>)] <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">NamedAction</span>
<span class="linenr">17: </span>    myCheatsheet myKeyList <span class="org-haskell-operator">=</span> addName <span class="org-string">"Show Keybindings"</span> <span class="org-haskell-operator">$</span> io <span class="org-haskell-operator">$</span> <span class="org-haskell-keyword">do</span>
<span class="linenr">18: </span>        handle <span class="org-haskell-operator">&lt;-</span> spawnPipe <span class="org-string">"dzen2-display-cheatsheetS"</span>
<span class="linenr">19: </span>        hPutStrLn handle <span class="org-string">"TitlePlaceholder\n"</span> <span class="org-comment-delimiter">-- </span><span class="org-comment">Replaced in the script</span>
<span class="linenr">20: </span>        hPutStrLn handle <span class="org-haskell-operator">$</span> formatList (showKm myKeyList)
<span class="linenr">21: </span>        hClose handle
<span class="linenr">22: </span>        return <span class="org-haskell-constructor">()</span>
<span class="linenr">23: </span>
</pre>
</div>

<p>
Script: <code>dzen2-display-cheatsheetS</code>
</p>

<div class="org-src-container">
<pre class="src src-shell">    <span class="org-comment-delimiter">#</span><span class="org-comment">!/usr/bin/sh</span>

    <span class="org-variable-name">font</span>=<span class="org-string">"Mono-10"</span>

    <span class="org-comment-delimiter"># </span><span class="org-comment">Colours</span>
    <span class="org-variable-name">background</span>=<span class="org-string">'#000000'</span>
    <span class="org-variable-name">titleColour</span>=<span class="org-string">'^fg(#00AAAA)'</span>
    <span class="org-variable-name">asideColour</span>=<span class="org-string">'^fg(#666666)'</span>
    <span class="org-variable-name">headingColour</span>=<span class="org-string">'^fg(#FFFFFF)'</span>
    <span class="org-variable-name">keyColourSuper</span>=<span class="org-string">'^fg(#AAAA00)'</span>
    <span class="org-variable-name">keyColourHyper</span>=<span class="org-string">'^fg(#AA88FF)'</span>
    <span class="org-variable-name">keyColourMedia</span>=<span class="org-string">'^fg(#FF8888)'</span>
    <span class="org-variable-name">descColour</span>=<span class="org-string">'^fg(#AAAAAA)'</span>

    <span class="org-comment-delimiter"># </span><span class="org-comment">Patterns to replace</span>
    <span class="org-variable-name">keyLinesSuper</span>=<span class="org-string">'\(M4-\|Super\)[^ ]*'</span>
    <span class="org-variable-name">keyLinesHyper</span>=<span class="org-string">'M3-[^ ]*'</span>
    <span class="org-variable-name">keyLinesMedia</span>=<span class="org-string">'\(Print\|XF86\|C-\)[^ ]*'</span>
    <span class="org-variable-name">headings</span>=<span class="org-string">'&gt;&gt;'</span>

    <span class="org-comment-delimiter"># </span><span class="org-comment">Replacement Variables</span>
    <span class="org-variable-name">super</span>=<span class="org-string">"${keyColourSuper}Super(Windows\/Space)${titleColour}"</span>
    <span class="org-variable-name">hyper</span>=<span class="org-string">"${keyColourHyper}Hyper(Caps Lock)${titleColour}"</span>
    <span class="org-variable-name">title</span>=<span class="org-string">"${titleColour}XMonad Keybindings (with the $super or $hyper key)"</span><span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"${asideColour}        -    Click to close"</span>

    <span class="org-comment-delimiter"># </span><span class="org-comment">Screen dimensions, for positioning calculations</span>
    <span class="org-variable-name">screenXY</span>=<span class="org-sh-quoted-exec">`xdpyinfo | awk '/dimensions:/ { print $2 }'`</span>
    <span class="org-variable-name">screenX</span>=${<span class="org-variable-name">screenXY</span>%x*}
    <span class="org-variable-name">screenY</span>=${<span class="org-variable-name">screenXY</span>#*x}

    <span class="org-comment-delimiter"># </span><span class="org-comment">Dimensions</span>
    <span class="org-variable-name">lineHeight</span>=24
    <span class="org-variable-name">lines</span>=42
    <span class="org-variable-name">replaceSeparator</span>=<span class="org-string">"s/SeparatorPlaceholder/    /g"</span>
    <span class="org-variable-name">width</span>=1800
    <span class="org-variable-name">height</span>=<span class="org-sh-quoted-exec">`expr ${lineHeight} \* \( ${lines} + 1 \)`</span>

    <span class="org-comment-delimiter"># </span><span class="org-comment">Position</span>
    <span class="org-variable-name">xPos</span>=<span class="org-sh-quoted-exec">`expr \( ${screenX} - ${width} \) / 2`</span>
    <span class="org-variable-name">yPos</span>=<span class="org-sh-quoted-exec">`expr \( ${screenY} - ${height} \) / 2`</span>

    <span class="org-comment-delimiter"># </span><span class="org-comment">Dzen behaviour</span>
    <span class="org-variable-name">eventActions</span>=<span class="org-string">'onstart=uncollapse'</span><span class="org-sh-escaped-newline">\</span>
    <span class="org-string">';button1=exit;button3=exit;key_Escape=exit'</span><span class="org-sh-escaped-newline">\</span>
    <span class="org-string">';button4=scrollup;button5=scrolldown'</span>

    <span class="org-comment-delimiter"># </span><span class="org-comment">Replace placeholders</span>
    <span class="org-variable-name">replaceTitle</span>=<span class="org-string">"s/TitlePlaceholder/${title}/g"</span>
    <span class="org-variable-name">replaceSuperTap</span>=<span class="org-string">"s/C-Escape/Super   /g"</span>
    <span class="org-variable-name">replaceShift</span>=<span class="org-string">"s/Shift-\([^ ]*\)/S-\1    /g"</span>
    <span class="org-variable-name">replaceSlash</span>=<span class="org-string">"s/slash/\/    /g"</span>
    <span class="org-variable-name">replacePlaceholders</span>=<span class="org-string">"${replaceTitle};${replaceM4};${replaceSuperTap}</span>
<span class="org-string">    ;${replaceShift};${replaceSlash};${replaceSeparator}"</span>

    <span class="org-comment-delimiter"># </span><span class="org-comment">Format colour</span>
    <span class="org-variable-name">colourKeyLinesSuper</span>=<span class="org-string">"s/${keyLinesSuper}/${keyColourSuper}&amp;${descColour}/g"</span>
    <span class="org-variable-name">colourKeyLinesHyper</span>=<span class="org-string">"s/${keyLinesHyper}/${keyColourHyper}&amp;${descColour}/g"</span>
    <span class="org-variable-name">colourKeyLinesMedia</span>=<span class="org-string">"s/${keyLinesMedia}/${keyColourMedia}&amp;${descColour}/g"</span>
    <span class="org-variable-name">colourHeadings</span>=<span class="org-string">"s/${headings}/${headingColour}&amp;/g"</span>
    <span class="org-variable-name">formatColour</span>=<span class="org-string">"${colourKeyLinesSuper};${colourKeyLinesHyper};${colourKeyLinesMedia};${colourHeadings}"</span>

    <span class="org-comment-delimiter"># </span><span class="org-comment">Remove redundancies</span>
    <span class="org-variable-name">removeM4</span>=<span class="org-string">"s/M4-\([^ ]*\)/\1   /g"</span>
    <span class="org-variable-name">removeM3</span>=<span class="org-string">"s/M3-\([^ ]*\)/\1   /g"</span>
    <span class="org-variable-name">screen</span>=<span class="org-string">"s/ S \(.\)/ \1  /g"</span>
    <span class="org-variable-name">removeRedundancies</span>=<span class="org-string">"${removeM4};${removeM3};${screen}"</span>

    <span class="org-variable-name">addMargin</span>=<span class="org-string">"/[^&lt;${title}&gt;]/s/^/  /g"</span>

    sed <span class="org-string">"${replacePlaceholders};${formatColour};${addMargin};${removeRedundancies}"</span> <span class="org-sh-escaped-newline">\</span>
        | dzen2 -p <span class="org-sh-escaped-newline">\</span>
                -bg $<span class="org-variable-name">background</span> <span class="org-sh-escaped-newline">\</span>
                -h <span class="org-string">"$lineHeight"</span> -w <span class="org-string">"$width"</span> -l <span class="org-string">"$lines"</span> <span class="org-sh-escaped-newline">\</span>
                -x <span class="org-string">"$xPos"</span> -y <span class="org-string">"$yPos"</span> <span class="org-sh-escaped-newline">\</span>
                -fn $<span class="org-variable-name">font</span> <span class="org-sh-escaped-newline">\</span>
                -e $<span class="org-variable-name">eventActions</span>

</pre>
</div>
</div>
</div>
