ws.org
* src/MyScratchpads
  :PROPERTIES:
  :header-args:  :tangle "~/.config/xmonad/src/MyScratchpads.hs"
  :END:

  [[https://hackage.haskell.org/package/xmonad-contrib-0.16/docs/XMonad-Util-NamedScratchpad.html][XMonad.Util.NamedScratchpad]] --

  *Modules needed:*

  #+begin_src haskell -n
    module MyScratchpads
    (myScratchPads)
    where

    import XMonad
    import Options
    import XMonad.Util.NamedScratchpad
    import qualified XMonad.StackSet as W
  #+end_src

  #+begin_src haskell -n
    ---------------------------------------------------------------------------
    -- SCRATCHPADS                                                           --
    ---------------------------------------------------------------------------
    myScratchPads :: [NamedScratchpad]
    myScratchPads = [ NS "scratchpad" spawnTerm findTerm manageTerm
                    , NS "myPavu" spawnPavu findPavu managePavu
                    , NS "myMusic" spawnMocp findMocp manageMocp
                    , NS "myWhatsApp" spawnWhatsApp findWhatsApp manageWhatsApp
                    , NS "myProtonmail" spawnProtonmail findProtonmail manageProtonmail
                    ]
      where
        spawnTerm  = myTerminal ++ " --class scratchPad"
        findTerm   = resource =? "scratchPad"
        manageTerm = customFloating $ W.RationalRect l t w h
                   where
                     h = 0.6
                     w = 0.9
                     t = 1 - h     -- bottom edge
                     l = (1 - w)/2 -- centered left/right
        spawnPavu  = myAudiocontrol ++ " --class myPavu"
        findPavu   = resource =? "pavucontrol" --TODO how to catch second field?
        managePavu = customFloating $ W.RationalRect l t w h
                   where
                     h = 0.7
                     w = 0.7
                     t = (1 - h)/2 -- centered top/bottom
                     l = (1 - w)/2 -- centered left/right
        spawnMocp  = "alacritty --class myMusic -e ncmpcpp"
        findMocp   = resource =? "myMusic"
        manageMocp = customFloating $ W.RationalRect l t w h
                   where
                     h = 0.9
                     w = 0.9
                     t = 0.95 -h
                     l = 0.95 -w
        spawnWhatsApp  = "chromium --app=https://web.whatsapp.com/"
        findWhatsApp   = appName =? "web.whatsapp.com"
        manageWhatsApp = customFloating $ W.RationalRect l t w h
                   where
                     h = 0.9
                     w = 0.9
                     t = 0.95 -h
                     l = 0.95 -w
        spawnProtonmail  = "chromium --app=https://mail.protonmail.com/"
        findProtonmail   = appName =? "mail.protonmail.com"
        manageProtonmail = customFloating $ W.RationalRect l t w h
                   where
                     h = 0.9
                     w = 0.9
                     t = 0.95 -h
                     l = 0.95 -w
  #+end_src
