docs/ws.html
<div id="outline-container-orgee4ef16" class="outline-2">
<h2 id="orgee4ef16">src/MyScratchpads</h2>
<div class="outline-text-2" id="text-orgee4ef16">
<p>
<a href="https://hackage.haskell.org/package/xmonad-contrib-0.16/docs/XMonad-Util-NamedScratchpad.html">XMonad.Util.NamedScratchpad</a> &#x2013;
</p>

<p>
<b>Modules needed:</b>
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span class="linenr">1: </span>    <span class="org-haskell-keyword">module</span> <span class="org-haskell-constructor">MyScratchpads</span>
<span class="linenr">2: </span>    (myScratchPads)
<span class="linenr">3: </span>    <span class="org-haskell-keyword">where</span>
<span class="linenr">4: </span>
<span class="linenr">5: </span>    <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">XMonad</span>
<span class="linenr">6: </span>    <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Options</span>
<span class="linenr">7: </span>    <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">XMonad.Util.NamedScratchpad</span>
<span class="linenr">8: </span>    <span class="org-haskell-keyword">import</span> <span class="org-haskell-keyword">qualified</span> <span class="org-haskell-constructor">XMonad.StackSet</span> <span class="org-haskell-keyword">as</span> <span class="org-haskell-constructor">W</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-haskell"><span class="linenr"> 1: </span>    <span class="org-comment-delimiter">--</span><span class="org-comment">-------------------------------------------------------------------------</span>
<span class="linenr"> 2: </span>    <span class="org-comment-delimiter">-- </span><span class="org-comment">SCRATCHPADS                                                           --</span>
<span class="linenr"> 3: </span>    <span class="org-comment-delimiter">--</span><span class="org-comment">-------------------------------------------------------------------------</span>
<span class="linenr"> 4: </span>    myScratchPads <span class="org-haskell-operator">::</span> [<span class="org-haskell-type">NamedScratchpad</span>]
<span class="linenr"> 5: </span>    myScratchPads <span class="org-haskell-operator">=</span> [ <span class="org-haskell-constructor">NS</span> <span class="org-string">"scratchpad"</span> spawnTerm findTerm manageTerm
<span class="linenr"> 6: </span>                    , <span class="org-haskell-constructor">NS</span> <span class="org-string">"myPavu"</span> spawnPavu findPavu managePavu
<span class="linenr"> 7: </span>                    , <span class="org-haskell-constructor">NS</span> <span class="org-string">"myMusic"</span> spawnMocp findMocp manageMocp
<span class="linenr"> 8: </span>                    , <span class="org-haskell-constructor">NS</span> <span class="org-string">"myWhatsApp"</span> spawnWhatsApp findWhatsApp manageWhatsApp
<span class="linenr"> 9: </span>                    , <span class="org-haskell-constructor">NS</span> <span class="org-string">"myProtonmail"</span> spawnProtonmail findProtonmail manageProtonmail
<span class="linenr">10: </span>                    ]
<span class="linenr">11: </span>      <span class="org-haskell-keyword">where</span>
<span class="linenr">12: </span>        spawnTerm  <span class="org-haskell-operator">=</span> myTerminal <span class="org-haskell-operator">++</span> <span class="org-string">" --class scratchPad"</span>
<span class="linenr">13: </span>        findTerm   <span class="org-haskell-operator">=</span> resource <span class="org-haskell-operator">=?</span> <span class="org-string">"scratchPad"</span>
<span class="linenr">14: </span>        manageTerm <span class="org-haskell-operator">=</span> customFloating <span class="org-haskell-operator">$</span> <span class="org-haskell-constructor">W.RationalRect</span> l t w h
<span class="linenr">15: </span>                   <span class="org-haskell-keyword">where</span>
<span class="linenr">16: </span>                     h <span class="org-haskell-operator">=</span> 0.6
<span class="linenr">17: </span>                     w <span class="org-haskell-operator">=</span> 0.9
<span class="linenr">18: </span>                     t <span class="org-haskell-operator">=</span> 1 <span class="org-haskell-operator">-</span> h     <span class="org-comment-delimiter">-- </span><span class="org-comment">bottom edge</span>
<span class="linenr">19: </span>                     l <span class="org-haskell-operator">=</span> (1 <span class="org-haskell-operator">-</span> w)<span class="org-haskell-operator">/</span>2 <span class="org-comment-delimiter">-- </span><span class="org-comment">centered left/right</span>
<span class="linenr">20: </span>        spawnPavu  <span class="org-haskell-operator">=</span> myAudiocontrol <span class="org-haskell-operator">++</span> <span class="org-string">" --class myPavu"</span>
<span class="linenr">21: </span>        findPavu   <span class="org-haskell-operator">=</span> resource <span class="org-haskell-operator">=?</span> <span class="org-string">"pavucontrol"</span> <span class="org-comment-delimiter">--</span><span class="org-comment">TODO how to catch second field?</span>
<span class="linenr">22: </span>        managePavu <span class="org-haskell-operator">=</span> customFloating <span class="org-haskell-operator">$</span> <span class="org-haskell-constructor">W.RationalRect</span> l t w h
<span class="linenr">23: </span>                   <span class="org-haskell-keyword">where</span>
<span class="linenr">24: </span>                     h <span class="org-haskell-operator">=</span> 0.7
<span class="linenr">25: </span>                     w <span class="org-haskell-operator">=</span> 0.7
<span class="linenr">26: </span>                     t <span class="org-haskell-operator">=</span> (1 <span class="org-haskell-operator">-</span> h)<span class="org-haskell-operator">/</span>2 <span class="org-comment-delimiter">-- </span><span class="org-comment">centered top/bottom</span>
<span class="linenr">27: </span>                     l <span class="org-haskell-operator">=</span> (1 <span class="org-haskell-operator">-</span> w)<span class="org-haskell-operator">/</span>2 <span class="org-comment-delimiter">-- </span><span class="org-comment">centered left/right</span>
<span class="linenr">28: </span>        spawnMocp  <span class="org-haskell-operator">=</span> <span class="org-string">"alacritty --class myMusic -e ncmpcpp"</span>
<span class="linenr">29: </span>        findMocp   <span class="org-haskell-operator">=</span> resource <span class="org-haskell-operator">=?</span> <span class="org-string">"myMusic"</span>
<span class="linenr">30: </span>        manageMocp <span class="org-haskell-operator">=</span> customFloating <span class="org-haskell-operator">$</span> <span class="org-haskell-constructor">W.RationalRect</span> l t w h
<span class="linenr">31: </span>                   <span class="org-haskell-keyword">where</span>
<span class="linenr">32: </span>                     h <span class="org-haskell-operator">=</span> 0.9
<span class="linenr">33: </span>                     w <span class="org-haskell-operator">=</span> 0.9
<span class="linenr">34: </span>                     t <span class="org-haskell-operator">=</span> 0.95 <span class="org-haskell-operator">-</span>h
<span class="linenr">35: </span>                     l <span class="org-haskell-operator">=</span> 0.95 <span class="org-haskell-operator">-</span>w
<span class="linenr">36: </span>        spawnWhatsApp  <span class="org-haskell-operator">=</span> <span class="org-string">"chromium --app=https://web.whatsapp.com/"</span>
<span class="linenr">37: </span>        findWhatsApp   <span class="org-haskell-operator">=</span> appName <span class="org-haskell-operator">=?</span> <span class="org-string">"web.whatsapp.com"</span>
<span class="linenr">38: </span>        manageWhatsApp <span class="org-haskell-operator">=</span> customFloating <span class="org-haskell-operator">$</span> <span class="org-haskell-constructor">W.RationalRect</span> l t w h
<span class="linenr">39: </span>                   <span class="org-haskell-keyword">where</span>
<span class="linenr">40: </span>                     h <span class="org-haskell-operator">=</span> 0.9
<span class="linenr">41: </span>                     w <span class="org-haskell-operator">=</span> 0.9
<span class="linenr">42: </span>                     t <span class="org-haskell-operator">=</span> 0.95 <span class="org-haskell-operator">-</span>h
<span class="linenr">43: </span>                     l <span class="org-haskell-operator">=</span> 0.95 <span class="org-haskell-operator">-</span>w
<span class="linenr">44: </span>        spawnProtonmail  <span class="org-haskell-operator">=</span> <span class="org-string">"chromium --app=https://mail.protonmail.com/"</span>
<span class="linenr">45: </span>        findProtonmail   <span class="org-haskell-operator">=</span> appName <span class="org-haskell-operator">=?</span> <span class="org-string">"mail.protonmail.com"</span>
<span class="linenr">46: </span>        manageProtonmail <span class="org-haskell-operator">=</span> customFloating <span class="org-haskell-operator">$</span> <span class="org-haskell-constructor">W.RationalRect</span> l t w h
<span class="linenr">47: </span>                   <span class="org-haskell-keyword">where</span>
<span class="linenr">48: </span>                     h <span class="org-haskell-operator">=</span> 0.9
<span class="linenr">49: </span>                     w <span class="org-haskell-operator">=</span> 0.9
<span class="linenr">50: </span>                     t <span class="org-haskell-operator">=</span> 0.95 <span class="org-haskell-operator">-</span>h
<span class="linenr">51: </span>                     l <span class="org-haskell-operator">=</span> 0.95 <span class="org-haskell-operator">-</span>w
</pre>
</div>
</div>
</div>
