ws.org
* src/MyWorkspaces
  :PROPERTIES:
  :header-args:  :tangle "~/.config/xmonad/src/MyWorkspaces.hs"
  :END:

  [[https://hackage.haskell.org/package/xmonad-contrib-0.16/docs/XMonad-Actions-DynamicProjects.html][XMonad.Actions.DynamicProjects]] -- (From the documentation:) Imbues workspaces with additional features so they can be treated as individual project areas.

  Instead of using generic workspace names such as 3 or work, DynamicProjects allows you to dedicate workspaces to specific projects and then switch between projects easily.

  A project is made up of a name, working directory, and a start-up hook. When you switch to a workspace, DynamicProjects changes the working directory to the one configured for the matching project. If the workspace doesn't have any windows, the project's start-up hook is executed. This allows you to launch applications or further configure the workspace/project.

  When using the switchProjectPrompt function, workspaces are created as needed. This means you can create new project spaces (and therefore workspaces) on the fly. (These dynamic projects are not preserved across restarts.)

  *Modules needed:*

  #+Caption: Workspace modules
  #+begin_src haskell -n
  module MyWorkspaces
    ( projects,
      names
    )
  where

  import XMonad
  import XMonad.Actions.DynamicProjects
  import XMonad.Layout.LayoutCombinators (JumpToLayout (..))
  import XMonad.Util.SpawnOnce

  import Options                                                -- local settings
  #+end_src

  To set up a new =project=, use the following template:

  #+Caption: Project template
  #+begin_example haskell
      { projectName = "browsers",              (1)
        projectDirectory = "~/Downloads",      (2)
        projectStartHook = Just $ do
          sendMessage (JumpToLayout "Tall")    (3)
          spawn "qutebrowser"                  (4)
      },
  #+end_example

  1. =Project name= this field is used to switch to the workspace, and in the notification area (if not overwritten with an icon)
  2. =Project directory=
  3. Default layout
  4. Using /spawn/ start default applications in /that/ workspace. Terminals will open by default in the directory set in (2)

  TODO class needed?

  **Key bindings** - [[Project keys][Project keys]]

  =Super+<number>= is set to the first ten projects, the others can be reached by =Super-w=.

  #+Caption: My projects
  #+begin_src haskell -n
  projects :: [Project]
  projects =
    [ Project
      { projectName = "browsers",
        projectDirectory = "~/Downloads",
        projectStartHook = Just $ do
          sendMessage (JumpToLayout "Tall")
          spawn "qutebrowser"
      },
      Project
      { projectName = "emacs",
        projectDirectory = "~/",
        projectStartHook = Just $ do
          sendMessage (JumpToLayout "Tall")
          spawn "emacsclient -c"
      },
      Project
      { projectName = "xmonad",
        projectDirectory = "~/Projects/WS",
        projectStartHook = Just $ do
          sendMessage (JumpToLayout "Tall")
          spawn "alacritty"
      },
      Project
      { projectName = "term",
        projectDirectory = "~/",
        projectStartHook = Just $ do
          sendMessage (JumpToLayout "Tall")
          spawn "alacritty"
      },
      Project
      { projectName = "scratch",
        projectDirectory = "~/Desktop",
        projectStartHook = Nothing
      },
      Project
      { projectName = "chat",
        projectDirectory = "~/Downloads",
        projectStartHook = Just $ do
          sendMessage (JumpToLayout "Tall")
          spawn "alacritty -e tmux attach"
          spawn "alacritty"
      },
      Project
      { projectName = "docs",
        projectDirectory = "~/Documents/",
        projectStartHook = Just $ do
          sendMessage (JumpToLayout "Tall")
          spawn "alacritty"
      },
      Project
      { projectName = "tv",
        projectDirectory = "~/Video",
        projectStartHook = Just $ do
          sendMessage (JumpToLayout "Tabbed")
          -- spawn "alaritty -e ranger"
          spawn (myTerminal ++ " -t tv2 --class tv -e ranger")
      }
      Project
      { projectName = "zoom",
        projectDirectory = "~/Downloads",
        projectStartHook = Just $ do
          sendMessage (JumpToLayout "2/3")
          spawn "zoom"
          spawn (myTerminal ++ " --class zoom")
      }
    ]

  #+end_src

  #+Caption: Workspace helper scripts
  #+begin_src haskell -n
  -- | Names of my workspaces.
  names :: [WorkspaceId]
  names = map projectName projects

  -- | open terminal in current project environment (unsafeSpawn)
  projRunInTerm :: String -> String -> X ()
  projRunInTerm options command = asks (terminal . config) >>= \t -> unsafeSpawn $ t ++ " " ++ " --class " ++ activateProject  ++ options ++ " -e " ++ command
  #+end_src

