docs/ws.html
<div id="outline-container-org0047c41" class="outline-2">
<h2 id="org0047c41">src/MyWorkspaces</h2>
<div class="outline-text-2" id="text-org0047c41">
<p>
<a href="https://hackage.haskell.org/package/xmonad-contrib-0.16/docs/XMonad-Actions-DynamicProjects.html">XMonad.Actions.DynamicProjects</a> &#x2013; (From the documentation:) Imbues workspaces with additional features so they can be treated as individual project areas.
</p>

<p>
Instead of using generic workspace names such as 3 or work, DynamicProjects allows you to dedicate workspaces to specific projects and then switch between projects easily.
</p>

<p>
A project is made up of a name, working directory, and a start-up hook. When you switch to a workspace, DynamicProjects changes the working directory to the one configured for the matching project. If the workspace doesn't have any windows, the project's start-up hook is executed. This allows you to launch applications or further configure the workspace/project.
</p>

<p>
When using the switchProjectPrompt function, workspaces are created as needed. This means you can create new project spaces (and therefore workspaces) on the fly. (These dynamic projects are not preserved across restarts.)
</p>

<p>
<b>Modules needed:</b>
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 16: </span>Workspace modules</label><pre class="src src-haskell"><span class="linenr"> 1: </span>  <span class="org-haskell-keyword">module</span> <span class="org-haskell-constructor">MyWorkspaces</span>
<span class="linenr"> 2: </span>    ( projects,
<span class="linenr"> 3: </span>      names
<span class="linenr"> 4: </span>    )
<span class="linenr"> 5: </span>  <span class="org-haskell-keyword">where</span>
<span class="linenr"> 6: </span>
<span class="linenr"> 7: </span>  <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">XMonad</span>
<span class="linenr"> 8: </span>  <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">XMonad.Actions.DynamicProjects</span>
<span class="linenr"> 9: </span>  <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">XMonad.Layout.LayoutCombinators</span> (<span class="org-haskell-constructor">JumpToLayout</span> (<span class="org-haskell-operator">..</span>))
<span class="linenr">10: </span>  <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">XMonad.Util.SpawnOnce</span>
<span class="linenr">11: </span>
<span class="linenr">12: </span>  <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Options</span>                                                <span class="org-comment-delimiter">-- </span><span class="org-comment">local settings</span>
</pre>
</div>

<p>
To set up a new <code>project</code>, use the following template:
</p>

<pre class="example" id="orge76aab6">
      { projectName = "browsers",              (1)
        projectDirectory = "~/Downloads",      (2)
        projectStartHook = Just $ do
          sendMessage (JumpToLayout "Tall")    (3)
          spawn "qutebrowser"                  (4)
      },
</pre>

<ol class="org-ol">
<li><code>Project name</code> this field is used to switch to the workspace, and in the notification area (if not overwritten with an icon)</li>
<li><code>Project directory</code></li>
<li>Default layout</li>
<li>Using <i>spawn</i> start default applications in <i>that</i> workspace. Terminals will open by default in the directory set in (2)</li>
</ol>

<p>
TODO class needed?
</p>

<p>
<b><b>Key bindings</b></b> - <a href="#org254530f">Project keys</a>
</p>

<p>
<code>Super+&lt;number&gt;</code> is set to the first ten projects, the others can be reached by <code>Super-w</code>.
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 17: </span>My projects</label><pre class="src src-haskell"><span class="linenr"> 1: </span>  projects <span class="org-haskell-operator">::</span> [<span class="org-haskell-type">Project</span>]
<span class="linenr"> 2: </span>  projects <span class="org-haskell-operator">=</span>
<span class="linenr"> 3: </span>    [ <span class="org-haskell-constructor">Project</span>
<span class="linenr"> 4: </span>      { projectName <span class="org-haskell-operator">=</span> <span class="org-string">"browsers"</span>,
<span class="linenr"> 5: </span>        projectDirectory <span class="org-haskell-operator">=</span> <span class="org-string">"~/Downloads"</span>,
<span class="linenr"> 6: </span>        projectStartHook <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Just</span> <span class="org-haskell-operator">$</span> <span class="org-haskell-keyword">do</span>
<span class="linenr"> 7: </span>          sendMessage (<span class="org-haskell-constructor">JumpToLayout</span> <span class="org-string">"Tall"</span>)
<span class="linenr"> 8: </span>          spawn <span class="org-string">"qutebrowser"</span>
<span class="linenr"> 9: </span>      },
<span class="linenr">10: </span>      <span class="org-haskell-constructor">Project</span>
<span class="linenr">11: </span>      { projectName <span class="org-haskell-operator">=</span> <span class="org-string">"emacs"</span>,
<span class="linenr">12: </span>        projectDirectory <span class="org-haskell-operator">=</span> <span class="org-string">"~/"</span>,
<span class="linenr">13: </span>        projectStartHook <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Just</span> <span class="org-haskell-operator">$</span> <span class="org-haskell-keyword">do</span>
<span class="linenr">14: </span>          sendMessage (<span class="org-haskell-constructor">JumpToLayout</span> <span class="org-string">"Tall"</span>)
<span class="linenr">15: </span>          spawn <span class="org-string">"emacsclient -c"</span>
<span class="linenr">16: </span>      },
<span class="linenr">17: </span>      <span class="org-haskell-constructor">Project</span>
<span class="linenr">18: </span>      { projectName <span class="org-haskell-operator">=</span> <span class="org-string">"xmonad"</span>,
<span class="linenr">19: </span>        projectDirectory <span class="org-haskell-operator">=</span> <span class="org-string">"~/Projects/WS"</span>,
<span class="linenr">20: </span>        projectStartHook <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Just</span> <span class="org-haskell-operator">$</span> <span class="org-haskell-keyword">do</span>
<span class="linenr">21: </span>          sendMessage (<span class="org-haskell-constructor">JumpToLayout</span> <span class="org-string">"Tall"</span>)
<span class="linenr">22: </span>          spawn <span class="org-string">"alacritty"</span>
<span class="linenr">23: </span>      },
<span class="linenr">24: </span>      <span class="org-haskell-constructor">Project</span>
<span class="linenr">25: </span>      { projectName <span class="org-haskell-operator">=</span> <span class="org-string">"term"</span>,
<span class="linenr">26: </span>        projectDirectory <span class="org-haskell-operator">=</span> <span class="org-string">"~/"</span>,
<span class="linenr">27: </span>        projectStartHook <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Just</span> <span class="org-haskell-operator">$</span> <span class="org-haskell-keyword">do</span>
<span class="linenr">28: </span>          sendMessage (<span class="org-haskell-constructor">JumpToLayout</span> <span class="org-string">"Tall"</span>)
<span class="linenr">29: </span>          spawn <span class="org-string">"alacritty"</span>
<span class="linenr">30: </span>      },
<span class="linenr">31: </span>      <span class="org-haskell-constructor">Project</span>
<span class="linenr">32: </span>      { projectName <span class="org-haskell-operator">=</span> <span class="org-string">"scratch"</span>,
<span class="linenr">33: </span>        projectDirectory <span class="org-haskell-operator">=</span> <span class="org-string">"~/Desktop"</span>,
<span class="linenr">34: </span>        projectStartHook <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Nothing</span>
<span class="linenr">35: </span>      },
<span class="linenr">36: </span>      <span class="org-haskell-constructor">Project</span>
<span class="linenr">37: </span>      { projectName <span class="org-haskell-operator">=</span> <span class="org-string">"chat"</span>,
<span class="linenr">38: </span>        projectDirectory <span class="org-haskell-operator">=</span> <span class="org-string">"~/Downloads"</span>,
<span class="linenr">39: </span>        projectStartHook <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Just</span> <span class="org-haskell-operator">$</span> <span class="org-haskell-keyword">do</span>
<span class="linenr">40: </span>          sendMessage (<span class="org-haskell-constructor">JumpToLayout</span> <span class="org-string">"Tall"</span>)
<span class="linenr">41: </span>          spawn <span class="org-string">"alacritty -e tmux attach"</span>
<span class="linenr">42: </span>          spawn <span class="org-string">"alacritty"</span>
<span class="linenr">43: </span>      },
<span class="linenr">44: </span>      <span class="org-haskell-constructor">Project</span>
<span class="linenr">45: </span>      { projectName <span class="org-haskell-operator">=</span> <span class="org-string">"docs"</span>,
<span class="linenr">46: </span>        projectDirectory <span class="org-haskell-operator">=</span> <span class="org-string">"~/Documents/"</span>,
<span class="linenr">47: </span>        projectStartHook <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Just</span> <span class="org-haskell-operator">$</span> <span class="org-haskell-keyword">do</span>
<span class="linenr">48: </span>          sendMessage (<span class="org-haskell-constructor">JumpToLayout</span> <span class="org-string">"Tall"</span>)
<span class="linenr">49: </span>          spawn <span class="org-string">"alacritty"</span>
<span class="linenr">50: </span>      },
<span class="linenr">51: </span>      <span class="org-haskell-constructor">Project</span>
<span class="linenr">52: </span>      { projectName <span class="org-haskell-operator">=</span> <span class="org-string">"tv"</span>,
<span class="linenr">53: </span>        projectDirectory <span class="org-haskell-operator">=</span> <span class="org-string">"~/Video"</span>,
<span class="linenr">54: </span>        projectStartHook <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Just</span> <span class="org-haskell-operator">$</span> <span class="org-haskell-keyword">do</span>
<span class="linenr">55: </span>          sendMessage (<span class="org-haskell-constructor">JumpToLayout</span> <span class="org-string">"Tabbed"</span>)
<span class="linenr">56: </span>          <span class="org-comment-delimiter">-- </span><span class="org-comment">spawn "alaritty -e ranger"</span>
<span class="linenr">57: </span>          spawn (myTerminal <span class="org-haskell-operator">++</span> <span class="org-string">" -t tv2 --class tv -e ranger"</span>)
<span class="linenr">58: </span>      }
<span class="linenr">59: </span>      <span class="org-haskell-constructor">Project</span>
<span class="linenr">60: </span>      { projectName <span class="org-haskell-operator">=</span> <span class="org-string">"zoom"</span>,
<span class="linenr">61: </span>        projectDirectory <span class="org-haskell-operator">=</span> <span class="org-string">"~/Downloads"</span>,
<span class="linenr">62: </span>        projectStartHook <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Just</span> <span class="org-haskell-operator">$</span> <span class="org-haskell-keyword">do</span>
<span class="linenr">63: </span>          sendMessage (<span class="org-haskell-constructor">JumpToLayout</span> <span class="org-string">"2/3"</span>)
<span class="linenr">64: </span>          spawn <span class="org-string">"zoom"</span>
<span class="linenr">65: </span>          spawn (myTerminal <span class="org-haskell-operator">++</span> <span class="org-string">" --class zoom"</span>)
<span class="linenr">66: </span>      }
<span class="linenr">67: </span>    ]
<span class="linenr">68: </span>
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 18: </span>Workspace helper scripts</label><pre class="src src-haskell"><span class="linenr">1: </span>  <span class="org-doc">-- | Names of my workspaces.</span>
<span class="linenr">2: </span>  names <span class="org-haskell-operator">::</span> [<span class="org-haskell-type">WorkspaceId</span>]
<span class="linenr">3: </span>  names <span class="org-haskell-operator">=</span> map projectName projects
<span class="linenr">4: </span>
<span class="linenr">5: </span>  <span class="org-doc">-- | open terminal in current project environment (unsafeSpawn)</span>
<span class="linenr">6: </span>  projRunInTerm <span class="org-haskell-operator">::</span> <span class="org-haskell-type">String</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">String</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">X</span> <span class="org-haskell-constructor">()</span>
<span class="linenr">7: </span>  projRunInTerm options command <span class="org-haskell-operator">=</span> asks (terminal <span class="org-haskell-operator">.</span> config) <span class="org-haskell-operator">&gt;&gt;=</span> <span class="org-haskell-operator">\</span>t <span class="org-haskell-operator">-&gt;</span> unsafeSpawn <span class="org-haskell-operator">$</span> t <span class="org-haskell-operator">++</span> <span class="org-string">" "</span> <span class="org-haskell-operator">++</span> <span class="org-string">" --class "</span> <span class="org-haskell-operator">++</span> activateProject  <span class="org-haskell-operator">++</span> options <span class="org-haskell-operator">++</span> <span class="org-string">" -e "</span> <span class="org-haskell-operator">++</span> command
</pre>
</div>
</div>
</div>
