ws.org
* External scripts
** src/autostartS
   Still haven't figured out what's best. Atm I use .xinitrc for most of this.

   #+begin_src shell :shebang "#!/bin/sh" :tangle-mode (identity #o555) :tangle "~/.config/xmonad/src/autostartS"
     echo "src/autostartS started - $(date)" >> ~/tmp/xmonad.log
     wallpaper

     if [ -z "$(pgrep unclutter)" ] ; then
         unclutter --timeout 4 --jitter 10 --ignore-scrolling -b
     fi

     if [ -z "$(pgrep dunst)" ] ; then
         dunst &
     fi

     if [ -z "$(pgrep picom)" ] ; then
         picom &
     fi

     if [ -z "$(pgrep redshift)" ] ; then
         redshift &
     fi

     # Daemons
     #emacs --daemon & Started with systemd
     #udiskie &
     #nm-applet --indicator &
     #lxqt-powermanagement &

     # Settings
     xrdb -merge "$HOME/.config/X11/Xresources" &
     #xmodmap -e 'add mod3 = Menu'
     #xmodmap -e "keycode 135 = Hyper_R"
     #xmodmap -e "add mod3 = Hyper_R"
     #xmodmap -e "keycode any = Menu" # this is needed for xcape
     #xcape -e "Hyper_R=Menu" # for single key press on menu key
     setxkbmap -model pc105 -layout us,ru -variant ,phonetic -option grp:shifts_toggle -option ctrl:nocaps # -option compose:menu
     xmodmap ~/.config/X11/Xmodmap

     xsetroot -grey -cursor_name left_ptr &

   #+end_src

   #+RESULTS:

** WM scripts
*** Xprop wrapper - xmonpropS

    Source: [[https://wiki.haskell.org/Xmonad/Frequently_asked_questions#I_need_to_find_the_class_title_or_some_other_X_property_of_my_program][Haskell wiki]]

     #+begin_src shell :shebang "#!/bin/sh" :tangle-mode (identity #o555) :tangle "~/.local/bin/xmonPropS"

       exec xprop -notype \
        -f WM_NAME        8s ':\n  title =\? $0\n' \
        -f WM_CLASS       8s ':\n  appName =\? $0\n  className =\? $1\n' \
        -f WM_WINDOW_ROLE 8s ':\n  stringProperty "WM_WINDOW_ROLE" =\? $0\n' \
        WM_NAME WM_CLASS WM_WINDOW_ROLE \
        ${1+"$@"}

    #+end_src

*** Keyboard indicator Mobar
    #+begin_src  shell :shebang "#!/bin/sh" :tangle-mode (identity #o555) :tangle "~/.local/bin/myKbS"
      stdlayout=us  # standard layout takes "default" color
      stdname=en-us # arbitrary, descriptive only

      base03=#002b36
      base02=#073642
      base01=#586e75
      base00=#657b83
      base0=#839496
      base1=#93a1a1
      base2=#eee8d5
      base3=#fdf6e3
      yellow=#b58900
      orange=#cb4b16
      red=#dc322f
      magenta=#d33682
      violet=#6c71c4
      blue=#268bd2
      cyan=#2aa198
      green=#859900

      layout="$(~/.local/bin/xkblayout-state print "%s")"

      case $layout in
          ${stdlayout}) color=$green; icon=" "; name=$stdname ;; # f11c fa-keyboard-o
          ,*) color=$magenta; icon=" "; name="russian" ;; # f11c fa-keyboard-o
      esac

      echo "<fc=$color><fn=1>$icon</fn> ${name}</fc>"
    #+end_src

