docs/ws.html

<div id="outline-container-orgdf0ba2c" class="outline-2">
<h2 id="orgdf0ba2c">External scripts</h2>
<div class="outline-text-2" id="text-orgdf0ba2c">
</div>
<div id="outline-container-org0befd69" class="outline-3">
<h3 id="org0befd69">src/autostartS</h3>
<div class="outline-text-3" id="text-org0befd69">
<p>
Still haven't figured out what's best. Atm I use .xinitrc for most of this.
</p>

<div class="org-src-container">
<pre class="src src-shell">     <span class="org-builtin">echo</span> <span class="org-string">"src/autostartS started - $(date)"</span> &gt;&gt; ~/tmp/xmonad.log
     wallpaper

     <span class="org-keyword">if</span> [ -z <span class="org-string">"$(pgrep unclutter)"</span> ] ; <span class="org-keyword">then</span>
         unclutter --timeout 4 --jitter 10 --ignore-scrolling -b
     <span class="org-keyword">fi</span>

     <span class="org-keyword">if</span> [ -z <span class="org-string">"$(pgrep dunst)"</span> ] ; <span class="org-keyword">then</span>
         dunst &amp;
     <span class="org-keyword">fi</span>

     <span class="org-keyword">if</span> [ -z <span class="org-string">"$(pgrep picom)"</span> ] ; <span class="org-keyword">then</span>
         picom &amp;
     <span class="org-keyword">fi</span>

     <span class="org-keyword">if</span> [ -z <span class="org-string">"$(pgrep redshift)"</span> ] ; <span class="org-keyword">then</span>
         redshift &amp;
     <span class="org-keyword">fi</span>

     <span class="org-comment-delimiter"># </span><span class="org-comment">Daemons</span>
     <span class="org-comment-delimiter">#</span><span class="org-comment">emacs --daemon &amp; Started with systemd</span>
     <span class="org-comment-delimiter">#</span><span class="org-comment">udiskie &amp;</span>
     <span class="org-comment-delimiter">#</span><span class="org-comment">nm-applet --indicator &amp;</span>
     <span class="org-comment-delimiter">#</span><span class="org-comment">lxqt-powermanagement &amp;</span>

     <span class="org-comment-delimiter"># </span><span class="org-comment">Settings</span>
     xrdb -merge <span class="org-string">"$HOME/.config/X11/Xresources"</span> &amp;
     <span class="org-comment-delimiter">#</span><span class="org-comment">xmodmap -e 'add mod3 = Menu'</span>
     <span class="org-comment-delimiter">#</span><span class="org-comment">xmodmap -e "keycode 135 = Hyper_R"</span>
     <span class="org-comment-delimiter">#</span><span class="org-comment">xmodmap -e "add mod3 = Hyper_R"</span>
     <span class="org-comment-delimiter">#</span><span class="org-comment">xmodmap -e "keycode any = Menu" # this is needed for xcape</span>
     <span class="org-comment-delimiter">#</span><span class="org-comment">xcape -e "Hyper_R=Menu" # for single key press on menu key</span>
     setxkbmap -model pc105 -layout us,ru -variant ,phonetic -option grp:shifts_toggle -option ctrl:nocaps <span class="org-comment-delimiter"># </span><span class="org-comment">-option compose:menu</span>
     xmodmap ~/.config/X11/Xmodmap

     xsetroot -grey -cursor_name left_ptr &amp;

</pre>
</div>
</div>
</div>

<div id="outline-container-org111559c" class="outline-3">
<h3 id="org111559c">WM scripts</h3>
<div class="outline-text-3" id="text-org111559c">
</div>
<div id="outline-container-orgc7ae9e0" class="outline-4">
<h4 id="orgc7ae9e0">Xprop wrapper - xmonpropS</h4>
<div class="outline-text-4" id="text-orgc7ae9e0">
<p>
Source: <a href="https://wiki.haskell.org/Xmonad/Frequently_asked_questions#I_need_to_find_the_class_title_or_some_other_X_property_of_my_program">Haskell wiki</a>
</p>

<div class="org-src-container">
<pre class="src src-shell">
       <span class="org-keyword">exec</span> xprop -notype <span class="org-sh-escaped-newline">\</span>
        -f WM_NAME        8s <span class="org-string">':\n  title =\? $0\n'</span> <span class="org-sh-escaped-newline">\</span>
        -f WM_CLASS       8s <span class="org-string">':\n  appName =\? $0\n  className =\? $1\n'</span> <span class="org-sh-escaped-newline">\</span>
        -f WM_WINDOW_ROLE 8s <span class="org-string">':\n  stringProperty "WM_WINDOW_ROLE" =\? $0\n'</span> <span class="org-sh-escaped-newline">\</span>
        WM_NAME WM_CLASS WM_WINDOW_ROLE <span class="org-sh-escaped-newline">\</span>
        ${<span class="org-variable-name">1</span>+<span class="org-string">"$@"</span>}

</pre>
</div>
</div>
</div>

<div id="outline-container-orge40ebd6" class="outline-4">
<h4 id="orge40ebd6">Keyboard indicator Mobar</h4>
<div class="outline-text-4" id="text-orge40ebd6">
<div class="org-src-container">
<pre class="src src-shell">      <span class="org-variable-name">stdlayout</span>=us  <span class="org-comment-delimiter"># </span><span class="org-comment">standard layout takes "default" color</span>
      <span class="org-variable-name">stdname</span>=en-us <span class="org-comment-delimiter"># </span><span class="org-comment">arbitrary, descriptive only</span>

      <span class="org-variable-name">base03</span>=#002b36
      <span class="org-variable-name">base02</span>=#073642
      <span class="org-variable-name">base01</span>=#586e75
      <span class="org-variable-name">base00</span>=#657b83
      <span class="org-variable-name">base0</span>=#839496
      <span class="org-variable-name">base1</span>=#93a1a1
      <span class="org-variable-name">base2</span>=#eee8d5
      <span class="org-variable-name">base3</span>=#fdf6e3
      <span class="org-variable-name">yellow</span>=#b58900
      <span class="org-variable-name">orange</span>=#cb4b16
      <span class="org-variable-name">red</span>=#dc322f
      <span class="org-variable-name">magenta</span>=#d33682
      <span class="org-variable-name">violet</span>=#6c71c4
      <span class="org-variable-name">blue</span>=#268bd2
      <span class="org-variable-name">cyan</span>=#2aa198
      <span class="org-variable-name">green</span>=#859900

      <span class="org-variable-name">layout</span>=<span class="org-string">"$(~/.local/bin/xkblayout-state print "%s")"</span>

      <span class="org-keyword">case</span> $<span class="org-variable-name">layout</span><span class="org-keyword"> in</span>
          ${<span class="org-variable-name">stdlayout</span>}) <span class="org-variable-name">color</span>=$<span class="org-variable-name">green</span>; <span class="org-variable-name">icon</span>=<span class="org-string">"&#61724; "</span>; <span class="org-variable-name">name</span>=$<span class="org-variable-name">stdname</span> ;; <span class="org-comment-delimiter"># </span><span class="org-comment">f11c fa-keyboard-o</span>
          *) <span class="org-variable-name">color</span>=$<span class="org-variable-name">magenta</span>; <span class="org-variable-name">icon</span>=<span class="org-string">"&#61724; "</span>; <span class="org-variable-name">name</span>=<span class="org-string">"russian"</span> ;; <span class="org-comment-delimiter"># </span><span class="org-comment">f11c fa-keyboard-o</span>
      <span class="org-keyword">esac</span>

      <span class="org-builtin">echo</span> <span class="org-string">"&lt;fc=$color&gt;&lt;fn=1&gt;$icon&lt;/fn&gt; ${name}&lt;/fc&gt;"</span>
</pre>
</div>
</div>
</div>
