docs/ws.html

<div id="outline-container-org5c50931" class="outline-4">
<h4 id="org5c50931">adjustVolumeS</h4>
<div class="outline-text-4" id="text-org5c50931">
<p>
Pulseaudio version, huge, see <code>adjustVolumeS help</code>.
</p>

<div class="org-src-container">
<pre class="src src-shell">
<span class="org-comment-delimiter">##################################################################</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">Polybar Pulseaudio Control                                     #</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">https://github.com/marioortizmanero/polybar-pulseaudio-control #</span>
<span class="org-comment-delimiter">##################################################################</span>
<span class="org-comment-delimiter">#</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">Broken by QWxlea</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">Defaults for configurable values, expected to be set by command-line arguments</span>
<span class="org-variable-name">msgId</span>=<span class="org-string">"991001"</span>
<span class="org-variable-name">AUTOSYNC</span>=<span class="org-string">"no"</span>
<span class="org-variable-name">COLOR_MUTED</span>=<span class="org-string">"%{F#6b6b6b}"</span>
<span class="org-variable-name">ICON_MUTED</span>=
<span class="org-variable-name">ICON_SINK</span>=
<span class="org-variable-name">NOTIFICATIONS</span>=<span class="org-string">"no"</span>
<span class="org-variable-name">OSD</span>=<span class="org-string">"yes"</span>
<span class="org-variable-name">SINK_NICKNAMES_PROP</span>=
<span class="org-variable-name">VOLUME_STEP</span>=2
<span class="org-variable-name">VOLUME_MAX</span>=130
<span class="org-comment-delimiter"># </span><span class="org-comment">shellcheck disable=SC2016</span>
<span class="org-variable-name">FORMAT</span>=<span class="org-string">'$VOL_ICON ${VOL_LEVEL}%  $ICON_SINK $SINK_NICKNAME'</span>
<span class="org-builtin">declare</span> -A SINK_NICKNAMES
<span class="org-builtin">declare</span> -a ICONS_VOLUME
<span class="org-builtin">declare</span> -a SINK_BLACKLIST

<span class="org-comment-delimiter"># </span><span class="org-comment">Environment &amp; global constants for the script</span>
<span class="org-variable-name">END_COLOR</span>=<span class="org-string">"%{F-}"</span>  <span class="org-comment-delimiter"># </span><span class="org-comment">For Polybar colors</span>
<span class="org-variable-name">LANGUAGE</span>=en_US  <span class="org-comment-delimiter"># </span><span class="org-comment">Some calls depend on English outputs of pactl</span>


<span class="org-comment-delimiter"># </span><span class="org-comment">Saves the currently default sink into a variable named `curSink`. It will</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">return an error code when pulseaudio isn't running.</span>
<span class="org-keyword">function</span> <span class="org-function-name">getCurSink</span>() {
    <span class="org-keyword">if</span> <span class="org-negation-char">!</span> pulseaudio --check; <span class="org-keyword">then return</span> 1; <span class="org-keyword">fi</span>
    <span class="org-variable-name">curSink</span>=$(pacmd list-sinks | awk <span class="org-string">'/\* index:/{print $3}'</span>)
}


<span class="org-comment-delimiter"># </span><span class="org-comment">Saves the sink passed by parameter's volume into a variable named `VOL_LEVEL`.</span>
<span class="org-keyword">function</span> <span class="org-function-name">getCurVol</span>() {
    <span class="org-variable-name">VOL_LEVEL</span>=$(pacmd list-sinks | grep -A 15 <span class="org-string">'index: '"$1"''</span> | grep <span class="org-string">'volume:'</span> | grep -E -v <span class="org-string">'base volume:'</span> | awk -F : <span class="org-string">'{print $3; exit}'</span> | grep -o -P <span class="org-string">'.{0,3}%'</span> | sed <span class="org-string">'s/.$//'</span> | tr -d <span class="org-string">' '</span>)
}


<span class="org-comment-delimiter"># </span><span class="org-comment">Saves the name of the sink passed by parameter into a variable named</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">`sinkName`.</span>
<span class="org-keyword">function</span> <span class="org-function-name">getSinkName</span>() {
    <span class="org-variable-name">sinkName</span>=$(pactl list sinks short | awk -v <span class="org-variable-name">sink</span>=<span class="org-string">"$1"</span> <span class="org-string">'{ if ($1 == sink) {print $2} }'</span>)
}


<span class="org-comment-delimiter"># </span><span class="org-comment">Saves the name to be displayed for the sink passed by parameter into a</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">variable called `SINK_NICKNAME`.</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">If a mapping for the sink name exists, that is used. Otherwise, the string</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">"Sink #&lt;index&gt;" is used.</span>
<span class="org-keyword">function</span> <span class="org-function-name">getNickname</span>() {
    getSinkName <span class="org-string">"$1"</span>
    <span class="org-builtin">unset</span> SINK_NICKNAME

    <span class="org-keyword">if</span> [ -n <span class="org-string">"$sinkName"</span> ] &amp;&amp; [ -n <span class="org-string">"${SINK_NICKNAMES[$sinkName]}"</span> ]; <span class="org-keyword">then</span>
        <span class="org-variable-name">SINK_NICKNAME</span>=<span class="org-string">"${SINK_NICKNAMES[$sinkName]}"</span>
    <span class="org-keyword">elif</span> [ -n <span class="org-string">"$sinkName"</span> ] &amp;&amp; [ -n <span class="org-string">"$SINK_NICKNAMES_PROP"</span> ]; <span class="org-keyword">then</span>
        getNicknameFromProp <span class="org-string">"$SINK_NICKNAMES_PROP"</span> <span class="org-string">"$sinkName"</span>
        <span class="org-comment-delimiter"># </span><span class="org-comment">Cache that result for next time</span>
        <span class="org-variable-name">SINK_NICKNAMES</span>[<span class="org-string">"$sinkName"</span>]=<span class="org-string">"$SINK_NICKNAME"</span>
    <span class="org-keyword">fi</span>

    <span class="org-keyword">if</span> [ -z <span class="org-string">"$SINK_NICKNAME"</span> ]; <span class="org-keyword">then</span>
        <span class="org-variable-name">SINK_NICKNAME</span>=<span class="org-string">"Sink #$1"</span>
    <span class="org-keyword">fi</span>
}

<span class="org-comment-delimiter"># </span><span class="org-comment">Gets sink nickname based on a given property.</span>
<span class="org-keyword">function</span> <span class="org-function-name">getNicknameFromProp</span>() {
    <span class="org-builtin">local</span> <span class="org-variable-name">nickname_prop</span>=<span class="org-string">"$1"</span>
    <span class="org-builtin">local</span> <span class="org-variable-name">for_name</span>=<span class="org-string">"$2"</span>

    <span class="org-variable-name">SINK_NICKNAME</span>=
    <span class="org-keyword">while </span><span class="org-builtin">read</span> -r property value; <span class="org-keyword">do</span>
        <span class="org-keyword">case</span> <span class="org-string">"$property"</span><span class="org-keyword"> in</span>
            name:)
                <span class="org-variable-name">sink_name</span>=<span class="org-string">"${value//[&lt;&gt;]/}"</span>
                <span class="org-builtin">unset</span> sink_desc
                ;;
            <span class="org-string">"$nickname_prop"</span>)
                <span class="org-keyword">if</span> [ <span class="org-string">"$sink_name"</span> != <span class="org-string">"$for_name"</span> ]; <span class="org-keyword">then</span>
                    <span class="org-keyword">continue</span>
                <span class="org-keyword">fi</span>
                <span class="org-variable-name">SINK_NICKNAME</span>=<span class="org-string">"${value:3:-1}"</span>
                <span class="org-keyword">break</span>
                ;;
        <span class="org-keyword">esac</span>
    <span class="org-keyword">done</span> &lt; &lt;(pacmd list-sinks)
}

<span class="org-comment-delimiter"># </span><span class="org-comment">Saves the status of the sink passed by parameter into a variable named</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">`isMuted`.</span>
<span class="org-keyword">function</span> <span class="org-function-name">getIsMuted</span>() {
    <span class="org-variable-name">isMuted</span>=$(pacmd list-sinks | grep -A 15 <span class="org-string">"index: $1"</span> | awk <span class="org-string">'/muted/ {print $2; exit}'</span>)
}


<span class="org-comment-delimiter"># </span><span class="org-comment">Saves all the sink inputs of the sink passed by parameter into a string</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">named `sinkInputs`.</span>
<span class="org-keyword">function</span> <span class="org-function-name">getSinkInputs</span>() {
    <span class="org-variable-name">sinkInputs</span>=$(pacmd list-sink-inputs | grep -B 4 <span class="org-string">"sink: $1 "</span> | awk <span class="org-string">'/index:/{print $2}'</span>)
}


<span class="org-keyword">function</span> <span class="org-function-name">volUp</span>() {
    <span class="org-comment-delimiter"># </span><span class="org-comment">Obtaining the current volume from pacmd into $VOL_LEVEL.</span>
    <span class="org-keyword">if</span> <span class="org-negation-char">!</span> getCurSink; <span class="org-keyword">then</span>
        <span class="org-builtin">echo</span> <span class="org-string">"PulseAudio not running"</span>
        <span class="org-keyword">return</span> 1
    <span class="org-keyword">fi</span>
    getCurVol <span class="org-string">"$curSink"</span>
    <span class="org-builtin">local</span> <span class="org-variable-name">maxLimit</span>=$((VOLUME_MAX - VOLUME_STEP))

    <span class="org-comment-delimiter"># </span><span class="org-comment">Checking the volume upper bounds so that if VOLUME_MAX was 100% and the</span>
    <span class="org-comment-delimiter"># </span><span class="org-comment">increase percentage was 3%, a 99% volume would top at 100% instead</span>
    <span class="org-comment-delimiter"># </span><span class="org-comment">of 102%. If the volume is above the maximum limit, nothing is done.</span>
    <span class="org-keyword">if</span> [ <span class="org-string">"$VOL_LEVEL"</span> -le <span class="org-string">"$VOLUME_MAX"</span> ] &amp;&amp; [ <span class="org-string">"$VOL_LEVEL"</span> -ge <span class="org-string">"$maxLimit"</span> ]; <span class="org-keyword">then</span>
        pactl set-sink-volume <span class="org-string">"$curSink"</span> <span class="org-string">"$VOLUME_MAX%"</span>
    <span class="org-keyword">elif</span> [ <span class="org-string">"$VOL_LEVEL"</span> -lt <span class="org-string">"$maxLimit"</span> ]; <span class="org-keyword">then</span>
        pactl set-sink-volume <span class="org-string">"$curSink"</span> <span class="org-string">"+$VOLUME_STEP%"</span>
    <span class="org-keyword">fi</span>

    <span class="org-keyword">if</span> [ $<span class="org-variable-name">OSD</span> = <span class="org-string">"yes"</span> ]; <span class="org-keyword">then</span> showOSD <span class="org-string">"$curSink"</span>; <span class="org-keyword">fi</span>
    <span class="org-keyword">if</span> [ $<span class="org-variable-name">AUTOSYNC</span> = <span class="org-string">"yes"</span> ]; <span class="org-keyword">then</span> volSync; <span class="org-keyword">fi</span>
}


<span class="org-keyword">function</span> <span class="org-function-name">volDown</span>() {
    <span class="org-comment-delimiter"># </span><span class="org-comment">Pactl already handles the volume lower bounds so that negative values</span>
    <span class="org-comment-delimiter"># </span><span class="org-comment">are ignored.</span>
    <span class="org-keyword">if</span> <span class="org-negation-char">!</span> getCurSink; <span class="org-keyword">then</span>
        <span class="org-builtin">echo</span> <span class="org-string">"PulseAudio not running"</span>
        <span class="org-keyword">return</span> 1
    <span class="org-keyword">fi</span>
    pactl set-sink-volume <span class="org-string">"$curSink"</span> <span class="org-string">"-$VOLUME_STEP%"</span>

    <span class="org-keyword">if</span> [ $<span class="org-variable-name">OSD</span> = <span class="org-string">"yes"</span> ]; <span class="org-keyword">then</span> showOSD <span class="org-string">"$curSink"</span>; <span class="org-keyword">fi</span>
    <span class="org-keyword">if</span> [ $<span class="org-variable-name">AUTOSYNC</span> = <span class="org-string">"yes"</span> ]; <span class="org-keyword">then</span> volSync; <span class="org-keyword">fi</span>
}


<span class="org-keyword">function</span> <span class="org-function-name">volSync</span>() {
    <span class="org-keyword">if</span> <span class="org-negation-char">!</span> getCurSink; <span class="org-keyword">then</span>
        <span class="org-builtin">echo</span> <span class="org-string">"PulseAudio not running"</span>
        <span class="org-keyword">return</span> 1
    <span class="org-keyword">fi</span>
    getSinkInputs <span class="org-string">"$curSink"</span>
    getCurVol <span class="org-string">"$curSink"</span>

    <span class="org-comment-delimiter"># </span><span class="org-comment">Every output found in the active sink has their volume set to the</span>
    <span class="org-comment-delimiter"># </span><span class="org-comment">current one. This will only be called if $AUTOSYNC is `yes`.</span>
    <span class="org-keyword">for</span> each<span class="org-keyword"> in</span> $<span class="org-variable-name">sinkInputs</span>; <span class="org-keyword">do</span>
        pactl set-sink-input-volume <span class="org-string">"$each"</span> <span class="org-string">"$VOL_LEVEL%"</span>
    <span class="org-keyword">done</span>
}


<span class="org-keyword">function</span> <span class="org-function-name">volMute</span>() {
    <span class="org-comment-delimiter"># </span><span class="org-comment">Switch to mute/unmute the volume with pactl.</span>
    <span class="org-keyword">if</span> <span class="org-negation-char">!</span> getCurSink; <span class="org-keyword">then</span>
        <span class="org-builtin">echo</span> <span class="org-string">"PulseAudio not running"</span>
        <span class="org-keyword">return</span> 1
    <span class="org-keyword">fi</span>
    <span class="org-keyword">if</span> [ <span class="org-string">"$1"</span> = <span class="org-string">"toggle"</span> ]; <span class="org-keyword">then</span>
        getIsMuted <span class="org-string">"$curSink"</span>
        <span class="org-keyword">if</span> [ <span class="org-string">"$isMuted"</span> = <span class="org-string">"yes"</span> ]; <span class="org-keyword">then</span>
            pactl set-sink-mute <span class="org-string">"$curSink"</span> <span class="org-string">"no"</span>
        <span class="org-keyword">else</span>
            pactl set-sink-mute <span class="org-string">"$curSink"</span> <span class="org-string">"yes"</span>
        <span class="org-keyword">fi</span>
    <span class="org-keyword">elif</span> [ <span class="org-string">"$1"</span> = <span class="org-string">"mute"</span> ]; <span class="org-keyword">then</span>
        pactl set-sink-mute <span class="org-string">"$curSink"</span> <span class="org-string">"yes"</span>
    <span class="org-keyword">elif</span> [ <span class="org-string">"$1"</span> = <span class="org-string">"unmute"</span> ]; <span class="org-keyword">then</span>
        pactl set-sink-mute <span class="org-string">"$curSink"</span> <span class="org-string">"no"</span>
    <span class="org-keyword">fi</span>

    <span class="org-keyword">if</span> [ $<span class="org-variable-name">OSD</span> = <span class="org-string">"yes"</span> ]; <span class="org-keyword">then</span> showOSD <span class="org-string">"$curSink"</span>; <span class="org-keyword">fi</span>
}


<span class="org-keyword">function</span> <span class="org-function-name">nextSink</span>() {
    <span class="org-comment-delimiter"># </span><span class="org-comment">The final sinks list, removing the blacklisted ones from the list of</span>
    <span class="org-comment-delimiter"># </span><span class="org-comment">currently available sinks.</span>
    <span class="org-keyword">if</span> <span class="org-negation-char">!</span> getCurSink; <span class="org-keyword">then</span>
        <span class="org-builtin">echo</span> <span class="org-string">"PulseAudio not running"</span>
        <span class="org-keyword">return</span> 1
    <span class="org-keyword">fi</span>

    <span class="org-comment-delimiter"># </span><span class="org-comment">Obtaining a tuple of sink indexes after removing the blacklisted devices</span>
    <span class="org-comment-delimiter"># </span><span class="org-comment">with their name.</span>
    <span class="org-variable-name">sinks</span>=()
    <span class="org-builtin">local</span> <span class="org-variable-name">i</span>=0
    <span class="org-keyword">while </span><span class="org-builtin">read</span> -r line; <span class="org-keyword">do</span>
        <span class="org-variable-name">index</span>=$(<span class="org-builtin">echo</span> <span class="org-string">"$line"</span> | cut -f1)
        <span class="org-variable-name">name</span>=$(<span class="org-builtin">echo</span> <span class="org-string">"$line"</span> | cut -f2)

        <span class="org-comment-delimiter"># </span><span class="org-comment">If it's in the blacklist, continue the main loop. Otherwise, add</span>
        <span class="org-comment-delimiter"># </span><span class="org-comment">it to the list.</span>
        <span class="org-keyword">for</span> sink<span class="org-keyword"> in</span> <span class="org-string">"${SINK_BLACKLIST[@]}"</span>; <span class="org-keyword">do</span>
            <span class="org-keyword">if</span> [ <span class="org-string">"$sink"</span> = <span class="org-string">"$name"</span> ]; <span class="org-keyword">then</span>
                <span class="org-keyword">continue</span> 2
            <span class="org-keyword">fi</span>
        <span class="org-keyword">done</span>

        <span class="org-variable-name">sinks</span>[$<span class="org-variable-name">i</span>]=<span class="org-string">"$index"</span>
        <span class="org-variable-name">i</span>=$((i + 1))
    <span class="org-keyword">done</span> &lt; &lt;(pactl list short sinks)

    <span class="org-comment-delimiter"># </span><span class="org-comment">If the resulting list is empty, nothing is done</span>
    <span class="org-keyword">if</span> [ ${#<span class="org-variable-name">sinks</span>[@]} -eq 0 ]; <span class="org-keyword">then return</span>; <span class="org-keyword">fi</span>

    <span class="org-comment-delimiter"># </span><span class="org-comment">If the current sink is greater or equal than last one, pick the first</span>
    <span class="org-comment-delimiter"># </span><span class="org-comment">sink in the list. Otherwise just pick the next sink avaliable.</span>
    <span class="org-builtin">local</span> newSink
    <span class="org-keyword">if</span> [ <span class="org-string">"$curSink"</span> -ge <span class="org-string">"${sinks[-1]}"</span> ]; <span class="org-keyword">then</span>
        <span class="org-variable-name">newSink</span>=${<span class="org-variable-name">sinks</span>[0]}
    <span class="org-keyword">else</span>
        <span class="org-keyword">for</span> sink<span class="org-keyword"> in</span> <span class="org-string">"${sinks[@]}"</span>; <span class="org-keyword">do</span>
            <span class="org-keyword">if</span> [ <span class="org-string">"$curSink"</span> -lt <span class="org-string">"$sink"</span> ]; <span class="org-keyword">then</span>
                <span class="org-variable-name">newSink</span>=$<span class="org-variable-name">sink</span>
                <span class="org-keyword">break</span>
            <span class="org-keyword">fi</span>
        <span class="org-keyword">done</span>
    <span class="org-keyword">fi</span>

    <span class="org-comment-delimiter"># </span><span class="org-comment">The new sink is set</span>
    pacmd set-default-sink <span class="org-string">"$newSink"</span>

    <span class="org-comment-delimiter"># </span><span class="org-comment">Move all audio threads to new sink</span>
    <span class="org-builtin">local</span> inputs
    <span class="org-variable-name">inputs</span>=<span class="org-string">"$(pactl list short sink-inputs | cut -f 1)"</span>
    <span class="org-keyword">for</span> i<span class="org-keyword"> in</span> $<span class="org-variable-name">inputs</span>; <span class="org-keyword">do</span>
        pacmd move-sink-input <span class="org-string">"$i"</span> <span class="org-string">"$newSink"</span>
    <span class="org-keyword">done</span>

    <span class="org-keyword">if</span> [ $<span class="org-variable-name">NOTIFICATIONS</span> = <span class="org-string">"yes"</span> ]; <span class="org-keyword">then</span>
        getNickname <span class="org-string">"$newSink"</span>

        <span class="org-keyword">if</span> command -v dunstify &amp;&gt;/dev/null; <span class="org-keyword">then</span>
            <span class="org-variable-name">notify</span>=<span class="org-string">"dunstify --replace 201839192"</span>
        <span class="org-keyword">else</span>
            <span class="org-variable-name">notify</span>=<span class="org-string">"notify-send"</span>
        <span class="org-keyword">fi</span>
        $<span class="org-variable-name">notify</span> <span class="org-string">"PulseAudio"</span> <span class="org-string">"Changed output to $SINK_NICKNAME"</span> --icon=audio-headphones-symbolic &amp;
    <span class="org-keyword">fi</span>
}


<span class="org-comment-delimiter"># </span><span class="org-comment">This function assumes that PulseAudio is already running. It only supports</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">KDE OSDs for now. It will show a system message with the status of the</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">sink passed by parameter, or the currently active one by default.</span>
<span class="org-keyword">function</span> <span class="org-function-name">showOSD</span>() {
    <span class="org-keyword">if</span> [ -z <span class="org-string">"$1"</span> ]; <span class="org-keyword">then</span>
        <span class="org-variable-name">curSink</span>=<span class="org-string">"$1"</span>
    <span class="org-keyword">else</span>
        getCurSink
    <span class="org-keyword">fi</span>
    getCurVol <span class="org-string">"$curSink"</span>
    getIsMuted <span class="org-string">"$curSink"</span>
    <span class="org-comment-delimiter">#</span><span class="org-comment">returns "$VOL_LEVEL" "$isMuted"</span>
    <span class="org-keyword">if</span> [[ $<span class="org-variable-name">VOL_LEVEL</span> == 0 || <span class="org-string">"yes"</span> = <span class="org-string">"$isMuted"</span> ]]; <span class="org-keyword">then</span>
        <span class="org-comment-delimiter"># </span><span class="org-comment">Show the sound muted notification</span>
        <span class="org-builtin">echo</span> <span class="org-string">"nope"</span>
        dunstify -a <span class="org-string">"changeVolume"</span> -u low -i audio-volume-muted -r <span class="org-string">"$msgId"</span> <span class="org-string">"Volume muted"</span>
    <span class="org-keyword">else</span>
        <span class="org-comment-delimiter"># </span><span class="org-comment">Show the volume notification</span>
        <span class="org-keyword">if</span> [ $<span class="org-variable-name">VOL_LEVEL</span> -lt 30 ];<span class="org-keyword">then</span>
            <span class="org-variable-name">ICON</span>=<span class="org-string">"audio-volume-low"</span>
        <span class="org-keyword">elif</span> [ $<span class="org-variable-name">VOL_LEVEL</span> -lt 65 ];<span class="org-keyword">then</span>
            <span class="org-variable-name">ICON</span>=<span class="org-string">"audio-volume-medium"</span>
        <span class="org-keyword">elif</span> [ $<span class="org-variable-name">VOL_LEVEL</span> -lt 100 ];<span class="org-keyword">then</span>
            <span class="org-variable-name">ICON</span>=<span class="org-string">"audio-volume-high"</span>
        <span class="org-keyword">else</span>
            <span class="org-variable-name">ICON</span>=<span class="org-string">"audio-volume-overamplified"</span>
        <span class="org-keyword">fi</span>

        dunstify -a <span class="org-string">"changeVolume"</span> -u low -i <span class="org-string">"$ICON"</span> -r <span class="org-string">"$msgId"</span> <span class="org-sh-escaped-newline">\</span>
                 <span class="org-string">"Volume: ${VOL_LEVEL}%"</span> <span class="org-string">"$(getProgressStringS 10 "&lt;b&gt;&#61713; &lt;/b&gt;" "&#61713; " $VOL_LEVEL)"</span>
    <span class="org-keyword">fi</span>
    <span class="org-comment-delimiter">#</span><span class="org-comment">echo "DB: vol_level:($VOL_LEVEL) isMuted: ($isMuted)"</span>
}


<span class="org-keyword">function</span> <span class="org-function-name">listen</span>() {
    <span class="org-builtin">local</span> <span class="org-variable-name">firstRun</span>=0

    <span class="org-comment-delimiter"># </span><span class="org-comment">Listen for changes and immediately create new output for the bar.</span>
    <span class="org-comment-delimiter"># </span><span class="org-comment">This is faster than having the script on an interval.</span>
    <span class="org-variable-name">LANG</span>=$<span class="org-variable-name">LANGUAGE</span> pactl subscribe 2&gt;/dev/null | {
        <span class="org-keyword">while </span><span class="org-builtin">true</span>; <span class="org-keyword">do</span>
            {
                <span class="org-comment-delimiter"># </span><span class="org-comment">If this is the first time just continue and print the current</span>
                <span class="org-comment-delimiter"># </span><span class="org-comment">state. Otherwise wait for events. This is to prevent the</span>
                <span class="org-comment-delimiter"># </span><span class="org-comment">module being empty until an event occurs.</span>
                <span class="org-keyword">if</span> [ $<span class="org-variable-name">firstRun</span> -eq 0 ]; <span class="org-keyword">then</span>
                    <span class="org-variable-name">firstRun</span>=1
                <span class="org-keyword">else</span>
                    <span class="org-builtin">read</span> -r event || <span class="org-keyword">break</span>
                    <span class="org-comment-delimiter"># </span><span class="org-comment">Avoid double events</span>
                    <span class="org-keyword">if ! </span><span class="org-builtin">echo</span> <span class="org-string">"$event"</span> | grep -e <span class="org-string">"on card"</span> -e <span class="org-string">"on sink"</span> -e <span class="org-string">"on server"</span>; <span class="org-keyword">then</span>
                        <span class="org-keyword">continue</span>
                    <span class="org-keyword">fi</span>
                <span class="org-keyword">fi</span>
            } &amp;&gt;/dev/null
            output
        <span class="org-keyword">done</span>
    }
}


<span class="org-keyword">function</span> <span class="org-function-name">output</span>() {
    <span class="org-keyword">if</span> <span class="org-negation-char">!</span> getCurSink; <span class="org-keyword">then</span>
        <span class="org-builtin">echo</span> <span class="org-string">"PulseAudio not running"</span>
        <span class="org-keyword">return</span> 1
    <span class="org-keyword">fi</span>
    getCurVol <span class="org-string">"$curSink"</span>
    getIsMuted <span class="org-string">"$curSink"</span>

    <span class="org-comment-delimiter"># </span><span class="org-comment">Fixed volume icons over max volume</span>
    <span class="org-builtin">local</span> <span class="org-variable-name">iconsLen</span>=${#<span class="org-variable-name">ICONS_VOLUME</span>[@]}
    <span class="org-keyword">if</span> [ <span class="org-string">"$iconsLen"</span> -ne 0 ]; <span class="org-keyword">then</span>
        <span class="org-builtin">local</span> <span class="org-variable-name">volSplit</span>=$((VOLUME_MAX / iconsLen))
        <span class="org-keyword">for</span> i<span class="org-keyword"> in</span> $(seq 1 <span class="org-string">"$iconsLen"</span>); <span class="org-keyword">do</span>
            <span class="org-keyword">if</span> [ $((i * volSplit)) -ge <span class="org-string">"$VOL_LEVEL"</span> ]; <span class="org-keyword">then</span>
                <span class="org-variable-name">VOL_ICON</span>=<span class="org-string">"${ICONS_VOLUME[$((i-1))]}"</span>
                <span class="org-keyword">break</span>
            <span class="org-keyword">fi</span>
        <span class="org-keyword">done</span>
    <span class="org-keyword">else</span>
        <span class="org-variable-name">VOL_ICON</span>=<span class="org-string">""</span>
    <span class="org-keyword">fi</span>

    getNickname <span class="org-string">"$curSink"</span>

    <span class="org-comment-delimiter"># </span><span class="org-comment">Showing the formatted message</span>
    <span class="org-keyword">if</span> [ <span class="org-string">"$isMuted"</span> = <span class="org-string">"yes"</span> ]; <span class="org-keyword">then</span>
        <span class="org-comment-delimiter"># </span><span class="org-comment">shellcheck disable=SC2034</span>
        <span class="org-variable-name">VOL_ICON</span>=$<span class="org-variable-name">ICON_MUTED</span>
        <span class="org-builtin">echo</span> <span class="org-string">"${COLOR_MUTED}$(eval echo "$FORMAT")${END_COLOR}"</span>
    <span class="org-keyword">else</span>
        <span class="org-builtin">eval</span> echo <span class="org-string">"$FORMAT"</span>
    <span class="org-keyword">fi</span>
}


<span class="org-keyword">function</span> <span class="org-function-name">usage</span>() {
    <span class="org-builtin">echo</span> <span class="org-string">"\</span>
<span class="org-string">Usage: $0 [OPTION...] ACTION</span>

<span class="org-string">Options: [defaults]</span>
<span class="org-string">  --autosync | --no-autosync            whether to maintain same volume for all</span>
<span class="org-string">                                        programs [$AUTOSYNC]</span>
<span class="org-string">  --color-muted &lt;rrggbb&gt;                color in which to format when muted</span>
<span class="org-string">                                        [${COLOR_MUTED:4:-1}]</span>
<span class="org-string">  --notifications | --no-notifications  whether to show notifications when</span>
<span class="org-string">                                        changing sinks [$NOTIFICATIONS]</span>
<span class="org-string">  --osd | --no-osd                      whether to display KDE's OSD message</span>
<span class="org-string">                                        [$OSD]</span>
<span class="org-string">  --icon-muted &lt;icon&gt;                   icon to use when muted [none]</span>
<span class="org-string">  --icon-sink &lt;icon&gt;                    icon to use for sink [none]</span>
<span class="org-string">  --format &lt;string&gt;                     use a format string to control the output</span>
<span class="org-string">                                        Available variables: \$VOL_ICON,</span>
<span class="org-string">                                        \$VOL_LEVEL, \$ICON_SINK, and</span>
<span class="org-string">                                        \$SINK_NICKNAME</span>
<span class="org-string">                                        [$FORMAT]</span>
<span class="org-string">  --icons-volume &lt;icon&gt;[,&lt;icon&gt;...]     icons for volume, from lower to higher</span>
<span class="org-string">                                        [none]</span>
<span class="org-string">  --volume-max &lt;int&gt;                    maximum volume to which to allow</span>
<span class="org-string">                                        increasing [$VOLUME_MAX]</span>
<span class="org-string">  --volume-step &lt;int&gt;                   step size when inc/decrementing volume</span>
<span class="org-string">                                        [$VOLUME_STEP]</span>
<span class="org-string">  --sink-blacklist &lt;name&gt;[,&lt;name&gt;...]   sinks to ignore when switching [none]</span>
<span class="org-string">  --sink-nicknames-from &lt;prop&gt;          pacmd property to use for sink names,</span>
<span class="org-string">                                        unless overriden by --sink-nickname.</span>
<span class="org-string">                                        Its possible values are listed under</span>
<span class="org-string">                                        the 'properties' key in the output of</span>
<span class="org-string">                                        \`pacmd list-sinks\` [none]</span>
<span class="org-string">  --sink-nickname &lt;name&gt;:&lt;nick&gt;         nickname to assign to given sink name,</span>
<span class="org-string">                                        taking priority over</span>
<span class="org-string">                                        --sink-nicknames-from. May be given</span>
<span class="org-string">                                        multiple times, and 'name' is exactly as</span>
<span class="org-string">                                        listed in the output of</span>
<span class="org-string">                                        \`pactl list sinks short | cut -f2\`</span>
<span class="org-string">                                        [none]</span>

<span class="org-string">Actions:</span>
<span class="org-string">  help              display this message and exit</span>
<span class="org-string">  output            print the PulseAudio status once</span>
<span class="org-string">  listen            listen for changes in PulseAudio to automatically update</span>
<span class="org-string">                    this script's output</span>
<span class="org-string">  up, down          increase or decrease the default sink's volume</span>
<span class="org-string">  mute, unmute      mute or unmute the default sink's audio</span>
<span class="org-string">  togmute           switch between muted and unmuted</span>
<span class="org-string">  next-sink         switch to the next available sink</span>
<span class="org-string">  sync              synchronize all the output streams volume to be the same as</span>
<span class="org-string">                    the current sink's volume</span>

<span class="org-string">Author:</span>
<span class="org-string">    Mario Ortiz Manero</span>
<span class="org-string">More info on GitHub:</span>
<span class="org-string">    https://github.com/marioortizmanero/polybar-pulseaudio-control"</span>
}

<span class="org-keyword">while</span> [[ <span class="org-string">"$1"</span> = --* ]]; <span class="org-keyword">do</span>
    <span class="org-builtin">unset</span> arg
    <span class="org-builtin">unset</span> val
    <span class="org-keyword">if</span> [[ <span class="org-string">"$1"</span> = *=* ]]; <span class="org-keyword">then</span>
        <span class="org-variable-name">arg</span>=<span class="org-string">"${1//=*/}"</span>
        <span class="org-variable-name">val</span>=<span class="org-string">"${1//*=/}"</span>
        <span class="org-builtin">shift</span>
    <span class="org-keyword">else</span>
        <span class="org-variable-name">arg</span>=<span class="org-string">"$1"</span>
        <span class="org-comment-delimiter"># </span><span class="org-comment">Support space-separated values, but also value-less flags</span>
        <span class="org-keyword">if</span> [[ <span class="org-string">"$2"</span> != --* ]]; <span class="org-keyword">then</span>
            <span class="org-variable-name">val</span>=<span class="org-string">"$2"</span>
            <span class="org-builtin">shift</span>
        <span class="org-keyword">fi</span>
        <span class="org-builtin">shift</span>
    <span class="org-keyword">fi</span>

    <span class="org-keyword">case</span> <span class="org-string">"$arg"</span><span class="org-keyword"> in</span>
        --autosync)
            <span class="org-variable-name">AUTOSYNC</span>=yes
            ;;
        --no-autosync)
            <span class="org-variable-name">AUTOSYNC</span>=no
            ;;
        --color-muted|--colour-muted)
            <span class="org-variable-name">COLOR_MUTED</span>=<span class="org-string">"%{F#$val}"</span>
            ;;
        --notifications)
            <span class="org-variable-name">NOTIFICATIONS</span>=yes
            ;;
        --no-notifications)
            <span class="org-variable-name">NOTIFICATIONS</span>=no
            ;;
        --osd)
            <span class="org-variable-name">OSD</span>=yes
            ;;
        --no-osd)
            <span class="org-variable-name">OSD</span>=no
            ;;
        --icon-muted)
            <span class="org-variable-name">ICON_MUTED</span>=<span class="org-string">"$val"</span>
            ;;
        --icon-sink)
            <span class="org-comment-delimiter"># </span><span class="org-comment">shellcheck disable=SC2034</span>
            <span class="org-variable-name">ICON_SINK</span>=<span class="org-string">"$val"</span>
            ;;
        --icons-volume)
            <span class="org-variable-name">IFS</span>=, read -r -a ICONS_VOLUME &lt;&lt;&lt; <span class="org-string">"$val"</span>
            ;;
        --volume-max)
            <span class="org-variable-name">VOLUME_MAX</span>=<span class="org-string">"$val"</span>
            ;;
        --volume-step)
            <span class="org-variable-name">VOLUME_STEP</span>=<span class="org-string">"$val"</span>
            ;;
        --sink-blacklist)
            <span class="org-variable-name">IFS</span>=, read -r -a SINK_BLACKLIST &lt;&lt;&lt; <span class="org-string">"$val"</span>
            ;;
        --sink-nicknames-from)
            <span class="org-variable-name">SINK_NICKNAMES_PROP</span>=<span class="org-string">"$val"</span>
            ;;
        --sink-nickname)
            <span class="org-variable-name">SINK_NICKNAMES</span>[<span class="org-string">"${val//:*/}"</span>]=<span class="org-string">"${val//*:}"</span>
            ;;
        --format)
            <span class="org-variable-name">FORMAT</span>=<span class="org-string">"$val"</span>
            ;;
        *)
            <span class="org-builtin">echo</span> <span class="org-string">"Unrecognised option: $arg"</span> &gt;&amp;2
            <span class="org-keyword">exit</span> 1
            ;;
    <span class="org-keyword">esac</span>
<span class="org-keyword">done</span>

<span class="org-keyword">case</span> <span class="org-string">"$1"</span><span class="org-keyword"> in</span>
    up)
        volUp
        ;;
    down)
        volDown
        ;;
    togmute)
        volMute toggle
        ;;
    mute)
        volMute mute
        ;;
    unmute)
        volMute unmute
        ;;
    sync)
        volSync
        ;;
    listen)
        listen
        ;;
    next-sink)
        nextSink
        ;;
    output)
        output
        ;;
    help)
        usage
        ;;
    *)
        <span class="org-builtin">echo</span> <span class="org-string">"Unrecognised action: $1"</span> &gt;&amp;2
        <span class="org-keyword">exit</span> 1
        ;;
<span class="org-keyword">esac</span>
</pre>
</div>

<p>
Alsa version, sometimes got stuck, unused
</p>

<div class="org-src-container">
<pre class="src src-shell"><span class="org-comment-delimiter"># </span><span class="org-comment">changeVolume</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">Source: https://wiki.archlinux.org/index.php/Dunst#Appearance</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">Arbitrary but unique message id</span>
<span class="org-variable-name">msgId</span>=<span class="org-string">"991049"</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">Change the volume using alsa(might differ if you use pulseaudio)</span>
amixer -c 0 set Master <span class="org-string">"$@"</span> &gt; /dev/null

<span class="org-comment-delimiter"># </span><span class="org-comment">Query amixer for the current volume and whether or not the speaker is muted</span>
<span class="org-variable-name">volume</span>=<span class="org-string">"$(amixer -c 0 get Master | tail -1 | awk '{print $4}' | sed 's/[^0-9]*//g')"</span>
<span class="org-variable-name">mute</span>=<span class="org-string">"$(amixer -c 0 get Master | tail -1 | awk '{print $6}' | sed 's/[^a-z]*//g')"</span>
<span class="org-keyword">if</span> [[ $<span class="org-variable-name">volume</span> == 0 || <span class="org-string">"$mute"</span> == <span class="org-string">"off"</span> ]]; <span class="org-keyword">then</span>
    <span class="org-comment-delimiter"># </span><span class="org-comment">Show the sound muted notification</span>
    dunstify -a <span class="org-string">"changeVolume"</span> -u low -i audio-volume-muted -r <span class="org-string">"$msgId"</span> <span class="org-string">"Volume muted"</span>
<span class="org-keyword">else</span>
    <span class="org-comment-delimiter"># </span><span class="org-comment">Show the volume notification</span>
    dunstify -a <span class="org-string">"changeVolume"</span> -u low -i audio-volume-high -r <span class="org-string">"$msgId"</span> <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"Volume: ${volume}%"</span> <span class="org-string">"$(getProgressStringS 10 "&lt;b&gt;&#61713; &lt;/b&gt;" "&#61713; " $volume)"</span>
<span class="org-keyword">fi</span>
</pre>
</div>

<p>
Helperscript.
</p>

<div class="org-src-container">
<pre class="src src-shell"><span class="org-comment-delimiter"># </span><span class="org-comment">getProgressString &lt;TOTAL ITEMS&gt; &lt;FILLED LOOK&gt; &lt;NOT FILLED LOOK&gt; &lt;STATUS&gt;</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">For instance:</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">$ getProgressString 10 "#" "-" 50</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">#####-----</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">Note: if you want to use | in your progress bar string you need to change the delimiter in the sed commands</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">Source: https://github.com/Fabian-G/dotfiles/blob/master/scripts/bin/getProgressString</span>

<span class="org-variable-name">ITEMS</span>=<span class="org-string">"$1"</span> <span class="org-comment-delimiter"># </span><span class="org-comment">The total number of items(the width of the bar)</span>
<span class="org-variable-name">FILLED_ITEM</span>=<span class="org-string">"$2"</span> <span class="org-comment-delimiter"># </span><span class="org-comment">The look of a filled item</span>
<span class="org-variable-name">NOT_FILLED_ITEM</span>=<span class="org-string">"$3"</span> <span class="org-comment-delimiter"># </span><span class="org-comment">The look of a not filled item</span>
<span class="org-variable-name">STATUS</span>=<span class="org-string">"$4"</span> <span class="org-comment-delimiter"># </span><span class="org-comment">The current progress status in percent</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">calculate how many items need to be filled and not filled</span>
<span class="org-variable-name">FILLED_ITEMS</span>=$(<span class="org-builtin">echo</span> <span class="org-string">"((${ITEMS} * ${STATUS})/100 + 0.5) / 1"</span> | bc)
<span class="org-variable-name">NOT_FILLED_ITEMS</span>=$(<span class="org-builtin">echo</span> <span class="org-string">"$ITEMS - $FILLED_ITEMS"</span> | bc)

<span class="org-comment-delimiter"># </span><span class="org-comment">Assemble the bar string</span>
<span class="org-variable-name">msg</span>=$(printf <span class="org-string">"%${FILLED_ITEMS}s"</span> | sed <span class="org-string">"s| |${FILLED_ITEM}|g"</span>)
<span class="org-variable-name">msg</span>=${<span class="org-variable-name">msg</span>}$(printf <span class="org-string">"%${NOT_FILLED_ITEMS}s"</span> | sed <span class="org-string">"s| |${NOT_FILLED_ITEM}|g"</span>)
<span class="org-builtin">echo</span> <span class="org-string">"$msg"</span>
</pre>
</div>
</div>
</div>
