ws.org
*** toggleTouchpadS
    #+begin_src shell :shebang "#!/bin/sh" :tangle-mode (identity #o555) :tangle "~/.local/bin/toggleTouchpadS"
msgId="991050"
device="$(xinput list | grep -P '(?<= )[\w\s:]*(?i)(touchpad|synaptics)(?-i).*?(?=\s*id)' -o | head -n1)"
# If it was activated disable it and if it wasn't disable it
if [[ "$(xinput list-props "$device" | grep -P ".*Device Enabled.*\K.(?=$)" -o)" == "1" ]];then
    xinput disable "$device"
    dunstify -a "changeVolume" -u low -i audio-volume-muted -r "$msgId" "Touchpad off"
else
    xinput enable "$device"
    dunstify -a "changeVolume" -u low -i audio-volume-muted -r "$msgId" "Touchpad on"
fi
    #+end_src
*** backlightS

    Orig: [[https://github.com/Fabian-G/dotfiles/blob/master/scripts/bin/changeBrightness][Fabian-G]]

    #+begin_src shell :shebang "#!/bin/sh" :tangle-mode (identity #o555) :tangle "~/.local/bin/backlightS"
msgId="981141"
xbacklight -time 0 -steps 1 "$@"
exactBrightness=$(xbacklight -get)
brightness=$(echo "(${exactBrightness} + 0.5) / 1" | bc)
dunstify -a "changeBrightness" -u low -i display-brightness-symbolic.symbolic -r "$msgId" \
"Brightness: ${brightness}%" "$(getProgressStringS 10 " " " " $exactBrightness)"


    #+end_src
** Sysadmin scripts
*** menuEditConfigsS
    #+begin_src shell :shebang "#!/bin/sh" :tangle-mode (identity #o555) :tangle "~/.local/bin/menuEditConfigsS"
# Adapted from https://www.gitlab.com/dwt1/dotfiles/-/blob/master/.dmenu/dmenu-edit-configs.sh

die() {
    echo "Error: $@"
    exit 1
    }
[ -z "$1" ] && die "This must be called with arguments"

# Command line arguments
MENU_CMD=$1
EDITOR_CMD=$2

# Options to pass to the menu program (list of config file names)
options="alacritty
zshrc
zshenv
zprofile
aliases
picom
qutebrowser
xmonad.hs
Xresources
quit"

# Choose one of the files, using $MENU_CMD
choice=`echo "$options" | $MENU_CMD "Edit config file: "`

# Find the path to the chosen file
case "$choice" in
    alacritty)
        file="$HOME/.config/alacritty/base.yml"
    ;;
    zshrc)
        file="$ZDOTDIR/.zshrc"
    ;;
    zshenv)
        file="$ZDOTDIR/.zshenv"
    ;;
    aliases)
        file="$HOME/.config/shell/aliasrc"
    ;;
    picom)
        file="$HOME/.config/picom/picom.conf"
    ;;
    zprofile)
        file="$ZDOTDIR/.zprofile"
    ;;
    qutebrowser)
        file="$HOME/.config/qutebrowser/config.py"
    ;;
    qutebrowser)
        file="$HOME/.config/qutebrowser/config.py"
    ;;
    xmonad.hs)
        file="$HOME/Projects/WS/ws.org"
    ;;
    ,*)
        exit 1
    ;;
esac

# Edit the chosen file, with the user-specified program
$EDITOR_CMD "$file"

    #+end_src
** Screenshots

   # Recording
   # Take screenshot
   # Print: Record audio or video; Del: kill recording
   super + Print
   dmenurecord
   super + Delete
   dmenurecord kill

   #+begin_src shell :shebang "#!/bin/bash" :tangle-mode (identity #o555) :tangle "~/.local/bin/screenshotS"
APP="maim"
LOCATION="$HOME/Pictures/Screenshots"
FNAME="screenshot-$(date '+%Y-%m-%d-%H:%M:%S').png"
TARGET="$LOCATION/$FNAME"
SMALL="/tmp/$FNAME.tmp"
CHOICE="Fullscreen"

mkdir -p "$LOCATION"

shoot() {
    CHOICE=$(printf "Selected area\\nCurrent window\\nFull screen\\nSelected area (copy)\\nCurrent window (copy)\\nFll screen (copy)" | rofi -dmenu -l 6 -i -p "Screenshot which area?")

    case "$CHOICE" in

        "Selected area")
            maim -s "$TARGET" ;;
        "Current window")
            maim -i "$(xdotool getactivewindow)"  "$TARGET" ;;
        "Full screen")
            sleep 0.5 && maim  "$TARGET" #Don't want the menu
            ;;
        "Selected area (copy)")
            maim -s |tee "$TARGET" | xclip -selection clipboard -t image/png ;;
        "Current window (copy)")
            maim -i "$(xdotool getactivewindow)" |tee "$TARGET" | xclip -selection clipboard -t image/png ;;
        "Full screen (copy)")
            sleep 0.5 && maim |tee "$TARGET" | xclip -selection clipboard -t image/png ;;
    esac
}

notify() {
    convert "$TARGET" -resize 128x128  "$SMALL"
    notify-send "$CHOICE" "screen-\nshot" -i "$SMALL"
    rm "$SMALL"
}

usage() {
    cat <<-EOF
     $(basename $0) -h -n
     -h this message
     -n screenshot
      If you use the script with -n, you get a fullscreen screenshot,
     otherwise:
     - Selected area
     - Current window
     - Full screen
     - Selected area (copy)
     - Current window (copy)
     - Full screen (copy)
EOF
    exit
}

while getopts "hn" opt; do
    case $opt in
        n)
            $APP "$TARGET" && notify
            exit
            ;;
        ,*) usage ;;
    esac
done

shoot && notify
   #+end_src

