docs/ws.html
<div id="outline-container-org4459fa3" class="outline-4">
<h4 id="org4459fa3">toggleTouchpadS</h4>
<div class="outline-text-4" id="text-org4459fa3">
<div class="org-src-container">
<pre class="src src-shell"><span class="org-variable-name">msgId</span>=<span class="org-string">"991050"</span>
<span class="org-variable-name">device</span>=<span class="org-string">"$(xinput list | grep -P '(?&lt;= )[\w\s:]*(?i)(touchpad|synaptics)(?-i).*?(?=\s*id)' -o | head -n1)"</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">If it was activated disable it and if it wasn't disable it</span>
<span class="org-keyword">if</span> [[ <span class="org-string">"$(xinput list-props "$device" | grep -P ".*Device Enabled.*\K.(?=$)" -o)"</span> == <span class="org-string">"1"</span> ]];<span class="org-keyword">then</span>
    xinput disable <span class="org-string">"$device"</span>
    dunstify -a <span class="org-string">"changeVolume"</span> -u low -i audio-volume-muted -r <span class="org-string">"$msgId"</span> <span class="org-string">"Touchpad off"</span>
<span class="org-keyword">else</span>
    xinput enable <span class="org-string">"$device"</span>
    dunstify -a <span class="org-string">"changeVolume"</span> -u low -i audio-volume-muted -r <span class="org-string">"$msgId"</span> <span class="org-string">"Touchpad on"</span>
<span class="org-keyword">fi</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orge1fecc7" class="outline-4">
<h4 id="orge1fecc7">backlightS</h4>
<div class="outline-text-4" id="text-orge1fecc7">
<p>
Orig: <a href="https://github.com/Fabian-G/dotfiles/blob/master/scripts/bin/changeBrightness">Fabian-G</a>
</p>

<div class="org-src-container">
<pre class="src src-shell"><span class="org-variable-name">msgId</span>=<span class="org-string">"981141"</span>
xbacklight -time 0 -steps 1 <span class="org-string">"$@"</span>
<span class="org-variable-name">exactBrightness</span>=$(xbacklight -get)
<span class="org-variable-name">brightness</span>=$(<span class="org-builtin">echo</span> <span class="org-string">"(${exactBrightness} + 0.5) / 1"</span> | bc)
dunstify -a <span class="org-string">"changeBrightness"</span> -u low -i display-brightness-symbolic.symbolic -r <span class="org-string">"$msgId"</span> <span class="org-sh-escaped-newline">\</span>
<span class="org-string">"Brightness: ${brightness}%"</span> <span class="org-string">"$(getProgressStringS 10 "&#61713; " "&#61915; " $exactBrightness)"</span>


</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org3a684ff" class="outline-3">
<h3 id="org3a684ff">Sysadmin scripts</h3>
<div class="outline-text-3" id="text-org3a684ff">
</div>
<div id="outline-container-org77606c5" class="outline-4">
<h4 id="org77606c5">menuEditConfigsS</h4>
<div class="outline-text-4" id="text-org77606c5">
<div class="org-src-container">
<pre class="src src-shell"><span class="org-comment-delimiter"># </span><span class="org-comment">Adapted from https://www.gitlab.com/dwt1/dotfiles/-/blob/master/.dmenu/dmenu-edit-configs.sh</span>

<span class="org-function-name">die</span>() {
    <span class="org-builtin">echo</span> <span class="org-string">"Error: $@"</span>
    <span class="org-keyword">exit</span> 1
    }
[ -z <span class="org-string">"$1"</span> ] &amp;&amp; die <span class="org-string">"This must be called with arguments"</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">Command line arguments</span>
<span class="org-variable-name">MENU_CMD</span>=$<span class="org-variable-name">1</span>
<span class="org-variable-name">EDITOR_CMD</span>=$<span class="org-variable-name">2</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">Options to pass to the menu program (list of config file names)</span>
<span class="org-variable-name">options</span>=<span class="org-string">"alacritty</span>
<span class="org-string">zshrc</span>
<span class="org-string">zshenv</span>
<span class="org-string">zprofile</span>
<span class="org-string">aliases</span>
<span class="org-string">picom</span>
<span class="org-string">qutebrowser</span>
<span class="org-string">xmonad.hs</span>
<span class="org-string">Xresources</span>
<span class="org-string">quit"</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">Choose one of the files, using $MENU_CMD</span>
<span class="org-variable-name">choice</span>=<span class="org-sh-quoted-exec">`echo "$options" | $MENU_CMD "Edit config file: "`</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">Find the path to the chosen file</span>
<span class="org-keyword">case</span> <span class="org-string">"$choice"</span><span class="org-keyword"> in</span>
    alacritty)
        <span class="org-variable-name">file</span>=<span class="org-string">"$HOME/.config/alacritty/base.yml"</span>
    ;;
    zshrc)
        <span class="org-variable-name">file</span>=<span class="org-string">"$ZDOTDIR/.zshrc"</span>
    ;;
    zshenv)
        <span class="org-variable-name">file</span>=<span class="org-string">"$ZDOTDIR/.zshenv"</span>
    ;;
    aliases)
        <span class="org-variable-name">file</span>=<span class="org-string">"$HOME/.config/shell/aliasrc"</span>
    ;;
    picom)
        <span class="org-variable-name">file</span>=<span class="org-string">"$HOME/.config/picom/picom.conf"</span>
    ;;
    zprofile)
        <span class="org-variable-name">file</span>=<span class="org-string">"$ZDOTDIR/.zprofile"</span>
    ;;
    qutebrowser)
        <span class="org-variable-name">file</span>=<span class="org-string">"$HOME/.config/qutebrowser/config.py"</span>
    ;;
    qutebrowser)
        <span class="org-variable-name">file</span>=<span class="org-string">"$HOME/.config/qutebrowser/config.py"</span>
    ;;
    xmonad.hs)
        <span class="org-variable-name">file</span>=<span class="org-string">"$HOME/Projects/WS/ws.org"</span>
    ;;
    *)
        <span class="org-keyword">exit</span> 1
    ;;
<span class="org-keyword">esac</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">Edit the chosen file, with the user-specified program</span>
$<span class="org-variable-name">EDITOR_CMD</span> <span class="org-string">"$file"</span>

</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org196add6" class="outline-3">
<h3 id="org196add6">Screenshots</h3>
<div class="outline-text-3" id="text-org196add6">
<p>
super + Print
dmenurecord
super + Delete
dmenurecord kill
</p>

<div class="org-src-container">
<pre class="src src-shell"><span class="org-variable-name">APP</span>=<span class="org-string">"maim"</span>
<span class="org-variable-name">LOCATION</span>=<span class="org-string">"$HOME/Pictures/Screenshots"</span>
<span class="org-variable-name">FNAME</span>=<span class="org-string">"screenshot-$(date '+%Y-%m-%d-%H:%M:%S').png"</span>
<span class="org-variable-name">TARGET</span>=<span class="org-string">"$LOCATION/$FNAME"</span>
<span class="org-variable-name">SMALL</span>=<span class="org-string">"/tmp/$FNAME.tmp"</span>
<span class="org-variable-name">CHOICE</span>=<span class="org-string">"Fullscreen"</span>

mkdir -p <span class="org-string">"$LOCATION"</span>

<span class="org-function-name">shoot</span>() {
    <span class="org-variable-name">CHOICE</span>=$(printf <span class="org-string">"Selected area\\nCurrent window\\nFull screen\\nSelected area (copy)\\nCurrent window (copy)\\nFll screen (copy)"</span> | rofi -dmenu -l 6 -i -p <span class="org-string">"Screenshot which area?"</span>)

    <span class="org-keyword">case</span> <span class="org-string">"$CHOICE"</span><span class="org-keyword"> in</span>

        <span class="org-string">"Selected area"</span>)
            maim -s <span class="org-string">"$TARGET"</span> ;;
        <span class="org-string">"Current window"</span>)
            maim -i <span class="org-string">"$(xdotool getactivewindow)"</span>  <span class="org-string">"$TARGET"</span> ;;
        <span class="org-string">"Full screen"</span>)
            sleep 0.5 &amp;&amp; maim  <span class="org-string">"$TARGET"</span> <span class="org-comment-delimiter">#</span><span class="org-comment">Don't want the menu</span>
            ;;
        <span class="org-string">"Selected area (copy)"</span>)
            maim -s |tee <span class="org-string">"$TARGET"</span> | xclip -selection clipboard -t image/png ;;
        <span class="org-string">"Current window (copy)"</span>)
            maim -i <span class="org-string">"$(xdotool getactivewindow)"</span> |tee <span class="org-string">"$TARGET"</span> | xclip -selection clipboard -t image/png ;;
        <span class="org-string">"Full screen (copy)"</span>)
            sleep 0.5 &amp;&amp; maim |tee <span class="org-string">"$TARGET"</span> | xclip -selection clipboard -t image/png ;;
    <span class="org-keyword">esac</span>
}

<span class="org-function-name">notify</span>() {
    convert <span class="org-string">"$TARGET"</span> -resize 128x128  <span class="org-string">"$SMALL"</span>
    notify-send <span class="org-string">"$CHOICE"</span> <span class="org-string">"screen-\nshot"</span> -i <span class="org-string">"$SMALL"</span>
    rm <span class="org-string">"$SMALL"</span>
}

<span class="org-function-name">usage</span>() {
    cat &lt;&lt;-EOF
<span class="org-sh-heredoc">     $(basename $0) -h -n</span>
<span class="org-sh-heredoc">     -h this message</span>
<span class="org-sh-heredoc">     -n screenshot</span>
<span class="org-sh-heredoc">      If you use the script with -n, you get a fullscreen screenshot,</span>
<span class="org-sh-heredoc">     otherwise:</span>
<span class="org-sh-heredoc">     - Selected area</span>
<span class="org-sh-heredoc">     - Current window</span>
<span class="org-sh-heredoc">     - Full screen</span>
<span class="org-sh-heredoc">     - Selected area (copy)</span>
<span class="org-sh-heredoc">     - Current window (copy)</span>
<span class="org-sh-heredoc">     - Full screen (copy)</span>
<span class="org-sh-heredoc">EOF</span>
    <span class="org-keyword">exit</span>
}

<span class="org-keyword">while </span><span class="org-builtin">getopts</span> <span class="org-string">"hn"</span> opt; <span class="org-keyword">do</span>
    <span class="org-keyword">case</span> $<span class="org-variable-name">opt</span><span class="org-keyword"> in</span>
        n)
            $<span class="org-variable-name">APP</span> <span class="org-string">"$TARGET"</span> &amp;&amp; notify
            <span class="org-keyword">exit</span>
            ;;
        *) usage ;;
    <span class="org-keyword">esac</span>
<span class="org-keyword">done</span>

shoot &amp;&amp; notify
</pre>
</div>
</div>
</div>
</div>
