ws.org
* Xmobar

  Three kind of fonts used, regular, bold for the time, and font-awesome for icons.
  Colors the same as in =xmonad.hs=.

  #+begin_src haskell :tangle "~/.config/xmobar/xmobarrc2.hs"
  Config { position   = Top
           , font              = "xft:Source Code Pro:size=9:bold:antialias=true"
           , additionalFonts   = [ "xft:FontAwesome:pixelsize=16:antialias=true:hinting=true:style=Bold",
                                   "xft:Noto Sans:size=10:style=Bold"]
           , fgColor  = "#ffffff"
           , bgColor  = "#000000"
           , alpha    = 150  -- 0 transparent, 255 opaque
           , sepChar  = "%"
           , alignSep = "}{"
           , template = " %StdinReader% }{ %cpu%  %memory%  %coretemp% %wi%  %battery% %keyb% | %date% "
           , commands = [ Run StdinReader
                        --, Run Date "%_I:%M" "time" 300 -- every 30s
                        --, Run Date "%A %_d %B" "date" 18000 -- every 30min
                        -- CPU core temperature
                        , Run CoreTemp [ "--template" , "<core0>/<core1>°C"
                                       , "--Low"      , "70"
                                       , "--High"     , "80"
                                       , "--low"      , "#33BB33"
                                       , "--normal"   , "#AA8800"
                                       , "--high"     , "#FF0000"
                                       ] 50 -- every 5s
                       , Run Com "myKbS" [] "keyb" 20
                       , Run Cpu [ "--template", "<fc=#a9a1e1><fn=1></fn></fc> <total>%"
                                --, "--normal","#bbc2cf"
                                , "-L", "40"
                                , "-H", "60"
                                , "-l", "#586e75"
                                , "-h", "#dc322f" -- red
                                ] 50
                       , Run Memory ["-t","<fc=#51afef><fn=1></fn></fc> <usedratio>%"
                                    , "-H","80"
                                    , "-L","10"
                                    , "-l", "#586e75"
                                    , "-h", "#268bd2" -- blue, just to differentiate from cpu bar
                                    ] 50
                       , Run Wireless "" -- will match any wireless device
                         [ "-a", "l"
                         , "-x", "-"
                         --, "-t", "<fc=#6c71c4><fn=1>\xf1eb</fn> <essid> <quality>%</fc>"
                         , "-t", "<fc=#6c71c4><fn=1>\xf1eb</fn> <essid>"
                         , "-L", "50"
                         , "-H", "75"
                         -- , "-l", "#dc322f" -- red
                         , "-l", "#6c71c4" -- violet
                         , "-n", "#6c71c4" -- violet
                         , "-h", "#6c71c4" -- violet
                         ] 10
                       , Run Battery
                         [ "-t", "<fc=#b58900><acstatus></fc>"
                         , "-L", "20"
                         , "-H", "85"
                         , "-l", "#dc322f"
                         , "-n", "#b58900"
                         , "-h", "#b58900"
                         , "--" -- battery specific options
                         -- discharging status
                         , "-o"  , "<fn=1>\xf242</fn> <left>% (<timeleft>) <watts>"
                         -- AC "on" status
                         , "-O"  , "<fn=1>\xf1e6</fn> <left>%"
                         -- charged status
                         , "-i"  , "<fn=1>\xf1e6</fn> <left>%"
                         , "--off-icon-pattern", "<fn=1>\xf1e6</fn>"
                         , "--on-icon-pattern", "<fn=1>\xf1e6</fn>"
                         ] 10
                       , Run Date "<fc=#268bd2><fn=1>\xf073</fn> %a %_d %b %Y | d.%j w.%W</fc>   <fc=#2AA198><fn=1></fn><fn=2> %H:%M:%S</fn></fc>" "date" 10
                        ]
           }

   #+end_src

  #+begin_src haskell :tangle "~/.config/xmobar/xmobarrc.hs"
  Config { position   = Top
           , font              = "xft:Source Code Pro:size=9:bold:antialias=true"
           , additionalFonts   = [ "xft:FontAwesome:pixelsize=16:antialias=true:hinting=true:style=Bold",
                                   "xft:Noto Sans:size=10:style=Bold"]
           , fgColor  = "#ffffff"
           , bgColor  = "#000000"
           , alpha    = 150  -- 0 transparent, 255 opaque
           , sepChar  = "%"
           , alignSep = "}{"
           , template = " %StdinReader% }{ %cpu%  %memory%  %coretemp% %wi%  %battery% %keyb% | %date% "
           , commands = [ Run StdinReader
                        --, Run Date "%_I:%M" "time" 300 -- every 30s
                        --, Run Date "%A %_d %B" "date" 18000 -- every 30min
                        -- CPU core temperature
                        , Run CoreTemp [ "--template" , "<core0>/<core1>°C"
                                       , "--Low"      , "70"
                                       , "--High"     , "80"
                                       , "--low"      , "#33BB33"
                                       , "--normal"   , "#AA8800"
                                       , "--high"     , "#FF0000"
                                       ] 50 -- every 5s
                       , Run Com "myKbS" [] "keyb" 20
                       , Run Cpu [ "--template", "<fc=#a9a1e1><fn=1></fn></fc> <total>%"
                                --, "--normal","#bbc2cf"
                                , "-L", "40"
                                , "-H", "60"
                                , "-l", "#586e75"
                                , "-h", "#dc322f" -- red
                                ] 50
                       , Run Memory ["-t","<fc=#51afef><fn=1></fn></fc> <usedratio>%"
                                    , "-H","80"
                                    , "-L","10"
                                    , "-l", "#586e75"
                                    , "-h", "#268bd2" -- blue, just to differentiate from cpu bar
                                    ] 50
                       , Run Wireless "" -- will match any wireless device
                         [ "-a", "l"
                         , "-x", "-"
                         --, "-t", "<fc=#6c71c4><fn=1>\xf1eb</fn> <essid> <quality>%</fc>"
                         , "-t", "<fc=#6c71c4><fn=1>\xf1eb</fn> <essid></fc>"
                         , "-L", "50"
                         , "-H", "75"
                         -- , "-l", "#dc322f" -- red
                         , "-l", "#6c71c4" -- violet
                         , "-n", "#6c71c4" -- violet
                         , "-h", "#6c71c4" -- violet
                         ] 10
                       , Run Battery
                         [ "-t", "<fc=#b58900><acstatus></fc>"
                         , "-L", "20"
                         , "-H", "85"
                         , "-l", "#dc322f"
                         , "-n", "#b58900"
                         , "-h", "#b58900"
                         , "--" -- battery specific options
                         -- discharging status
                         , "-o"  , "<fn=1>\xf242</fn> <left>% (<timeleft>) <watts>"
                         -- AC "on" status
                         , "-O"  , "<fn=1>\xf1e6</fn> <left>%"
                         -- charged status
                         , "-i"  , "<fn=1>\xf1e6</fn> <left>%"
                         , "--off-icon-pattern", "<fn=1>\xf1e6</fn>"
                         , "--on-icon-pattern", "<fn=1>\xf1e6</fn>"
                         ] 10
                       , Run Date "<fc=#268bd2><fn=1>\xf073</fn> %a %_d %b %Y | d.%j w.%W</fc>   <fc=#2AA198><fn=1></fn><fn=2> %H:%M:%S</fn></fc>" "date" 10
                        ]
           }

   #+end_src


  #+begin_src haskell :tangle "~/.config/xmobar/xmobarDebug.hs"
  Config { position = Top
           , font     = "xft:Source Code Pro:size=9:bold:antialias=true"
           , additionalFonts   = [ "xft:FontAwesome:pixelsize=16:antialias=true:hinting=true",
                                   "xft:Noto Sans:size=10:style=Bold"]
           , fgColor = "#ffffff"
           , bgColor = "#000000"
           -- , alpha = 50  -- 0 transparent, 255 opaque
           , sepChar = "%"
           , alignSep = "}{"
           , template = " %UnsafeStdinReader% "
           , commands = [ Run UnsafeStdinReader --StdinReader
                        ]
           }

   #+end_src

