docs/ws.html

<div id="outline-container-org45976d0" class="outline-2">
<h2 id="org45976d0">Xmobar</h2>
<div class="outline-text-2" id="text-org45976d0">
<p>
Three kind of fonts used, regular, bold for the time, and font-awesome for icons.
Colors the same as in <code>xmonad.hs</code>.
</p>

<div class="org-src-container">
<pre class="src src-haskell">  <span class="org-haskell-constructor">Config</span> { position   <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Top</span>
           , font              <span class="org-haskell-operator">=</span> <span class="org-string">"xft:Source Code Pro:size=9:bold:antialias=true"</span>
           , additionalFonts   <span class="org-haskell-operator">=</span> [ <span class="org-string">"xft:FontAwesome:pixelsize=16:antialias=true:hinting=true:style=Bold"</span>,
                                   <span class="org-string">"xft:Noto Sans:size=10:style=Bold"</span>]
           , fgColor  <span class="org-haskell-operator">=</span> <span class="org-string">"#ffffff"</span>
           , bgColor  <span class="org-haskell-operator">=</span> <span class="org-string">"#000000"</span>
           , alpha    <span class="org-haskell-operator">=</span> 150  <span class="org-comment-delimiter">-- </span><span class="org-comment">0 transparent, 255 opaque</span>
           , sepChar  <span class="org-haskell-operator">=</span> <span class="org-string">"%"</span>
           , alignSep <span class="org-haskell-operator">=</span> <span class="org-string">"}{"</span>
           , template <span class="org-haskell-operator">=</span> <span class="org-string">" %StdinReader% }{ %cpu%  %memory%  %coretemp% %wi%  %battery% %keyb% | %date% "</span>
           , commands <span class="org-haskell-operator">=</span> [ <span class="org-haskell-constructor">Run</span> <span class="org-haskell-constructor">StdinReader</span>
                        <span class="org-comment-delimiter">--</span><span class="org-comment">, Run Date "%_I:%M" "time" 300 -- every 30s</span>
                        <span class="org-comment-delimiter">--</span><span class="org-comment">, Run Date "%A %_d %B" "date" 18000 -- every 30min</span>
                        <span class="org-comment-delimiter">-- </span><span class="org-comment">CPU core temperature</span>
                        , <span class="org-haskell-constructor">Run</span> <span class="org-haskell-constructor">CoreTemp</span> [ <span class="org-string">"--template"</span> , <span class="org-string">"&lt;core0&gt;/&lt;core1&gt;&#176;C"</span>
                                       , <span class="org-string">"--Low"</span>      , <span class="org-string">"70"</span>
                                       , <span class="org-string">"--High"</span>     , <span class="org-string">"80"</span>
                                       , <span class="org-string">"--low"</span>      , <span class="org-string">"#33BB33"</span>
                                       , <span class="org-string">"--normal"</span>   , <span class="org-string">"#AA8800"</span>
                                       , <span class="org-string">"--high"</span>     , <span class="org-string">"#FF0000"</span>
                                       ] 50 <span class="org-comment-delimiter">-- </span><span class="org-comment">every 5s</span>
                       , <span class="org-haskell-constructor">Run</span> <span class="org-haskell-constructor">Com</span> <span class="org-string">"myKbS"</span> <span class="org-haskell-constructor">[]</span> <span class="org-string">"keyb"</span> 20
                       , <span class="org-haskell-constructor">Run</span> <span class="org-haskell-constructor">Cpu</span> [ <span class="org-string">"--template"</span>, <span class="org-string">"&lt;fc=#a9a1e1&gt;&lt;fn=1&gt;&#61573;&lt;/fn&gt;&lt;/fc&gt; &lt;total&gt;%"</span>
                                <span class="org-comment-delimiter">--</span><span class="org-comment">, "--normal","#bbc2cf"</span>
                                , <span class="org-string">"-L"</span>, <span class="org-string">"40"</span>
                                , <span class="org-string">"-H"</span>, <span class="org-string">"60"</span>
                                , <span class="org-string">"-l"</span>, <span class="org-string">"#586e75"</span>
                                , <span class="org-string">"-h"</span>, <span class="org-string">"#dc322f"</span> <span class="org-comment-delimiter">-- </span><span class="org-comment">red</span>
                                ] 50
                       , <span class="org-haskell-constructor">Run</span> <span class="org-haskell-constructor">Memory</span> [<span class="org-string">"-t"</span>,<span class="org-string">"&lt;fc=#51afef&gt;&lt;fn=1&gt;&#62171;&lt;/fn&gt;&lt;/fc&gt; &lt;usedratio&gt;%"</span>
                                    , <span class="org-string">"-H"</span>,<span class="org-string">"80"</span>
                                    , <span class="org-string">"-L"</span>,<span class="org-string">"10"</span>
                                    , <span class="org-string">"-l"</span>, <span class="org-string">"#586e75"</span>
                                    , <span class="org-string">"-h"</span>, <span class="org-string">"#268bd2"</span> <span class="org-comment-delimiter">-- </span><span class="org-comment">blue, just to differentiate from cpu bar</span>
                                    ] 50
                       , <span class="org-haskell-constructor">Run</span> <span class="org-haskell-constructor">Wireless</span> <span class="org-string">""</span> <span class="org-comment-delimiter">-- </span><span class="org-comment">will match any wireless device</span>
                         [ <span class="org-string">"-a"</span>, <span class="org-string">"l"</span>
                         , <span class="org-string">"-x"</span>, <span class="org-string">"-"</span>
                         <span class="org-comment-delimiter">--</span><span class="org-comment">, "-t", "&lt;fc=#6c71c4&gt;&lt;fn=1&gt;\xf1eb&lt;/fn&gt; &lt;essid&gt; &lt;quality&gt;%&lt;/fc&gt;"</span>
                         , <span class="org-string">"-t"</span>, <span class="org-string">"&lt;fc=#6c71c4&gt;&lt;fn=1&gt;\xf1eb&lt;/fn&gt; &lt;essid&gt;"</span>
                         , <span class="org-string">"-L"</span>, <span class="org-string">"50"</span>
                         , <span class="org-string">"-H"</span>, <span class="org-string">"75"</span>
                         <span class="org-comment-delimiter">-- </span><span class="org-comment">, "-l", "#dc322f" -- red</span>
                         , <span class="org-string">"-l"</span>, <span class="org-string">"#6c71c4"</span> <span class="org-comment-delimiter">-- </span><span class="org-comment">violet</span>
                         , <span class="org-string">"-n"</span>, <span class="org-string">"#6c71c4"</span> <span class="org-comment-delimiter">-- </span><span class="org-comment">violet</span>
                         , <span class="org-string">"-h"</span>, <span class="org-string">"#6c71c4"</span> <span class="org-comment-delimiter">-- </span><span class="org-comment">violet</span>
                         ] 10
                       , <span class="org-haskell-constructor">Run</span> <span class="org-haskell-constructor">Battery</span>
                         [ <span class="org-string">"-t"</span>, <span class="org-string">"&lt;fc=#b58900&gt;&lt;acstatus&gt;&lt;/fc&gt;"</span>
                         , <span class="org-string">"-L"</span>, <span class="org-string">"20"</span>
                         , <span class="org-string">"-H"</span>, <span class="org-string">"85"</span>
                         , <span class="org-string">"-l"</span>, <span class="org-string">"#dc322f"</span>
                         , <span class="org-string">"-n"</span>, <span class="org-string">"#b58900"</span>
                         , <span class="org-string">"-h"</span>, <span class="org-string">"#b58900"</span>
                         , <span class="org-string">"--"</span> <span class="org-comment-delimiter">-- </span><span class="org-comment">battery specific options</span>
                         <span class="org-comment-delimiter">-- </span><span class="org-comment">discharging status</span>
                         , <span class="org-string">"-o"</span>  , <span class="org-string">"&lt;fn=1&gt;\xf242&lt;/fn&gt; &lt;left&gt;% (&lt;timeleft&gt;) &lt;watts&gt;"</span>
                         <span class="org-comment-delimiter">-- </span><span class="org-comment">AC "on" status</span>
                         , <span class="org-string">"-O"</span>  , <span class="org-string">"&lt;fn=1&gt;\xf1e6&lt;/fn&gt; &lt;left&gt;%"</span>
                         <span class="org-comment-delimiter">-- </span><span class="org-comment">charged status</span>
                         , <span class="org-string">"-i"</span>  , <span class="org-string">"&lt;fn=1&gt;\xf1e6&lt;/fn&gt; &lt;left&gt;%"</span>
                         , <span class="org-string">"--off-icon-pattern"</span>, <span class="org-string">"&lt;fn=1&gt;\xf1e6&lt;/fn&gt;"</span>
                         , <span class="org-string">"--on-icon-pattern"</span>, <span class="org-string">"&lt;fn=1&gt;\xf1e6&lt;/fn&gt;"</span>
                         ] 10
                       , <span class="org-haskell-constructor">Run</span> <span class="org-haskell-constructor">Date</span> <span class="org-string">"&lt;fc=#268bd2&gt;&lt;fn=1&gt;\xf073&lt;/fn&gt; %a %_d %b %Y | d.%j w.%W&lt;/fc&gt;   &lt;fc=#2AA198&gt;&lt;fn=1&gt;&#61463;&lt;/fn&gt;&lt;fn=2&gt; %H:%M:%S&lt;/fn&gt;&lt;/fc&gt;"</span> <span class="org-string">"date"</span> 10
                        ]
           }

</pre>
</div>

<div class="org-src-container">
<pre class="src src-haskell">  <span class="org-haskell-constructor">Config</span> { position   <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Top</span>
           , font              <span class="org-haskell-operator">=</span> <span class="org-string">"xft:Source Code Pro:size=9:bold:antialias=true"</span>
           , additionalFonts   <span class="org-haskell-operator">=</span> [ <span class="org-string">"xft:FontAwesome:pixelsize=16:antialias=true:hinting=true:style=Bold"</span>,
                                   <span class="org-string">"xft:Noto Sans:size=10:style=Bold"</span>]
           , fgColor  <span class="org-haskell-operator">=</span> <span class="org-string">"#ffffff"</span>
           , bgColor  <span class="org-haskell-operator">=</span> <span class="org-string">"#000000"</span>
           , alpha    <span class="org-haskell-operator">=</span> 150  <span class="org-comment-delimiter">-- </span><span class="org-comment">0 transparent, 255 opaque</span>
           , sepChar  <span class="org-haskell-operator">=</span> <span class="org-string">"%"</span>
           , alignSep <span class="org-haskell-operator">=</span> <span class="org-string">"}{"</span>
           , template <span class="org-haskell-operator">=</span> <span class="org-string">" %StdinReader% }{ %cpu%  %memory%  %coretemp% %wi%  %battery% %keyb% | %date% "</span>
           , commands <span class="org-haskell-operator">=</span> [ <span class="org-haskell-constructor">Run</span> <span class="org-haskell-constructor">StdinReader</span>
                        <span class="org-comment-delimiter">--</span><span class="org-comment">, Run Date "%_I:%M" "time" 300 -- every 30s</span>
                        <span class="org-comment-delimiter">--</span><span class="org-comment">, Run Date "%A %_d %B" "date" 18000 -- every 30min</span>
                        <span class="org-comment-delimiter">-- </span><span class="org-comment">CPU core temperature</span>
                        , <span class="org-haskell-constructor">Run</span> <span class="org-haskell-constructor">CoreTemp</span> [ <span class="org-string">"--template"</span> , <span class="org-string">"&lt;core0&gt;/&lt;core1&gt;&#176;C"</span>
                                       , <span class="org-string">"--Low"</span>      , <span class="org-string">"70"</span>
                                       , <span class="org-string">"--High"</span>     , <span class="org-string">"80"</span>
                                       , <span class="org-string">"--low"</span>      , <span class="org-string">"#33BB33"</span>
                                       , <span class="org-string">"--normal"</span>   , <span class="org-string">"#AA8800"</span>
                                       , <span class="org-string">"--high"</span>     , <span class="org-string">"#FF0000"</span>
                                       ] 50 <span class="org-comment-delimiter">-- </span><span class="org-comment">every 5s</span>
                       , <span class="org-haskell-constructor">Run</span> <span class="org-haskell-constructor">Com</span> <span class="org-string">"myKbS"</span> <span class="org-haskell-constructor">[]</span> <span class="org-string">"keyb"</span> 20
                       , <span class="org-haskell-constructor">Run</span> <span class="org-haskell-constructor">Cpu</span> [ <span class="org-string">"--template"</span>, <span class="org-string">"&lt;fc=#a9a1e1&gt;&lt;fn=1&gt;&#61573;&lt;/fn&gt;&lt;/fc&gt; &lt;total&gt;%"</span>
                                <span class="org-comment-delimiter">--</span><span class="org-comment">, "--normal","#bbc2cf"</span>
                                , <span class="org-string">"-L"</span>, <span class="org-string">"40"</span>
                                , <span class="org-string">"-H"</span>, <span class="org-string">"60"</span>
                                , <span class="org-string">"-l"</span>, <span class="org-string">"#586e75"</span>
                                , <span class="org-string">"-h"</span>, <span class="org-string">"#dc322f"</span> <span class="org-comment-delimiter">-- </span><span class="org-comment">red</span>
                                ] 50
                       , <span class="org-haskell-constructor">Run</span> <span class="org-haskell-constructor">Memory</span> [<span class="org-string">"-t"</span>,<span class="org-string">"&lt;fc=#51afef&gt;&lt;fn=1&gt;&#62171;&lt;/fn&gt;&lt;/fc&gt; &lt;usedratio&gt;%"</span>
                                    , <span class="org-string">"-H"</span>,<span class="org-string">"80"</span>
                                    , <span class="org-string">"-L"</span>,<span class="org-string">"10"</span>
                                    , <span class="org-string">"-l"</span>, <span class="org-string">"#586e75"</span>
                                    , <span class="org-string">"-h"</span>, <span class="org-string">"#268bd2"</span> <span class="org-comment-delimiter">-- </span><span class="org-comment">blue, just to differentiate from cpu bar</span>
                                    ] 50
                       , <span class="org-haskell-constructor">Run</span> <span class="org-haskell-constructor">Wireless</span> <span class="org-string">""</span> <span class="org-comment-delimiter">-- </span><span class="org-comment">will match any wireless device</span>
                         [ <span class="org-string">"-a"</span>, <span class="org-string">"l"</span>
                         , <span class="org-string">"-x"</span>, <span class="org-string">"-"</span>
                         <span class="org-comment-delimiter">--</span><span class="org-comment">, "-t", "&lt;fc=#6c71c4&gt;&lt;fn=1&gt;\xf1eb&lt;/fn&gt; &lt;essid&gt; &lt;quality&gt;%&lt;/fc&gt;"</span>
                         , <span class="org-string">"-t"</span>, <span class="org-string">"&lt;fc=#6c71c4&gt;&lt;fn=1&gt;\xf1eb&lt;/fn&gt; &lt;essid&gt;&lt;/fc&gt;"</span>
                         , <span class="org-string">"-L"</span>, <span class="org-string">"50"</span>
                         , <span class="org-string">"-H"</span>, <span class="org-string">"75"</span>
                         <span class="org-comment-delimiter">-- </span><span class="org-comment">, "-l", "#dc322f" -- red</span>
                         , <span class="org-string">"-l"</span>, <span class="org-string">"#6c71c4"</span> <span class="org-comment-delimiter">-- </span><span class="org-comment">violet</span>
                         , <span class="org-string">"-n"</span>, <span class="org-string">"#6c71c4"</span> <span class="org-comment-delimiter">-- </span><span class="org-comment">violet</span>
                         , <span class="org-string">"-h"</span>, <span class="org-string">"#6c71c4"</span> <span class="org-comment-delimiter">-- </span><span class="org-comment">violet</span>
                         ] 10
                       , <span class="org-haskell-constructor">Run</span> <span class="org-haskell-constructor">Battery</span>
                         [ <span class="org-string">"-t"</span>, <span class="org-string">"&lt;fc=#b58900&gt;&lt;acstatus&gt;&lt;/fc&gt;"</span>
                         , <span class="org-string">"-L"</span>, <span class="org-string">"20"</span>
                         , <span class="org-string">"-H"</span>, <span class="org-string">"85"</span>
                         , <span class="org-string">"-l"</span>, <span class="org-string">"#dc322f"</span>
                         , <span class="org-string">"-n"</span>, <span class="org-string">"#b58900"</span>
                         , <span class="org-string">"-h"</span>, <span class="org-string">"#b58900"</span>
                         , <span class="org-string">"--"</span> <span class="org-comment-delimiter">-- </span><span class="org-comment">battery specific options</span>
                         <span class="org-comment-delimiter">-- </span><span class="org-comment">discharging status</span>
                         , <span class="org-string">"-o"</span>  , <span class="org-string">"&lt;fn=1&gt;\xf242&lt;/fn&gt; &lt;left&gt;% (&lt;timeleft&gt;) &lt;watts&gt;"</span>
                         <span class="org-comment-delimiter">-- </span><span class="org-comment">AC "on" status</span>
                         , <span class="org-string">"-O"</span>  , <span class="org-string">"&lt;fn=1&gt;\xf1e6&lt;/fn&gt; &lt;left&gt;%"</span>
                         <span class="org-comment-delimiter">-- </span><span class="org-comment">charged status</span>
                         , <span class="org-string">"-i"</span>  , <span class="org-string">"&lt;fn=1&gt;\xf1e6&lt;/fn&gt; &lt;left&gt;%"</span>
                         , <span class="org-string">"--off-icon-pattern"</span>, <span class="org-string">"&lt;fn=1&gt;\xf1e6&lt;/fn&gt;"</span>
                         , <span class="org-string">"--on-icon-pattern"</span>, <span class="org-string">"&lt;fn=1&gt;\xf1e6&lt;/fn&gt;"</span>
                         ] 10
                       , <span class="org-haskell-constructor">Run</span> <span class="org-haskell-constructor">Date</span> <span class="org-string">"&lt;fc=#268bd2&gt;&lt;fn=1&gt;\xf073&lt;/fn&gt; %a %_d %b %Y | d.%j w.%W&lt;/fc&gt;   &lt;fc=#2AA198&gt;&lt;fn=1&gt;&#61463;&lt;/fn&gt;&lt;fn=2&gt; %H:%M:%S&lt;/fn&gt;&lt;/fc&gt;"</span> <span class="org-string">"date"</span> 10
                        ]
           }

</pre>
</div>


<div class="org-src-container">
<pre class="src src-haskell">  <span class="org-haskell-constructor">Config</span> { position <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Top</span>
           , font     <span class="org-haskell-operator">=</span> <span class="org-string">"xft:Source Code Pro:size=9:bold:antialias=true"</span>
           , additionalFonts   <span class="org-haskell-operator">=</span> [ <span class="org-string">"xft:FontAwesome:pixelsize=16:antialias=true:hinting=true"</span>,
                                   <span class="org-string">"xft:Noto Sans:size=10:style=Bold"</span>]
           , fgColor <span class="org-haskell-operator">=</span> <span class="org-string">"#ffffff"</span>
           , bgColor <span class="org-haskell-operator">=</span> <span class="org-string">"#000000"</span>
           <span class="org-comment-delimiter">-- </span><span class="org-comment">, alpha = 50  -- 0 transparent, 255 opaque</span>
           , sepChar <span class="org-haskell-operator">=</span> <span class="org-string">"%"</span>
           , alignSep <span class="org-haskell-operator">=</span> <span class="org-string">"}{"</span>
           , template <span class="org-haskell-operator">=</span> <span class="org-string">" %UnsafeStdinReader% "</span>
           , commands <span class="org-haskell-operator">=</span> [ <span class="org-haskell-constructor">Run</span> <span class="org-haskell-constructor">UnsafeStdinReader</span> <span class="org-comment-delimiter">--</span><span class="org-comment">StdinReader</span>
                        ]
           }

</pre>
</div>
</div>
</div>
